{
  "doc_id": "vi-cntt1112",
  "language": "vi",
  "course_name": "Kiến trúc máy tính",
  "course_variant": "",
  "course_code": "CNTT1112",
  "source_filename": "Kiến trúc máy tính_CNTT1112.docx",
  "source_relpath": "data\\raw\\vi\\Kiến trúc máy tính_CNTT1112.docx",
  "source_hash": "ea8428b04261dc97bea43df1cbf121d4",
  "source_modified": "2025-10-11T10:42:50.634202+00:00",
  "processed_at": "2025-10-12T13:24:17.739113+00:00",
  "outline": [
    {
      "sequence": 1,
      "level": 1,
      "title": "1. THÔNG TIN TỔNG QUÁT (General Information)"
    },
    {
      "sequence": 2,
      "level": 1,
      "title": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
    },
    {
      "sequence": 3,
      "level": 1,
      "title": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
    },
    {
      "sequence": 4,
      "level": 1,
      "title": "4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares)"
    },
    {
      "sequence": 5,
      "level": 2,
      "title": "4.1. Giáo trình"
    },
    {
      "sequence": 6,
      "level": 2,
      "title": "4.2. Tài liệu tham khảo"
    },
    {
      "sequence": 7,
      "level": 2,
      "title": "4.3. Phần mềm"
    },
    {
      "sequence": 8,
      "level": 1,
      "title": "5. MỤC TIÊU HỌC PHẦN (Course Goals)"
    },
    {
      "sequence": 9,
      "level": 1,
      "title": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)"
    },
    {
      "sequence": 10,
      "level": 1,
      "title": "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)"
    },
    {
      "sequence": 11,
      "level": 2,
      "title": "7.1. Cơ cấu điểm thành phần"
    },
    {
      "sequence": 12,
      "level": 2,
      "title": "7.2. Ma trận đề thi (phụ lục 1)"
    },
    {
      "sequence": 13,
      "level": 2,
      "title": "7.3. Các rubrics (phụ lục 2)"
    },
    {
      "sequence": 14,
      "level": 1,
      "title": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)"
    },
    {
      "sequence": 15,
      "level": 1,
      "title": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)"
    },
    {
      "sequence": 16,
      "level": 2,
      "title": "10.1. Quy định về điều kiện thi kết thúc học phần"
    },
    {
      "sequence": 17,
      "level": 2,
      "title": "10.2. Quy định về tham dự lớp học"
    },
    {
      "sequence": 18,
      "level": 2,
      "title": "10.3. Quy định về hành vi trong lớp học"
    },
    {
      "sequence": 19,
      "level": 2,
      "title": "10.4. Quy định về nộp bài tập lớn"
    },
    {
      "sequence": 20,
      "level": 1,
      "title": "11. THỜI ĐIỂM HIỆU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)"
    },
    {
      "sequence": 21,
      "level": 1,
      "title": "PHỤ LỤC"
    },
    {
      "sequence": 22,
      "level": 2,
      "title": "Phụ lục 1. MA TRẬN ĐỀ THI"
    },
    {
      "sequence": 23,
      "level": 2,
      "title": "Phụ lục 2. CÁC RUBRICS"
    }
  ],
  "stats": {
    "paragraphs": 63,
    "headings": 23,
    "tables": 12,
    "chunks": 22,
    "words": 4435
  },
  "chunks": [
    {
      "chunk_id": "vi-cntt1112#001",
      "text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐH KINH TẾ QUỐC DÂN _______________________ | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc _______________________\nĐỀ CƯƠNG HỌC PHẦN CHI TIẾT\n(Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ-ĐHKTQD ngày 18 tháng 6 năm 2024)",
      "word_count": 55,
      "char_count": 289,
      "heading_path": [],
      "primary_heading": null,
      "breadcrumbs": "",
      "position": {
        "order": 1,
        "start_block": 0,
        "end_block": 5
      }
    },
    {
      "chunk_id": "vi-cntt1112#002",
      "text": "- Tên học phần (tiếng Việt): \tKiến trúc máy tính\n- Tên học phần (tiếng Anh):\tComputer Architecture\n- Trình độ đào tạo \t\tĐại học\n- Mã học phần: \t\t\tCNTT1112\n- Số tín chỉ: \t\t\t03\n- Số giờ trên lớp:\t45\n- Số giờ tự học:\t\t105\n(01 tín chỉ bằng 50 giờ định mức, 01 giờ định mức bằng 50 phút)\n- Các học phần tiên quyết:\n- Nhập môn Công nghệ thông tin (CNTT1116)",
      "word_count": 76,
      "char_count": 351,
      "heading_path": [
        "1. THÔNG TIN TỔNG QUÁT (General Information)"
      ],
      "primary_heading": "1. THÔNG TIN TỔNG QUÁT (General Information)",
      "breadcrumbs": "1. THÔNG TIN TỔNG QUÁT (General Information)",
      "position": {
        "order": 2,
        "start_block": 6,
        "end_block": 17
      }
    },
    {
      "chunk_id": "vi-cntt1112#003",
      "text": "(Management Faculty and Teachers)\n- Khoa/Viện quản lý học phần: Khoa Công nghệ thông tin\n- Địa chỉ: P1310 - P1312 Nhà A1, Trường ĐH Kinh tế Quốc dân, 207 Giải Phóng, Hai Bà Trưng, Hà Nội\n- Giảng viên giảng dạy học phần:\nSTT | Họ và tên | Email\n1 | TS. Đặng Minh Quân | quandm@neu.edu.vn\n2 | TS. Nguyễn Thanh Hương | huongnt_cntt@neu.edu.vn",
      "word_count": 67,
      "char_count": 339,
      "heading_path": [
        "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
      ],
      "primary_heading": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "breadcrumbs": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "position": {
        "order": 3,
        "start_block": 18,
        "end_block": 24
      }
    },
    {
      "chunk_id": "vi-cntt1112#004",
      "text": "Học phần này giới thiệu các hoạt động của hệ thống máy tính ở mức độ kiến trúc câu lệnh (Instruction Set Architecture – ISA). Cung cấp các kiến thức cơ bản về nguyên lý thiết kế của các máy tính hiện đại và các thành phần của chúng. Học phần tập trung đặc biệt vào các kỹ thuật đường ống, thiết kế phân tầng bộ nhớ. Các vấn đề về mặt thực hiện cũng được chú trọng. Các phương pháp đo lường và phân tích hiệu năng cũng được thảo luận để đánh giá các kiến trúc khác nhau.\nHọc phần cũng nhằm rèn luyện khả năng tư duy, kỹ năng tính toán và nâng cao khả năng ứng dụng các kiến thức vào phân tích, nghiên cứu các vấn đề trong lĩnh vực kiến trúc máy tính. Học phần trang bị cho người học những kiến thức, kỹ năng và năng lực cần thiết để tìm kiếm, truy xuất và khai thác các nguồn tài liệu liên quan đến môn học và tiếp tục học cao hơn.\nNội dung chính:",
      "word_count": 182,
      "char_count": 846,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "position": {
        "order": 4,
        "start_block": 25,
        "end_block": 27
      }
    },
    {
      "chunk_id": "vi-cntt1112#005",
      "text": "- Khái niệm, đo lường hiệu năng\n- Nguyên lý thiết kế định lượng\n- Phân loại ISA\n- Kiến trúc MIPS\n- Kỹ thuật đường ống: khái niệm, cơ chế hoạt động, hazard\n- Các kỹ thuật song song hóa mức câu lệnh\n- Phân tầng bộ nhớ\n- Kiến trúc đa CPUs",
      "word_count": 54,
      "char_count": 235,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "position": {
        "order": 5,
        "start_block": 28,
        "end_block": 37
      }
    },
    {
      "chunk_id": "vi-cntt1112#006",
      "text": "[1] John L. Hennessy (2012) Computer Architecture - A quantitative Approach, Mk Publisher.",
      "word_count": 13,
      "char_count": 90,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares)",
        "4.1. Giáo trình"
      ],
      "primary_heading": "4.1. Giáo trình",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares) > 4.1. Giáo trình",
      "position": {
        "order": 6,
        "start_block": 39,
        "end_block": 40
      }
    },
    {
      "chunk_id": "vi-cntt1112#007",
      "text": "[2] Patterson, D. A., and J. L. Hennessy. Computer Organization and Design: The Hardware/Software Interface, 3rd ed. San Mateo, CA: Morgan Kaufman, 2004. ISBN: 1558606041.",
      "word_count": 25,
      "char_count": 171,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares)",
        "4.2. Tài liệu tham khảo"
      ],
      "primary_heading": "4.2. Tài liệu tham khảo",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares) > 4.2. Tài liệu tham khảo",
      "position": {
        "order": 7,
        "start_block": 41,
        "end_block": 42
      }
    },
    {
      "chunk_id": "vi-cntt1112#008",
      "text": "Bảng 1. Mục tiêu học phần\nMã / Code | Mô tả mục tiêu học phần (CG) | CĐR/PLO của CTĐT\n[1] | [2] | [3]\nCG1 | Học phần cung cấp cho người học các kiến thức: Các khái niệm cơ bản về hiệu năng Các nguyên lý ISA Kỹ thuật đường ống Hệ thống bộ nhớ | -\nCG2 | Học phần hướng dẫn cho người học các kỹ năng xử lý các tình huống chuyên môn một cách có hệ thống. Sinh viên biết cách phối hợp với nhau để cùng giải quyết một vấn đề chuyên môn đúng thời hạn. | -\nCG3 | Học phần góp phần phát triển khả năng giải quyết vấn đề độc lập cũng như khả năng làm việc nhóm để cùng giải quyết các vấn đề chuyên môn. Bước đầu trang bị cho người học nhận thức về bối cảnh xã hội, nhận thức đạo đức nghề nghiệp, trách nhiệm xã hội trong lĩnh vực CNTT. | -",
      "word_count": 168,
      "char_count": 729,
      "heading_path": [
        "5. MỤC TIÊU HỌC PHẦN (Course Goals)"
      ],
      "primary_heading": "5. MỤC TIÊU HỌC PHẦN (Course Goals)",
      "breadcrumbs": "5. MỤC TIÊU HỌC PHẦN (Course Goals)",
      "position": {
        "order": 8,
        "start_block": 44,
        "end_block": 46
      }
    },
    {
      "chunk_id": "vi-cntt1112#009",
      "text": "Bảng 2. Chuẩn đầu ra học phần (CLO)\nMục tiêu | CLO | Mô tả CLO | Mức độ đạt được\n[1] | [2] | [3] | [4]\nCG1 Kiến thức | CLO1.1 | Nêu được các khái niệm hiệu năng, kiến trúc CPU, kiến trúc đường ống, kiến trúc bộ đệm . . . | 1\nCG1 Kiến thức | CLO1.2 | Giải thích được mô hình hoạt động của kiến trúc RISC | 2\nCG1 Kiến thức | CLO1.3 | Ứng dụng luật Amdahl để quyết định cải tiến nào là tốt nhất, phân biệt sự khác biệt về hiệu năng giữa bộ đệm lớn và tần số đồng hồ cao, phân biệt được sự khác nhau giữa liên kết trực tiếp và liên kết tập hợp trong bộ đệm | 3\nCG1 Kiến thức | CLO1.4 | Vận dụng các kiến thức đã học để giải quyết các bài tập, các tình huống của từng nội dung học tập. | 3\nCG2 Kĩ năng | CLO2.1 | Có kỹ năng tìm kiếm, thu thập, tổng hợp, phân tích, giải quyết các vấn đề đặc trưng của chuyên ngành | 2\nCG2 Kĩ năng | CLO2.2 | Có kỹ năng làm việc nhóm để cùng giải quyết một vấn đề chuyên môn đúng thời hạn. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.1 | Có khả năng tự học tập, tự tìm hiểu tài liệu để hoàn thành các bài học và bài tập được giao. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.2 | Có khả năng tổ chức và phối hợp nhóm làm việc để cùng giải quyết một vấn đề của môn học. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.3 | Có ý thức tổ chức kỷ luật lớp học, tuân thủ các nội quy lớp học, có tinh thần hợp tác và trách nhiệm cá nhân đối với các hoạt động được giảng viên giao. | 3",
      "word_count": 339,
      "char_count": 1420,
      "heading_path": [
        "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)"
      ],
      "primary_heading": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)",
      "breadcrumbs": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)",
      "position": {
        "order": 9,
        "start_block": 47,
        "end_block": 48
      }
    },
    {
      "chunk_id": "vi-cntt1112#010",
      "text": "Bảng 3. Đánh giá học phần\nHình thức đánh giá | Nội dung / Bài đánh giá | Thời điểm | CLOs | Công cụ và tiêu chí đánh giá | Tỷ lệ (%) | CĐR/PLO của CTĐT\n[1] | [2] | [3] | [4] | [5] | [6] | [7]\nChuyên cần | Thái độ học tập trên lớp Trả lời câu hỏi trên lớp Trả lời các câu hỏi thảo luận | Tuần 1-12 | CLO1.x, CLO2.1, CLO3.1, CLO3.3 | Nhật ký giảng dạy của giảng viên với các tiêu chí đánh giá: (i) Mức độ tham gia (ii) Mức độ tương tác (iii) Chất lượng câu trả lời Xem Phụ lục 2, rubrics 1 | 10% | -\nĐánh giá quá trình | Bài kiểm tra giữa kỳ | Tuần 8 | CLO1.x, CLO2.1, CLO3.3 | Tiêu chí: (i) Bài được làm đầy đủ, chính xác (ii) Hình thức đẹp (iii) Thời gian nộp đúng quy định (iv) Tuân theo quy định kiểm tra, đánh giá của trường. | 20% | -\nĐánh giá quá trình | Trình bày nhóm: Báo cáo phân tích nguyên lý hoạt động của một công nghệ cụ thể trong kiến trúc máy tính SMP. | Tuần 13, 14 | CLO1.x, CLO2.x, CLO3.x | Xem Phụ lục 2, rubrics 2 | 20% | -\nĐánh giá cuối kỳ | Bài thi cuối kỳ | Lịch thi học phần | CLO1.x, CLO2.1, CLO3.3 | Theo yêu cầu bài thi | 50% | -",
      "word_count": 250,
      "char_count": 1057,
      "heading_path": [
        "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)",
        "7.1. Cơ cấu điểm thành phần"
      ],
      "primary_heading": "7.1. Cơ cấu điểm thành phần",
      "breadcrumbs": "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment) > 7.1. Cơ cấu điểm thành phần",
      "position": {
        "order": 10,
        "start_block": 52,
        "end_block": 53
      }
    },
    {
      "chunk_id": "vi-cntt1112#011",
      "text": "Bảng 4. Kế hoạch và nội dung dạy học\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1: Giới thiệu chung Các khái niệm về kiến trúc máy tính Xu thế công nghệ 1.3 Đo lường hiệu năng 1.4 Nguyên lý thiết kế định lượng | [1] Chương 1 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo, slide - Giảng lý thuyết theo nội dung slide - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem lại kiến thức các môn tiên quyết - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 1 Sinh viên - Xem trước đề cương - Đọc các tài liệu - Xem lại các kiến thức của học phần tiên quyết | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n2 | Seminar 1 - Tóm tắt kiến thức về kiến trúc máy tính - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 1 | [1] Chương 1 | Giảng viên - Nhắc lại các kiến thức về kiến trúc máy tính đã học: khái niệm, xu thế công nghệ, hiệu năng, luật Amdahl - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n3 | Lecture 2. Chương 2: Kiến trúc tập lệnh 2.1 Phân loại ISA 2.2 Chế độ địa chỉ bộ nhớ 2.3 Loại và kích thước của toán hạng 2.4 Vai trò của trình biên dịch 2.5 Kiến trúc MIPS | [1] Appendix A | Giảng viên - Giảng lý thuyết theo nội dung slide - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 2 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n4 | Seminar 2 - Tóm tắt kiến thức về kiến trúc tập lệnh - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 2 | [1] Appendix A | Giảng viên - Nhắc lại các kiến thức về kiến trúc tập lệnh đã học: khái niệm, phân loại, chế độ địa chỉ, kich thước toán hạng. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n5 | Lecture 3. Chương 3: Kỹ thuật đường ống 3.1\tGiới thiệu chung về đường ống 3.2\tGiới thiệu về hazard 3.2.1\tHazards cấu trúc 3.2.2\tHazards dữ liệu 3.2.3\tHazards điều khiển 3.3\tXây dựng đường ống | [1] Appendix C | Giảng viên - Giảng lý thuyết theo nội dung slide bài 3 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 3 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n6 | Seminar 3 - Tóm tắt kiến thức về kỹ thuật đường ống - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 3 | [[1] Appendix C | Giảng viên - Nhắc lại các kiến thức về kỹ thuật đường ống đã học: khái niệm, các loại hazard. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n7 | Lecture 4. Chương 4: Song song hóa mức câu lệnh 4.1\tCác khái niệm 4.2\tPhụ thuộc và hazard 4.3\tSong song hóa dùng trình biên dịch 4.4\tSong song hóa dùng lập lịch động | [1] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 4 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 4 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n8 | Seminar 4 - Tóm tắt kiến thức về kỹ thuật song hóa mức câu lệnh - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 4 | [1] Chương 3 | Giảng viên - Nhắc lại các kiến thức về kỹ thuật song hóa mức câu lệnh đã học: dùng trình biên dịch, lập lịch động - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n9 | Lecture 5. Chương 5: Thiết kế phân tầng bộ nhớ 5.1\tThiết kế phân tầng bộ nhớ 5.1.1\tBộ đệm 5.1.2\tHiệu năng bộ đệm 5.1.3\tBộ nhớ chính 5.2\tTối ưu hóa bộ đệm 5.2.1\tGiảm tỷ lệ lỡ 5.2.2\tGiảm thời gian trễ do lỡ 5.2.3\tGiảm thời gian truy cập 5.3 Bộ nhớ ảo 5.4 Đa VXL | [1] Chương 2, Appendix B | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 5 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 5 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n10 | Seminar 5 - Tóm tắt kiến thức về thiết kế phân tầng bộ nhớ - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 5 | [1] Chương 2, Appendix B | Giảng viên - Nhắc lại các kiến thức về thiết kế phân tầng bộ nhớ đã học: bộ đệm, bộ nhớ chính, hiệu năng, các kỹ thuật tối ưu, bộ nhớ hệ thống đa VXL. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n11 | Lecture 6. Chương 6: Hệ thống vào/ra, lưu trữ 6.1\tCác chủ đề nâng cao về lưu trữ đĩa 6.1.1\tQuan hệ đĩa – RAM 6.1.2\tRAID 6.2\tHiệu năng I/O, đo lường độ tin cậy, các công cụ đo 6.3\tLý thuyết hàng đợi 6.4\tThiết kế và đánh giá hệ thống I/O | [1] Appendix D | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 6 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, các tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 6 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n12 | Seminar 6 - Tóm tắt kiến thức về hệ thống vào/ra lưu trữ - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 6 | [1] Appendix D | Giảng viên - Nhắc lại các kiến thức về hệ thống vào/ra lưu trữ đã học: đĩa cứng, hiệu năng hệ thống, thiết kế hệ thống. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n13 | Trình bày bài tập nhóm | - | Nhóm sinh viên báo cáo và trả lời câu hỏi Giảng viên và các thành viên trong lớp đặt câu hỏi, nhận xét | Phiếu đánh giá với các tiêu chí : (i) Nội dung; (ii) Hình thức đẹp; (iii) Trình bày hấp dẫn, thuyết phục; (iv) Mức độ hợp tác trong trả lời câu hỏi; (v) Thời gian trình bày | CLO1.x, CLO2.x, CLO3.x\n14 | Trình bày bài tập nhóm | - | Nhóm sinh viên báo cáo và trả lời câu hỏi Giảng viên và các thành viên trong lớp đặt câu hỏi, nhận xét | Phiếu đánh giá với các tiêu chí : (i) Nội dung; (ii) Hình thức đẹp; (iii) Trình bày hấp dẫn, thuyết phục; (iv) Mức độ hợp tác trong trả lời câu hỏi; (v) Thời gian trình bày | CLO1.x, CLO2.x, CLO3.x\n15 | Seminar 7 - Hệ thống lại học phần - Thông báo kết quả đánh giá thành phần - Hướng dẫn thi và trả lời câu hỏi | - | Giảng viên - Tổng hợp, hệ thống lại các kiến thức trong các bài giảng - Hệ thống các dạng câu hỏi bài thi cuối kì - Thông báo điểm chuyên cần 10% - Thông báo điểm 40% - Chữa một số câu trong câu hỏi thi tham khảo Sinh viên - Có mặt đầy đủ để nhận thông tin về điểm thành phần - Xem lại toàn bộ nội dung học phần, các câu hỏi tham khảo | - Điểm danh - Sau buổi học, không giải quyết các thắc mắc về điểm thành phần | CLO1.x, CLO2.1, CLO3.1, CLO3.3\nLịch thi | Thi cuối kỳ | Chương 1 đến 6 | Thi tự luận trên giấy | Xem Phụ lục 1: ma trận đề thi | CLO1.x, CLO2.1,  CLO3.3",
      "word_count": 1795,
      "char_count": 7809,
      "heading_path": [
        "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)"
      ],
      "primary_heading": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "breadcrumbs": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "position": {
        "order": 11,
        "start_block": 58,
        "end_block": 59
      }
    },
    {
      "chunk_id": "vi-cntt1112#012",
      "text": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcome Assessement)\nHệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.",
      "word_count": 52,
      "char_count": 254,
      "heading_path": [
        "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)"
      ],
      "primary_heading": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "breadcrumbs": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "position": {
        "order": 12,
        "start_block": 61,
        "end_block": 63
      }
    },
    {
      "chunk_id": "vi-cntt1112#013",
      "text": "- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.",
      "word_count": 28,
      "char_count": 126,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.1. Quy định về điều kiện thi kết thúc học phần"
      ],
      "primary_heading": "10.1. Quy định về điều kiện thi kết thúc học phần",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.1. Quy định về điều kiện thi kết thúc học phần",
      "position": {
        "order": 13,
        "start_block": 65,
        "end_block": 67
      }
    },
    {
      "chunk_id": "vi-cntt1112#014",
      "text": "- Học viên có trách nhiệm tham dự đầy đủ các buổi học.\n- Trong trường hợp nghỉ học do lý do bất khả kháng thì cần chủ động tìm hiểu kiến thức thông qua tài liệu được giảng viên cung cấp và các tài liệu khác được yêu cầu đọc.",
      "word_count": 51,
      "char_count": 224,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.2. Quy định về tham dự lớp học"
      ],
      "primary_heading": "10.2. Quy định về tham dự lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.2. Quy định về tham dự lớp học",
      "position": {
        "order": 14,
        "start_block": 68,
        "end_block": 70
      }
    },
    {
      "chunk_id": "vi-cntt1112#015",
      "text": "- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người giảng;\n- Ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Đọc trước tài liệu được yêu cầu;\n- Làm các bài tập về nhà;\n- Không làm ồn, gây ảnh hưởng đến người khác, không ăn trong quá trình học;\n- Laptop, máy tính bảng, điện thoại di động chỉ được sử dụng cho mục đích ghi chép bài giảng, tính toán phục vụ học tập, tuyệt đối không dùng vào mục đích khác.",
      "word_count": 92,
      "char_count": 420,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.3. Quy định về hành vi trong lớp học"
      ],
      "primary_heading": "10.3. Quy định về hành vi trong lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.3. Quy định về hành vi trong lớp học",
      "position": {
        "order": 15,
        "start_block": 71,
        "end_block": 77
      }
    },
    {
      "chunk_id": "vi-cntt1112#016",
      "text": "- Người học không nộp bài cá nhân / nhóm theo yêu cầu sẽ nhận điểm 0 (không).\n- Sau thời hạn cuối theo quy định, bài nộp muộn mỗi ngày sẽ trừ một điểm.",
      "word_count": 35,
      "char_count": 151,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.4. Quy định về nộp bài tập lớn"
      ],
      "primary_heading": "10.4. Quy định về nộp bài tập lớn",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.4. Quy định về nộp bài tập lớn",
      "position": {
        "order": 16,
        "start_block": 78,
        "end_block": 81
      }
    },
    {
      "chunk_id": "vi-cntt1112#017",
      "text": "Tháng 6 năm 2024.\nPHỤ TRÁCH KHOA | HIỆU TRƯỞNG\nTS Phạm Xuân Lâm | GS.TS Phạm Hồng Chương",
      "word_count": 19,
      "char_count": 88,
      "heading_path": [
        "11. THỜI ĐIỂM HIỆU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)"
      ],
      "primary_heading": "11. THỜI ĐIỂM HIỆU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)",
      "breadcrumbs": "11. THỜI ĐIỂM HIỆU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)",
      "position": {
        "order": 17,
        "start_block": 82,
        "end_block": 85
      }
    },
    {
      "chunk_id": "vi-cntt1112#018",
      "text": "- Trọng số trong điểm học phần: 50%\n- Hình thức: Tự luận trên giấy\n- Thời gian: 90 phút\n- Số câu hỏi: 5 câu. Mỗi câu 0,25 điểm\nMa trận đề thi (tự luận):\nCâu hỏi | CLOs | Số điểm | Nhớ | Hiểu | Vận dụng | Tổng số câu hỏi thành phần\nCâu 1 | 1.x 2.1 3.3 | 1 | - | - | - | -\na. | 1.x 2.1 3.3 | 0.5 | 1 | - | - | 1\nb. | 1.x 2.1 3.3 | 0.5 | - | 1 | - | 1\nCâu 2 | 1.x 2.1 3.3 | 1 | - | - | - | -\na. | 1.x 2.1 3.3 | 0.5 | 1 | - | - | 1\nb. | 1.x 2.1 3.3 | 0.5 | - | 1 | - | 1\nCâu 3 | 1.x 2.1 3.3 | 2 | - | - | - | -\na. | 1.x 2.1 3.3 | 1 | - | 1 | - | 1\nb. | 1.x 2.1 3.3 | 1 | - | - | 1 | 1\nCâu 4 | 1.x 2.1 3.3 | 3 | - | - | - | -\na. | 1.x 2.1 3.3 | 1.5 | - | 1 | - | 1\nb. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nCâu 5 | 1.x 2.1 3.3 | 3 | - | - | - | -\na. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nb. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nTổng số câu hỏi thành phần | - | 10 | 2 | 4 | 5 | 10\nTổng số điểm | - | 10 | 1 | 3.5 | 5.5 | -\nTỷ trọng | - | 100% | 20% | 40% | 40% | 100%",
      "word_count": 334,
      "char_count": 956,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 1. MA TRẬN ĐỀ THI"
      ],
      "primary_heading": "Phụ lục 1. MA TRẬN ĐỀ THI",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 1. MA TRẬN ĐỀ THI",
      "position": {
        "order": 18,
        "start_block": 88,
        "end_block": 94
      }
    },
    {
      "chunk_id": "vi-cntt1112#019",
      "text": "Rubrics 1. Đánh giá điểm chuyên cần\n- Trọng số trong điểm học phần: 10%\n- Đánh giá qua 7 buổi seminar.\nSố buổi vắng (điểm danh) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá)\nSố buổi vắng (điểm danh) | Rất tích cực | Tích cực | Có tham gia | Không tham gia\n0 | 10, 10+ | 9 | 8 | 7\n1 | 9, 10 | 8 | 7 | 6\n2 | 8, 9 | 7 | 6 | 5\n> 2 | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại\n* Ghi chú: 10+ : có thể xem xét để cộng điểm vào điểm đánh giá 40% khi điểm chuyên cần là 10.\nTiêu chí đánh giá tham gia thảo luận",
      "word_count": 166,
      "char_count": 655,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 19,
        "start_block": 99,
        "end_block": 107
      }
    },
    {
      "chunk_id": "vi-cntt1112#020",
      "text": "Rất tích cực | Tích cực | Có tham gia | Không tham gia\n- Xung phong trả lời, chữa bài tập từ hai lần trở lên; - Chủ động trình bày vấn đề và ý kiến cá nhân, thảo luận; - Đề xuất các vấn đề, chủ đề mới; - Hoạt động nổi bật khác. | - Xung phong trả lời câu hỏi; - Xung phong chữa bài tập; - Đặt câu hỏi thảo luận với lớp; - Trả lời đúng câu hỏi mà các sinh viên khác chưa trả lời được; - Trả lời tốt về bài tập nhóm. | - Trả lời câu hỏi GV yêu cầu trả lời; - Trình bày đáp án bài tập do GV yêu cầu làm ở nhà; - Có phát biểu ý kiến; - Có trả lời về bài tập nhóm. | - Không trả lời câu hỏi; - Không trình bày đáp án bài tập; - Không tham gia tương tác.\nCLO của đánh giá chuyên cần",
      "word_count": 167,
      "char_count": 676,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 20,
        "start_block": 107,
        "end_block": 109
      }
    },
    {
      "chunk_id": "vi-cntt1112#021",
      "text": "Cách thức đánh giá | CLO | CLO | CLO\nCách thức đánh giá | 3.1 | 3.2 | 3.3\nĐiểm danh | - | - | -\nTrả lời câu hỏi, bài tập | - | - | -\nĐăng kí nhóm đúng thời hạn | - | - | -\nTrả lời về chủ đề của nhóm, thảo luận chủ đề nhóm khác | - | - | -\nTrả lời về nội dung của nhóm, thảo luận nội dung nhóm khác | - | - | -\nTrả lời về trình bày của nhóm, thảo luận trình bày nhóm khác | - | - | -\nRubrics 2. Đánh giá bài tập lớn\n- Trọng số: 20% (thành phần thứ nhất của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập nhóm, bắt buộc thuyết trình",
      "word_count": 142,
      "char_count": 533,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 21,
        "start_block": 109,
        "end_block": 114
      }
    },
    {
      "chunk_id": "vi-cntt1112#022",
      "text": "Tiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 1.1 3.1 3.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lí, phù hợp với chủ đề - Có câu hỏi nghiên cứu cụ thể | - Mục tiêu rõ ràng - Câu hỏi nghiên cứu không rõ | - Mục tiêu không rõ - Câu hỏi nghiên cứu chưa phù hợp | - Mục tiêu không thực tế hoặc không có mục tiêu - Không có câu hỏi đặt ra\nNội dung | 1.1 1.4 2.1 | 60% | - Kiến thức lý thuyết khoa học, đầy đủ, logic; - Có các ứng dụng phù hợp, chất lượng cao. | - Kiến thức lý thuyết đầy đủ, phù hợp; - Có ứng dụng. | - Kiến thức lý thuyết không đầy đủ; - Không có ứng dụng. | - Kiến thức lý thuyết không phù hợp hoặc không có kiến thức\nTrình bày | 3.3 | 20% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; - Biểu đồ, bảng biểu đẹp, danh mục tham khảo theo chuẩn quốc tế. | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; - Biểu đồ, bảng biểu phù hợp, danh mục tham khảo đầy đủ. | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; - Biểu đồ bảng biểu không phù hợp hoặc không có. | - Không có định dạng; - Ngôn ngữ không phù hợp.",
      "word_count": 325,
      "char_count": 1333,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 22,
        "start_block": 114,
        "end_block": 114
      }
    }
  ],
  "full_text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐH KINH TẾ QUỐC DÂN _______________________ | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc _______________________\nĐỀ CƯƠNG HỌC PHẦN CHI TIẾT\n(Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ-ĐHKTQD ngày 18 tháng 6 năm 2024)\n1. THÔNG TIN TỔNG QUÁT (General Information)\n- Tên học phần (tiếng Việt): \tKiến trúc máy tính\n- Tên học phần (tiếng Anh):\tComputer Architecture\n- Trình độ đào tạo \t\tĐại học\n- Mã học phần: \t\t\tCNTT1112\n- Số tín chỉ: \t\t\t03\n- Số giờ trên lớp:\t45\n- Số giờ tự học:\t\t105\n(01 tín chỉ bằng 50 giờ định mức, 01 giờ định mức bằng 50 phút)\n- Các học phần tiên quyết:\n- Nhập môn Công nghệ thông tin (CNTT1116)\n2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY\n(Management Faculty and Teachers)\n- Khoa/Viện quản lý học phần: Khoa Công nghệ thông tin\n- Địa chỉ: P1310 - P1312 Nhà A1, Trường ĐH Kinh tế Quốc dân, 207 Giải Phóng, Hai Bà Trưng, Hà Nội\n- Giảng viên giảng dạy học phần:\nSTT | Họ và tên | Email\n1 | TS. Đặng Minh Quân | quandm@neu.edu.vn\n2 | TS. Nguyễn Thanh Hương | huongnt_cntt@neu.edu.vn\n3. MÔ TẢ HỌC PHẦN (Course Descriptions)\nHọc phần này giới thiệu các hoạt động của hệ thống máy tính ở mức độ kiến trúc câu lệnh (Instruction Set Architecture – ISA). Cung cấp các kiến thức cơ bản về nguyên lý thiết kế của các máy tính hiện đại và các thành phần của chúng. Học phần tập trung đặc biệt vào các kỹ thuật đường ống, thiết kế phân tầng bộ nhớ. Các vấn đề về mặt thực hiện cũng được chú trọng. Các phương pháp đo lường và phân tích hiệu năng cũng được thảo luận để đánh giá các kiến trúc khác nhau.\nHọc phần cũng nhằm rèn luyện khả năng tư duy, kỹ năng tính toán và nâng cao khả năng ứng dụng các kiến thức vào phân tích, nghiên cứu các vấn đề trong lĩnh vực kiến trúc máy tính. Học phần trang bị cho người học những kiến thức, kỹ năng và năng lực cần thiết để tìm kiếm, truy xuất và khai thác các nguồn tài liệu liên quan đến môn học và tiếp tục học cao hơn.\nNội dung chính:\n- Khái niệm, đo lường hiệu năng\n- Nguyên lý thiết kế định lượng\n- Phân loại ISA\n- Kiến trúc MIPS\n- Kỹ thuật đường ống: khái niệm, cơ chế hoạt động, hazard\n- Các kỹ thuật song song hóa mức câu lệnh\n- Phân tầng bộ nhớ\n- Kiến trúc đa CPUs\n4. TÀI LIỆU HỌC TẬP (Learning resources: Course Books, Reference Books, and Softwares)\n4.1. Giáo trình\n[1] John L. Hennessy (2012) Computer Architecture - A quantitative Approach, Mk Publisher.\n4.2. Tài liệu tham khảo\n[2] Patterson, D. A., and J. L. Hennessy. Computer Organization and Design: The Hardware/Software Interface, 3rd ed. San Mateo, CA: Morgan Kaufman, 2004. ISBN: 1558606041.\n4.3. Phần mềm\n5. MỤC TIÊU HỌC PHẦN (Course Goals)\nBảng 1. Mục tiêu học phần\nMã / Code | Mô tả mục tiêu học phần (CG) | CĐR/PLO của CTĐT\n[1] | [2] | [3]\nCG1 | Học phần cung cấp cho người học các kiến thức: Các khái niệm cơ bản về hiệu năng Các nguyên lý ISA Kỹ thuật đường ống Hệ thống bộ nhớ | -\nCG2 | Học phần hướng dẫn cho người học các kỹ năng xử lý các tình huống chuyên môn một cách có hệ thống. Sinh viên biết cách phối hợp với nhau để cùng giải quyết một vấn đề chuyên môn đúng thời hạn. | -\nCG3 | Học phần góp phần phát triển khả năng giải quyết vấn đề độc lập cũng như khả năng làm việc nhóm để cùng giải quyết các vấn đề chuyên môn. Bước đầu trang bị cho người học nhận thức về bối cảnh xã hội, nhận thức đạo đức nghề nghiệp, trách nhiệm xã hội trong lĩnh vực CNTT. | -\n6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)\nBảng 2. Chuẩn đầu ra học phần (CLO)\nMục tiêu | CLO | Mô tả CLO | Mức độ đạt được\n[1] | [2] | [3] | [4]\nCG1 Kiến thức | CLO1.1 | Nêu được các khái niệm hiệu năng, kiến trúc CPU, kiến trúc đường ống, kiến trúc bộ đệm . . . | 1\nCG1 Kiến thức | CLO1.2 | Giải thích được mô hình hoạt động của kiến trúc RISC | 2\nCG1 Kiến thức | CLO1.3 | Ứng dụng luật Amdahl để quyết định cải tiến nào là tốt nhất, phân biệt sự khác biệt về hiệu năng giữa bộ đệm lớn và tần số đồng hồ cao, phân biệt được sự khác nhau giữa liên kết trực tiếp và liên kết tập hợp trong bộ đệm | 3\nCG1 Kiến thức | CLO1.4 | Vận dụng các kiến thức đã học để giải quyết các bài tập, các tình huống của từng nội dung học tập. | 3\nCG2 Kĩ năng | CLO2.1 | Có kỹ năng tìm kiếm, thu thập, tổng hợp, phân tích, giải quyết các vấn đề đặc trưng của chuyên ngành | 2\nCG2 Kĩ năng | CLO2.2 | Có kỹ năng làm việc nhóm để cùng giải quyết một vấn đề chuyên môn đúng thời hạn. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.1 | Có khả năng tự học tập, tự tìm hiểu tài liệu để hoàn thành các bài học và bài tập được giao. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.2 | Có khả năng tổ chức và phối hợp nhóm làm việc để cùng giải quyết một vấn đề của môn học. | 3\nCG3 Năng lực tự chủ tự chịu trách nhiệm | CLO3.3 | Có ý thức tổ chức kỷ luật lớp học, tuân thủ các nội quy lớp học, có tinh thần hợp tác và trách nhiệm cá nhân đối với các hoạt động được giảng viên giao. | 3\n7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)\n7.1. Cơ cấu điểm thành phần\nBảng 3. Đánh giá học phần\nHình thức đánh giá | Nội dung / Bài đánh giá | Thời điểm | CLOs | Công cụ và tiêu chí đánh giá | Tỷ lệ (%) | CĐR/PLO của CTĐT\n[1] | [2] | [3] | [4] | [5] | [6] | [7]\nChuyên cần | Thái độ học tập trên lớp Trả lời câu hỏi trên lớp Trả lời các câu hỏi thảo luận | Tuần 1-12 | CLO1.x, CLO2.1, CLO3.1, CLO3.3 | Nhật ký giảng dạy của giảng viên với các tiêu chí đánh giá: (i) Mức độ tham gia (ii) Mức độ tương tác (iii) Chất lượng câu trả lời Xem Phụ lục 2, rubrics 1 | 10% | -\nĐánh giá quá trình | Bài kiểm tra giữa kỳ | Tuần 8 | CLO1.x, CLO2.1, CLO3.3 | Tiêu chí: (i) Bài được làm đầy đủ, chính xác (ii) Hình thức đẹp (iii) Thời gian nộp đúng quy định (iv) Tuân theo quy định kiểm tra, đánh giá của trường. | 20% | -\nĐánh giá quá trình | Trình bày nhóm: Báo cáo phân tích nguyên lý hoạt động của một công nghệ cụ thể trong kiến trúc máy tính SMP. | Tuần 13, 14 | CLO1.x, CLO2.x, CLO3.x | Xem Phụ lục 2, rubrics 2 | 20% | -\nĐánh giá cuối kỳ | Bài thi cuối kỳ | Lịch thi học phần | CLO1.x, CLO2.1, CLO3.3 | Theo yêu cầu bài thi | 50% | -\n7.2. Ma trận đề thi (phụ lục 1)\n7.3. Các rubrics (phụ lục 2)\n8. KẾ HOẠCH DẠY HỌC (Lesson Plan)\nBảng 4. Kế hoạch và nội dung dạy học\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1: Giới thiệu chung Các khái niệm về kiến trúc máy tính Xu thế công nghệ 1.3 Đo lường hiệu năng 1.4 Nguyên lý thiết kế định lượng | [1] Chương 1 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo, slide - Giảng lý thuyết theo nội dung slide - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem lại kiến thức các môn tiên quyết - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 1 Sinh viên - Xem trước đề cương - Đọc các tài liệu - Xem lại các kiến thức của học phần tiên quyết | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n2 | Seminar 1 - Tóm tắt kiến thức về kiến trúc máy tính - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 1 | [1] Chương 1 | Giảng viên - Nhắc lại các kiến thức về kiến trúc máy tính đã học: khái niệm, xu thế công nghệ, hiệu năng, luật Amdahl - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n3 | Lecture 2. Chương 2: Kiến trúc tập lệnh 2.1 Phân loại ISA 2.2 Chế độ địa chỉ bộ nhớ 2.3 Loại và kích thước của toán hạng 2.4 Vai trò của trình biên dịch 2.5 Kiến trúc MIPS | [1] Appendix A | Giảng viên - Giảng lý thuyết theo nội dung slide - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 2 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n4 | Seminar 2 - Tóm tắt kiến thức về kiến trúc tập lệnh - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 2 | [1] Appendix A | Giảng viên - Nhắc lại các kiến thức về kiến trúc tập lệnh đã học: khái niệm, phân loại, chế độ địa chỉ, kich thước toán hạng. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n5 | Lecture 3. Chương 3: Kỹ thuật đường ống 3.1\tGiới thiệu chung về đường ống 3.2\tGiới thiệu về hazard 3.2.1\tHazards cấu trúc 3.2.2\tHazards dữ liệu 3.2.3\tHazards điều khiển 3.3\tXây dựng đường ống | [1] Appendix C | Giảng viên - Giảng lý thuyết theo nội dung slide bài 3 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 3 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n6 | Seminar 3 - Tóm tắt kiến thức về kỹ thuật đường ống - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 3 | [[1] Appendix C | Giảng viên - Nhắc lại các kiến thức về kỹ thuật đường ống đã học: khái niệm, các loại hazard. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n7 | Lecture 4. Chương 4: Song song hóa mức câu lệnh 4.1\tCác khái niệm 4.2\tPhụ thuộc và hazard 4.3\tSong song hóa dùng trình biên dịch 4.4\tSong song hóa dùng lập lịch động | [1] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 4 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 4 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n8 | Seminar 4 - Tóm tắt kiến thức về kỹ thuật song hóa mức câu lệnh - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 4 | [1] Chương 3 | Giảng viên - Nhắc lại các kiến thức về kỹ thuật song hóa mức câu lệnh đã học: dùng trình biên dịch, lập lịch động - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n9 | Lecture 5. Chương 5: Thiết kế phân tầng bộ nhớ 5.1\tThiết kế phân tầng bộ nhớ 5.1.1\tBộ đệm 5.1.2\tHiệu năng bộ đệm 5.1.3\tBộ nhớ chính 5.2\tTối ưu hóa bộ đệm 5.2.1\tGiảm tỷ lệ lỡ 5.2.2\tGiảm thời gian trễ do lỡ 5.2.3\tGiảm thời gian truy cập 5.3 Bộ nhớ ảo 5.4 Đa VXL | [1] Chương 2, Appendix B | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 5 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 5 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n10 | Seminar 5 - Tóm tắt kiến thức về thiết kế phân tầng bộ nhớ - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 5 | [1] Chương 2, Appendix B | Giảng viên - Nhắc lại các kiến thức về thiết kế phân tầng bộ nhớ đã học: bộ đệm, bộ nhớ chính, hiệu năng, các kỹ thuật tối ưu, bộ nhớ hệ thống đa VXL. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n11 | Lecture 6. Chương 6: Hệ thống vào/ra, lưu trữ 6.1\tCác chủ đề nâng cao về lưu trữ đĩa 6.1.1\tQuan hệ đĩa – RAM 6.1.2\tRAID 6.2\tHiệu năng I/O, đo lường độ tin cậy, các công cụ đo 6.3\tLý thuyết hàng đợi 6.4\tThiết kế và đánh giá hệ thống I/O | [1] Appendix D | Giảng viên - Giảng lý thuyết theo nội dung slide lecture 6 - Giới thiệu ví dụ trong slide - Hướng dẫn đọc giáo trình, các tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, bài tập dành cho seminar 6 Sinh viên - Đọc trước các tài liệu - Xem trước các ví dụ, làm bài tập được yêu cầu | - | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n12 | Seminar 6 - Tóm tắt kiến thức về hệ thống vào/ra lưu trữ - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 6 | [1] Appendix D | Giảng viên - Nhắc lại các kiến thức về hệ thống vào/ra lưu trữ đã học: đĩa cứng, hiệu năng hệ thống, thiết kế hệ thống. - Xác định các nhóm làm bài tập Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, bài tập và trả lời các câu hỏi - Phân nhóm làm bài tập | - Điểm danh - Trả lời câu hỏi trong bài tập | CLO1.x, CLO2.1, CLO3.1, CLO3.3\n13 | Trình bày bài tập nhóm | - | Nhóm sinh viên báo cáo và trả lời câu hỏi Giảng viên và các thành viên trong lớp đặt câu hỏi, nhận xét | Phiếu đánh giá với các tiêu chí : (i) Nội dung; (ii) Hình thức đẹp; (iii) Trình bày hấp dẫn, thuyết phục; (iv) Mức độ hợp tác trong trả lời câu hỏi; (v) Thời gian trình bày | CLO1.x, CLO2.x, CLO3.x\n14 | Trình bày bài tập nhóm | - | Nhóm sinh viên báo cáo và trả lời câu hỏi Giảng viên và các thành viên trong lớp đặt câu hỏi, nhận xét | Phiếu đánh giá với các tiêu chí : (i) Nội dung; (ii) Hình thức đẹp; (iii) Trình bày hấp dẫn, thuyết phục; (iv) Mức độ hợp tác trong trả lời câu hỏi; (v) Thời gian trình bày | CLO1.x, CLO2.x, CLO3.x\n15 | Seminar 7 - Hệ thống lại học phần - Thông báo kết quả đánh giá thành phần - Hướng dẫn thi và trả lời câu hỏi | - | Giảng viên - Tổng hợp, hệ thống lại các kiến thức trong các bài giảng - Hệ thống các dạng câu hỏi bài thi cuối kì - Thông báo điểm chuyên cần 10% - Thông báo điểm 40% - Chữa một số câu trong câu hỏi thi tham khảo Sinh viên - Có mặt đầy đủ để nhận thông tin về điểm thành phần - Xem lại toàn bộ nội dung học phần, các câu hỏi tham khảo | - Điểm danh - Sau buổi học, không giải quyết các thắc mắc về điểm thành phần | CLO1.x, CLO2.1, CLO3.1, CLO3.3\nLịch thi | Thi cuối kỳ | Chương 1 đến 6 | Thi tự luận trên giấy | Xem Phụ lục 1: ma trận đề thi | CLO1.x, CLO2.1,  CLO3.3\n9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcome Assessement)\nHệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.\n10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)\n10.1. Quy định về điều kiện thi kết thúc học phần\n- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.\n10.2. Quy định về tham dự lớp học\n- Học viên có trách nhiệm tham dự đầy đủ các buổi học.\n- Trong trường hợp nghỉ học do lý do bất khả kháng thì cần chủ động tìm hiểu kiến thức thông qua tài liệu được giảng viên cung cấp và các tài liệu khác được yêu cầu đọc.\n10.3. Quy định về hành vi trong lớp học\n- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người giảng;\n- Ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Đọc trước tài liệu được yêu cầu;\n- Làm các bài tập về nhà;\n- Không làm ồn, gây ảnh hưởng đến người khác, không ăn trong quá trình học;\n- Laptop, máy tính bảng, điện thoại di động chỉ được sử dụng cho mục đích ghi chép bài giảng, tính toán phục vụ học tập, tuyệt đối không dùng vào mục đích khác.\n10.4. Quy định về nộp bài tập lớn\n- Người học không nộp bài cá nhân / nhóm theo yêu cầu sẽ nhận điểm 0 (không).\n- Sau thời hạn cuối theo quy định, bài nộp muộn mỗi ngày sẽ trừ một điểm.\n11. THỜI ĐIỂM HIỆU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)\nTháng 6 năm 2024.\nPHỤ TRÁCH KHOA | HIỆU TRƯỞNG\nTS Phạm Xuân Lâm | GS.TS Phạm Hồng Chương\nPHỤ LỤC\nPhụ lục 1. MA TRẬN ĐỀ THI\n- Trọng số trong điểm học phần: 50%\n- Hình thức: Tự luận trên giấy\n- Thời gian: 90 phút\n- Số câu hỏi: 5 câu. Mỗi câu 0,25 điểm\nMa trận đề thi (tự luận):\nCâu hỏi | CLOs | Số điểm | Nhớ | Hiểu | Vận dụng | Tổng số câu hỏi thành phần\nCâu 1 | 1.x 2.1 3.3 | 1 | - | - | - | -\na. | 1.x 2.1 3.3 | 0.5 | 1 | - | - | 1\nb. | 1.x 2.1 3.3 | 0.5 | - | 1 | - | 1\nCâu 2 | 1.x 2.1 3.3 | 1 | - | - | - | -\na. | 1.x 2.1 3.3 | 0.5 | 1 | - | - | 1\nb. | 1.x 2.1 3.3 | 0.5 | - | 1 | - | 1\nCâu 3 | 1.x 2.1 3.3 | 2 | - | - | - | -\na. | 1.x 2.1 3.3 | 1 | - | 1 | - | 1\nb. | 1.x 2.1 3.3 | 1 | - | - | 1 | 1\nCâu 4 | 1.x 2.1 3.3 | 3 | - | - | - | -\na. | 1.x 2.1 3.3 | 1.5 | - | 1 | - | 1\nb. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nCâu 5 | 1.x 2.1 3.3 | 3 | - | - | - | -\na. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nb. | 1.x 2.1 3.3 | 1.5 | - | - | 1 | 1\nTổng số câu hỏi thành phần | - | 10 | 2 | 4 | 5 | 10\nTổng số điểm | - | 10 | 1 | 3.5 | 5.5 | -\nTỷ trọng | - | 100% | 20% | 40% | 40% | 100%\nPhụ lục 2. CÁC RUBRICS\nRubrics 1. Đánh giá điểm chuyên cần\n- Trọng số trong điểm học phần: 10%\n- Đánh giá qua 7 buổi seminar.\nSố buổi vắng (điểm danh) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá)\nSố buổi vắng (điểm danh) | Rất tích cực | Tích cực | Có tham gia | Không tham gia\n0 | 10, 10+ | 9 | 8 | 7\n1 | 9, 10 | 8 | 7 | 6\n2 | 8, 9 | 7 | 6 | 5\n> 2 | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại\n* Ghi chú: 10+ : có thể xem xét để cộng điểm vào điểm đánh giá 40% khi điểm chuyên cần là 10.\nTiêu chí đánh giá tham gia thảo luận\nRất tích cực | Tích cực | Có tham gia | Không tham gia\n- Xung phong trả lời, chữa bài tập từ hai lần trở lên; - Chủ động trình bày vấn đề và ý kiến cá nhân, thảo luận; - Đề xuất các vấn đề, chủ đề mới; - Hoạt động nổi bật khác. | - Xung phong trả lời câu hỏi; - Xung phong chữa bài tập; - Đặt câu hỏi thảo luận với lớp; - Trả lời đúng câu hỏi mà các sinh viên khác chưa trả lời được; - Trả lời tốt về bài tập nhóm. | - Trả lời câu hỏi GV yêu cầu trả lời; - Trình bày đáp án bài tập do GV yêu cầu làm ở nhà; - Có phát biểu ý kiến; - Có trả lời về bài tập nhóm. | - Không trả lời câu hỏi; - Không trình bày đáp án bài tập; - Không tham gia tương tác.\nCLO của đánh giá chuyên cần\nCách thức đánh giá | CLO | CLO | CLO\nCách thức đánh giá | 3.1 | 3.2 | 3.3\nĐiểm danh | - | - | -\nTrả lời câu hỏi, bài tập | - | - | -\nĐăng kí nhóm đúng thời hạn | - | - | -\nTrả lời về chủ đề của nhóm, thảo luận chủ đề nhóm khác | - | - | -\nTrả lời về nội dung của nhóm, thảo luận nội dung nhóm khác | - | - | -\nTrả lời về trình bày của nhóm, thảo luận trình bày nhóm khác | - | - | -\nRubrics 2. Đánh giá bài tập lớn\n- Trọng số: 20% (thành phần thứ nhất của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập nhóm, bắt buộc thuyết trình\nTiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 1.1 3.1 3.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lí, phù hợp với chủ đề - Có câu hỏi nghiên cứu cụ thể | - Mục tiêu rõ ràng - Câu hỏi nghiên cứu không rõ | - Mục tiêu không rõ - Câu hỏi nghiên cứu chưa phù hợp | - Mục tiêu không thực tế hoặc không có mục tiêu - Không có câu hỏi đặt ra\nNội dung | 1.1 1.4 2.1 | 60% | - Kiến thức lý thuyết khoa học, đầy đủ, logic; - Có các ứng dụng phù hợp, chất lượng cao. | - Kiến thức lý thuyết đầy đủ, phù hợp; - Có ứng dụng. | - Kiến thức lý thuyết không đầy đủ; - Không có ứng dụng. | - Kiến thức lý thuyết không phù hợp hoặc không có kiến thức\nTrình bày | 3.3 | 20% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; - Biểu đồ, bảng biểu đẹp, danh mục tham khảo theo chuẩn quốc tế. | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; - Biểu đồ, bảng biểu phù hợp, danh mục tham khảo đầy đủ. | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; - Biểu đồ bảng biểu không phù hợp hoặc không có. | - Không có định dạng; - Ngôn ngữ không phù hợp."
}