{
  "doc_id": "vi-llnl1105",
  "language": "vi",
  "course_name": "Triết học Mác - Lênin",
  "course_variant": "",
  "course_code": "LLNL1105",
  "source_filename": "Triết học Mác - Lênin_LLNL1105.docx",
  "source_relpath": "data\\raw\\vi\\Triết học Mác - Lênin_LLNL1105.docx",
  "source_hash": "f38289e5f23e237ecec443bc33bc1d41",
  "source_modified": "2025-10-19T17:31:17.245507+00:00",
  "processed_at": "2025-11-05T15:52:53.523162+00:00",
  "outline": [
    {
      "sequence": 1,
      "level": 1,
      "title": "1. THÔNG TIN CHUNG (General Information)"
    },
    {
      "sequence": 2,
      "level": 1,
      "title": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
    },
    {
      "sequence": 3,
      "level": 1,
      "title": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
    },
    {
      "sequence": 4,
      "level": 1,
      "title": "4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares)"
    },
    {
      "sequence": 5,
      "level": 2,
      "title": "4.1 Giáo trình"
    },
    {
      "sequence": 6,
      "level": 2,
      "title": "4.2 Tài liệu tham khảo"
    },
    {
      "sequence": 7,
      "level": 1,
      "title": "5. MỤC TIÊU HỌC PHẦN (Course Goals)"
    },
    {
      "sequence": 8,
      "level": 1,
      "title": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)"
    },
    {
      "sequence": 9,
      "level": 1,
      "title": "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)"
    },
    {
      "sequence": 10,
      "level": 2,
      "title": "7.1. Cơ cấu điểm thành phần"
    },
    {
      "sequence": 11,
      "level": 2,
      "title": "7.2. Ma trận đề thi (phụ lục 1)"
    },
    {
      "sequence": 12,
      "level": 2,
      "title": "7.3. Các rubrics (phụ lục 2)"
    },
    {
      "sequence": 13,
      "level": 1,
      "title": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)"
    },
    {
      "sequence": 14,
      "level": 1,
      "title": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)"
    },
    {
      "sequence": 15,
      "level": 1,
      "title": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)"
    },
    {
      "sequence": 16,
      "level": 2,
      "title": "10.1. Quy định về điều kiện thi kết thúc học phần"
    },
    {
      "sequence": 17,
      "level": 2,
      "title": "10.2 Quy định về tham dự lớp học"
    },
    {
      "sequence": 18,
      "level": 2,
      "title": "10.3. Quy định về hành vi trong lớp học"
    },
    {
      "sequence": 19,
      "level": 1,
      "title": "PHỤ LỤC"
    },
    {
      "sequence": 20,
      "level": 2,
      "title": "Phụ lục 1. MA TRẬN ĐỀ THI"
    },
    {
      "sequence": 21,
      "level": 2,
      "title": "Phụ lục 2. CÁC RUBRICS"
    }
  ],
  "stats": {
    "paragraphs": 60,
    "headings": 21,
    "tables": 13,
    "chunks": 22,
    "words": 5580
  },
  "chunks": [
    {
      "chunk_id": "vi-llnl1105#001",
      "text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐẠI HỌC KINH TẾ QUỐC DÂN | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc\nĐỀ CƯƠNG CHI TIẾT HỌC PHẦN\n(Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024)",
      "word_count": 54,
      "char_count": 246,
      "heading_path": [],
      "primary_heading": null,
      "breadcrumbs": "",
      "position": {
        "order": 1,
        "start_block": 0,
        "end_block": 6
      }
    },
    {
      "chunk_id": "vi-llnl1105#002",
      "text": "- Tên học phần (tiếng Việt):\tTriết học Mác - Lênin\n- Tên học phần (tiếng Anh):\tPhilosophy of marxism and Leninism\n- Trình độ đào tạo:\t\tĐại học\n- Mã học phần:\t\t\tLLNL1105\n- Số tín chỉ\t\t\t03\n- Số giờ trên lớp:\t45\n- Số giờ tự học\t\t105\n(01 tín chỉ bằng 50 giờ định mức, 01 giờ định mức bằng 50 phút)\n- Các học phần tiên quyết:\nTriết học Mac- Lênin là học phần đầu tiên trong hệ thống các môn khoa học Mác-Lênin và tư tưởng Hồ Chí Minh mà sinh viên phải hoàn thành",
      "word_count": 101,
      "char_count": 457,
      "heading_path": [
        "1. THÔNG TIN CHUNG (General Information)"
      ],
      "primary_heading": "1. THÔNG TIN CHUNG (General Information)",
      "breadcrumbs": "1. THÔNG TIN CHUNG (General Information)",
      "position": {
        "order": 2,
        "start_block": 7,
        "end_block": 17
      }
    },
    {
      "chunk_id": "vi-llnl1105#003",
      "text": "(Management Faculty and Teachers)\n- Khoa/Viện quản lý học phần: Khoa Lý luận chính trị\n- Địa chỉ: Phòng 1014, Nhà A1, Trường ĐH Kinh tế Quốc dân\n- Giảng viên giảng dạy học phần:\nSTT | Họ và tên | Email NEU\n1 | TS. Phạm Văn Sinh | sinhpv@neu.edu.vn\n2 | ThS. Nguyễn Mai Lan | lannm@neu.edu.vn\n3 | TS. Nghiêm Thị Châu Giang | giangntc@neu.edu.vn\n4 | TS. Nguyễn Văn Hậu | nvhau@neu.edu.vn\n5 | TS. Nguyễn Văn Thuân | thuannv@neu.edu.vn\n6 | TS. Nguyễn Thị Lê Thư | thuntl@neu.edu.vn\n7 | ThS. Võ Thị Hồng Hạnh | hanhvh@neu.edu.vn",
      "word_count": 102,
      "char_count": 522,
      "heading_path": [
        "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
      ],
      "primary_heading": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "breadcrumbs": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "position": {
        "order": 3,
        "start_block": 18,
        "end_block": 23
      }
    },
    {
      "chunk_id": "vi-llnl1105#004",
      "text": "- Học phần trang bị những nội dung cơ bản của thế giới quan và phương pháp luận triết học của chủ nghĩa Mác – Lênin  trong việc nghiên cứu và học tập các môn học khác trong chương trình đào tạo cũng như các tri thức khác của nhân loại; cho việc vận dụng các tri thức của sinh viên vào đời sống thực tiễn. Làm tiền đề trực tiếp để nghiên cứu các bộ phận cấu thành khác của chủ nghĩa Mác - Lênin, tiếp cận môn Tư tưởng Hồ Chí Minh và  Lịch sử Đảng Cộng sản Việt Nam. Xây dựng niềm tin, lý tưởng cách mạng cho sinh viên, định hướng tư tưởng - chính trị trong chuyên ngành được đào tạo.\n- Nội dung chính:\n- Thế giới quan và phương pháp luận của triết học Mác – Lênin\n- Nội dung cơ bản của chủ nghĩa duy vật biện chứng",
      "word_count": 156,
      "char_count": 713,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "position": {
        "order": 4,
        "start_block": 24,
        "end_block": 27
      }
    },
    {
      "chunk_id": "vi-llnl1105#005",
      "text": "- Nội dung cơ bản của phép biện chứng duy vật\n- Nội dung cơ bản về lý luận nhận thức duy vật biện chứng\n- Quy luật chi phối sự vận động, phát triển của xã hội.",
      "word_count": 38,
      "char_count": 170,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (Course Descriptions)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (Course Descriptions)",
      "position": {
        "order": 5,
        "start_block": 28,
        "end_block": 31
      }
    },
    {
      "chunk_id": "vi-llnl1105#006",
      "text": "[1] Bộ Giáo dục và Đào tạo, Giáo trình Triết học Mác - Lênin. (Dành cho bậc đại học không chuyên lý luận chính trị), NXB Chính trị Quốc gia Sự thật, Hà nội 2021",
      "word_count": 35,
      "char_count": 160,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares)",
        "4.1 Giáo trình"
      ],
      "primary_heading": "4.1 Giáo trình",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares) > 4.1 Giáo trình",
      "position": {
        "order": 6,
        "start_block": 33,
        "end_block": 34
      }
    },
    {
      "chunk_id": "vi-llnl1105#007",
      "text": "[2] Bộ Giáo dục và Đào tạo, Giáo trình Triết học Mác - Lênin. (Dùng trong đào tạo học viên cao học và nghiên cứu sinh không thuộc chuyên ngành Triết học), Nxb Chính trị - Hành chính, Hà Nội, 2008.\n[3] Nhóm biên soạn Khoa Lý luận chính trị, Slide bài giảng Triết học Mác - Lênin (2023), gồm slide lecture và slide seminar.",
      "word_count": 65,
      "char_count": 321,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares)",
        "4.2 Tài liệu tham khảo"
      ],
      "primary_heading": "4.2 Tài liệu tham khảo",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares) > 4.2 Tài liệu tham khảo",
      "position": {
        "order": 7,
        "start_block": 35,
        "end_block": 38
      }
    },
    {
      "chunk_id": "vi-llnl1105#008",
      "text": "Bảng 1. Mục tiêu học phần\nMã/Code (CGx) | Mô tả mục tiêu học phần (CG) | CĐR/PLO của CTĐT*\n[1] | [2] | [3]\nCG1 | Có kiến thức về thế giới quan và phương pháp luận khoa học của triết học Mác-Lênin. Có kiến thức về những nội dung cơ bản của chủ nghĩa duy vật biện chứng, phép biện chứng duy vật, lý luận nhận thức duy vật biện chứng. | -\nCG2 | Có kiến thức về những quy luật chi phối sự vận động, phát triển của xã hội. Giúp sinh viên hình thành kỹ năng tư duy lôgic, khoa học; phát triển các kĩ năng phân tích, so sánh, tổng hợp, hệ thống hóa các vấn đề khoa học. | ...\nCG3 | Có khả năng làm việc cá nhân, làm việc nhóm trong phân tích, luận giải được các vấn đề kinh tế, chính trị, xã hội. Giúp sinh viên trở thành công dân toàn cầu, hành động có trách nhiệm xã hội. | ...\nCG4 | Có khả năng làm việc cá nhân, làm việc nhóm trong phân tích, luận giải được các vấn đề triết học. | -",
      "word_count": 197,
      "char_count": 926,
      "heading_path": [
        "5. MỤC TIÊU HỌC PHẦN (Course Goals)"
      ],
      "primary_heading": "5. MỤC TIÊU HỌC PHẦN (Course Goals)",
      "breadcrumbs": "5. MỤC TIÊU HỌC PHẦN (Course Goals)",
      "position": {
        "order": 8,
        "start_block": 39,
        "end_block": 40
      }
    },
    {
      "chunk_id": "vi-llnl1105#009",
      "text": "Bảng 2. Chuẩn đầu ra học phần (CLO)\nMục tiêu | CLOij | Mô tả CLO | Mức độ đạt được\n[1] | [2] | [3] | [4]\nCG1 | CLO 1.1 | Giúp cho người học hiểu được vấn đề cơ bản của Triết học và sự hình thành phát triển của các trường phái triết học; Sự ra đời và phát triển của triết học Mác – Lênin; Vai trò của triết học Mác - Lênin trong đời sống xã hội và trong sự nghiệp đổi mới ở Việt Nam hiện nay. | I\nCG1 | CLO 1.2 | Giúp cho người học hiểu được khái niệm vật chất, các phương thức và hình thức tồn tại của vật chất, tính thống nhất vật chất của thế giới. Hiểu được nguồn gốc, bản chất và kết cấu của ý thức. Giúp người học có kiến thức nhằm nhận thức và luận giải được mối quan hệ biện chứng giữa vật chất và ý thức. Từ đó cho người học rút ra nguyên tắc phương pháp luận trong nhận thức và hoạt động thực tiễn. Giúp cho sinh viên nhận thức đầy đủ nội dung của phép biện chứng duy vật; hiểu được lý luận nhận thức duy vật biện chứng. | II\nCG1 | CLO1.3 | Hiểu được học thuyết hình thái kinh tế - xã hội; hiểu rõ quan điểm của chủ nghĩa Mác – Lênin về giai cấp và dân tộc, về nhà nước và cách mạng xã hội. | II\nCG2 | CLO 2.1 | Hiểu được quan điểm của chủ nghĩa Mác – Lênin về ý thức xã hội và tồn tại xã hội, và quan điểm của triết học mác – Lênin về con người | II\nCG2 | CLO 2.2 | Giúp người học có thái độ tích cực, năng động, sáng tạo và tự chủ trong công việc, có chịu trách nhiệm về kết quả công việc của bản thân. | III\nCG3 | CLO 3.1 | Định hướng cho người học trở thành công dân toàn cầu, hành động có trách nhiệm xã hội. | III\nCG3 | CLO 3.2 | Trang bị cho người học phương pháp luận khoa học trong nhận thức và hoạt động thực tiễn. | III\nCG4 | CLO 4.1 | Chủ động trong học tập, nghiên cứu, làm việc nhóm | III\nCG4 | CLO 4.2 | Chủ động xác định vấn đề thảo luận, luận giải các ý nghĩa của các nội dung lý thuyết. | III\nCG4 | CLO 4.3 | Chủ động trong trình bày kết quả từ bài tập nhóm, và các vấn đề thực tiễn. | III",
      "word_count": 448,
      "char_count": 1916,
      "heading_path": [
        "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)"
      ],
      "primary_heading": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)",
      "breadcrumbs": "6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)",
      "position": {
        "order": 9,
        "start_block": 42,
        "end_block": 43
      }
    },
    {
      "chunk_id": "vi-llnl1105#010",
      "text": "Bảng 3. Đánh giá học phần\nHình thức đánh giá | Nội dung/Bài đánh giá | Thời điểm | CLOs | Công cụ và tiêu chí đánh giá | Tỷ lệ (%) | CĐR/PLO của CTĐT*\n[1] | [2] | [3] | [4] | [5] | [6] | [7]\nChuyên cần | Tham gia lớp seminar Tham gia thảo luận các buổi seminar | Tại tất cả các buổi seminar | CLO4.1 CLO4.2 CLO4.3 | - Điểm danh - Trả lời câu hỏi, thảo luận trên lớp Xem Phụ lục 2, rubrics 1 | 10% | -\nĐánh giá quá trình/giữa kỳ | - Bài tập nhóm Nhóm từ 3-4 sinh viên - Nhóm thực hiện theo chủ đề của giảng viên seminar. - Kết quả là một bài viết, không bắt buộc thuyết trình. | Các thời điểm do giảng viên seminar quyết định | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO4.1 CLO4.2 CLO4.3 | - Xem Phụ lục 2, rubrics 2 | 20% | …\nĐánh giá quá trình/giữa kỳ | - Bài tập lớn - Là bài tập cá nhân, chủ đề bài tập thực hiện theo yêu cầu của giảng viên giảng dạy lý thuyết giao. - Kết quả là một bài viết, không thuyết trình. | Nộp bản cuối: tuần 13 | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO4.1 CLO4.2 CLO4.3 | - Xem Phụ lục 2, rubrics 3 | 20% | -\nĐánh giá cuối kỳ | - Thi kết thúc cuối kì. - Nội dung đánh giá: Toàn bộ nội dung học. | Theo lịch của Trường | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 | - Trắc nghiệm khách quan trên máy - Số câu hỏi: 80 - Thời gian: 50 phút - Xem Phụ lục 1: ma trận đề thi | 50% | …",
      "word_count": 305,
      "char_count": 1337,
      "heading_path": [
        "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)",
        "7.1. Cơ cấu điểm thành phần"
      ],
      "primary_heading": "7.1. Cơ cấu điểm thành phần",
      "breadcrumbs": "7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment) > 7.1. Cơ cấu điểm thành phần",
      "position": {
        "order": 10,
        "start_block": 47,
        "end_block": 48
      }
    },
    {
      "chunk_id": "vi-llnl1105#011",
      "text": "Bảng 4. Kế hoạch và Nội dung dạy học\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1. Triết học và vai trò của Triết học trong đời sống xã hội I. Triết học và vấn đề cơ bản của triết học II. Triết học mác – Lênin và vai trò của triết học Mác – Lênin đối với đời sống xã hội | [1] Chương 1 [2] Chương 1 [3] Chương 1 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo. - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 1 Sinh viên - Xem trước đề cương - Đọc các tài liệu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n2 | Seminar 1 - Thảo luận về các ví dụ, câu hỏi của seminar 1. - Thảo luận về nguồn gốc triết học, về đặc thù của triết học, đối tượng của triết học trong lịch sử, thế giới quan. - Thảo luận về nội dung vấn đề cơ bản của triết học. - Thảo luận về biện chứng và siêu hình. - Thảo luận về sự ra đời và phát triển của triết học Mác - Lênin. - Thảo luận về đối tượng và chức năng của triết học Mác - Lênin. - Thảo luận về Vai trò của triết học Mác - Lênin trong đời sống xã hội. | [1] Chương 1 [2] Chương 1 [3] Chương 1 | Giảng viên - Khái lược các nội dung về triết học. - Hướng dẫn luận giải về sự phát triển của đối tượng triết học, về chủ nghĩa duy vật biện chứng. - Hướng dẫn luận giải về nội dung vấn đề cơ bản của triết học. - Khái lược những điều kiện lịch sử của sự ra đời triết học Mác. - Hướng dẫn luận giải: Triết học Mác - Lênin là cơ sở thế giới quan và phương pháp luận khoa học và cách mạng để phân tích xu hướng phát triển của xã hội trong điều kiện cuộc cách mạng khoa học và công nghệ hiện đại phát triển mạnh mẽ. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 1 - Trả lời các câu hỏi về nội dung quan điểm của các trường phái triết học. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n3 | Lecture 2. Chương 2: Chủ nghĩa duy vật biện chứng I. Vật chất và ý thức | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 2 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n4 | Seminar 2 - Thảo luận về các ví dụ, câu hỏi, của seminar 2. - Thảo luận về vật chất và các hình thức tồn tại của vật chất. - Thảo luận về nguồn gốc, bản chất và kết cấu của ý thức. - Thảo luận về Mối quan hệ giữa vật chất và ý thức. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về quan niệm của chủ nghĩa duy tâm và chủ nghĩa duy vật trước Mác về phạm trù vật chất. - Hướng dẫn luận giải về quan niệm của triết học Mác - Lênin về vật chất. - Hướng dẫn luận giải về nguồn gốc, bản chất, kết cấu của ý thức, mối quan hệ giữa vật chất và ý thức Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 2 - Trả lời các câu hỏi về ý nghĩa rút ra từ nghiên cứu mối quan hệ giữa vật chất và ý thức. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n5 | Lecture 3. Chương 2: Chủ nghĩa duy vật biện chứng II. Phép biện chứng duy vật 1. Hai lọai hình biện chứng và PBC duy vật 2. Nội dung của phép biện chứng duy vật | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo. - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 3 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n6 | Seminar 3 - Thảo luận về các ví dụ, câu hỏi của seminar 3. - Thảo luận về hai nguyên lý của phép biện chứng duy vật. - Thảo luận về các cặp phạm trù cơ bản. - Thảo luận về các quy luật cơ bản. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về hai nguyên lý, các cặp phạm trù cơ bản, và về các quy luật cơ bản. - Hướng dẫn luận giải nội dung của các nguyên tắc: toàn diện, phát triển, và lịch sử cụ thể. - Hướng dẫn luận giải về vị trí, vai trò của các quy luật cơ bản. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 3 - Trả lời các câu hỏi về vai trò, vị trí của các quy luật đối với sự phát triển của sự vật hiện tượng. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n7 | Lecture 4. Chương 2: Chủ nghĩa duy vật biện chứng III. Lý luận nhận thức | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giảng lý thuyết theo nội dung slide. - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 4 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n8 | Seminar 4 - Thảo luận về các ví dụ, câu hỏi của seminar 4. - Thảo luận về lý luận nhận thức của chủ nghĩa duy vật biện chứng. - Thảo luận về thực tiễn và vai trò của thực tiễn đối với nhận thức. - Thảo luận về chân lý. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về lý luận nhận thức, thực tiễn và vai trò của thực tiễn đối với nhận thức, và vấn đề chân lý. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 4 - Trả lời các câu hỏi về các giai đoạn của quá trình nhận thức. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n9 | Lecture 5. Chương 3: Chủ nghĩa duy vật lịch sử I. Học thuyết hình thái kinh tế - xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 5 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n10 | Seminar 5 - Thảo luận về các ví dụ, câu hỏi của seminar 5. - Thảo luận về vai trò của sản xuất vật chất đối với sự phát triển của xã hội. - Thảo luận về nội dung quy luật về sự phù hợp của quan hệ sản xuất với tính chất và trình độ phát triển của lực lượng sản xuất. - Thảo luận về cơ sở hạ tầng và kiến trúc thượng tầng của xã hội. - Thảo luận về sự phát triển các hình thái kinh tế - xã hội. | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về phương thức sản xuất, lực lượng sản xuất và quan hệ sản xuất. - Hướng dẫn luận giải về vai trò quyết định của lực lượng sản xuất đối với quan hệ sản xuất. - Hướng dẫn luận giải về sự tác động trở lại của quan hệ sản xuất đối với lực lượng sản xuất. - Hướng dẫn luận giải về sự phát triển của các hình thái kinh tế - xã hội. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 5 - Trả lời các câu hỏi về ý nghĩa thực tiễn của quy luật về sự phù hợp của quan hệ sản xuất với tính chất và trình độ phát triển của lực lượng sản xuất. - Trả lời các câu hỏi về vai trò quyết định của cơ sở hạ tầng đối với kiến trúc thượng tầng. Và về tính quy luật của sự phát triển các hình thái kinh tế - xã hội | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n11 | Lecture 6. Chương 3: Chủ nghĩa duy vật lịch sử II. Giai cấp và dân tộc II. Nhà nước và cách mạng xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, dành cho seminar 6 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n12 | Seminar 6 - Thảo luận về các ví dụ, câu hỏi của seminar 6. - Thảo luận về vai trò của đấu tranh giai cấp đối với sự phát triển của xã hội. - Thảo luận về bản chất, chức năng, đặc trưng, các kiểu và hình thức nhà nước. | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về giai cấp và đấu tranh giai cấp, dân tộc, và mối quan hệ giai cấp – dân tộc – nhân loại - Hướng dẫn luận giải về nguồn gốc của giai cấp, tính tất yếu và thực chất của đấu tranh giai cấp. - Hướng dẫn luận giải về cách mạng xã hội. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 6 - Trả lời các câu hỏi về mục tiêu của cách mạng xã hội chủ nghĩa, về cách mạng xã hội. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n13 | Lecture 7. Chương 3: Chủ nghĩa duy vật lịch sử IV. Ý thức xã hội V. Triết học về con người | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, dành cho seminar 7 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n14 | Seminar 7 - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 7. - Thảo luận về mối quan hệ giữa tồn tại xã hội và ý thức xã hội - Thảo luận về mối quan hệ giữa cá nhân và xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về ý thức xã hội và tồn tại xã hội. - Hướng dẫn luận giải về bản chất con người. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 7 - Trả lời câu hỏi về tính sản xuất nhỏ lẻ của người Việt Nam. - Trả lời các câu hỏi về con người trong sự nghiệp cách mạng Việt Nam. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n15 | Seminar 8 - Hệ thống lại học phần - Thông báo, giải thích về kết quả đánh giá điểm thành phần - Hướng dẫn thi và trả lời câu hỏi | [3] Slide bài seminar 8 | Giảng viên - Hệ thống lại các kiến thức của học phần - Hệ thống các dạng câu hỏi bài thi cuối kỳ - Thông báo điểm chuyên cần 10% - Thông báo điểm bài tập lớn và trả lời các thắc mắc của sinh viên - Thông báo điểm bài tập nhóm và giải đáp thắc mắc - Thông báo điểm 40% - Chữa một số câu trong câu hỏi thi tham khảo Sinh viên - Có mặt đầy đủ để nhận thông tin về điểm thành phần - Xem lại toàn bộ nội dung học phần, các câu hỏi tham khảo | - Điểm danh - Sau buổi học này, không giải quyết các thắc mắc về điểm thành phần. | -\nLịch thi | Thi cuối kỳ | [1] Chương 1 đến 3 | Thi trắc nghiệm khách quan trên máy | Xem Phụ lục 1: ma trận đề thi | Xem Bảng 3",
      "word_count": 2496,
      "char_count": 10730,
      "heading_path": [
        "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)"
      ],
      "primary_heading": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "breadcrumbs": "8. KẾ HOẠCH DẠY HỌC (Lesson Plan)",
      "position": {
        "order": 11,
        "start_block": 54,
        "end_block": 55
      }
    },
    {
      "chunk_id": "vi-llnl1105#012",
      "text": "Hệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.",
      "word_count": 40,
      "char_count": 182,
      "heading_path": [
        "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)"
      ],
      "primary_heading": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)",
      "breadcrumbs": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)",
      "position": {
        "order": 12,
        "start_block": 60,
        "end_block": 61
      }
    },
    {
      "chunk_id": "vi-llnl1105#013",
      "text": "- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.",
      "word_count": 28,
      "char_count": 126,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.1. Quy định về điều kiện thi kết thúc học phần"
      ],
      "primary_heading": "10.1. Quy định về điều kiện thi kết thúc học phần",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.1. Quy định về điều kiện thi kết thúc học phần",
      "position": {
        "order": 13,
        "start_block": 63,
        "end_block": 65
      }
    },
    {
      "chunk_id": "vi-llnl1105#014",
      "text": "- Sinh viên có trách nhiệm tham dự đầy đủ các buổi học.\n- Trong trường hợp nghỉ học do lý do bất khả kháng thì cần chủ động tìm hiểu kiến thức thông qua tài liệu được giảng viên cung cấp và các tài liệu khác được yêu cầu đọc.",
      "word_count": 51,
      "char_count": 225,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.2 Quy định về tham dự lớp học"
      ],
      "primary_heading": "10.2 Quy định về tham dự lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.2 Quy định về tham dự lớp học",
      "position": {
        "order": 14,
        "start_block": 66,
        "end_block": 68
      }
    },
    {
      "chunk_id": "vi-llnl1105#015",
      "text": "- Sinh viên thực hiện theo quy định của Nhà trường.\n- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người giảng;\n- Sinh viên ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Sinh viên đọc trước tài liệu được yêu cầu và làm các bài tập về nhà;\n- Laptop, máy tính bảng, điện thoại di động chỉ được sử dụng cho mục đích ghi chép bài giảng, phục vụ học tập của môn học, tuyệt đối không dùng vào mục đích khác.\n11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)\nTháng  6  năm 2024",
      "word_count": 106,
      "char_count": 498,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.3. Quy định về hành vi trong lớp học"
      ],
      "primary_heading": "10.3. Quy định về hành vi trong lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.3. Quy định về hành vi trong lớp học",
      "position": {
        "order": 15,
        "start_block": 69,
        "end_block": 77
      }
    },
    {
      "chunk_id": "vi-llnl1105#016",
      "text": "TRƯỞNG KHOA | HIỆU TRƯỞNG\nTS Nguyễn Thị Hoàn | GS.TS Phạm Hồng Chương",
      "word_count": 14,
      "char_count": 69,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.3. Quy định về hành vi trong lớp học"
      ],
      "primary_heading": "10.3. Quy định về hành vi trong lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.3. Quy định về hành vi trong lớp học",
      "position": {
        "order": 16,
        "start_block": 77,
        "end_block": 80
      }
    },
    {
      "chunk_id": "vi-llnl1105#017",
      "text": "- Trọng số trong điểm học phần: 50%\n- Hình thức: Thi trắc nghiệm khách quan trên máy tính\n- Thời gian: 50 phút\n- Số câu hỏi: 80 câu.\n- Thang điểm: 10 điểm\nBài | CLO | Nhớ | Hiểu | Vận dụng | Tổng\nLecture 1 | 1.1, 1.2, 1.3 2.1, 2.2 | 1 | 4 | 1 | 6\nLecture 2 | 1.1, 1.2, 1.3 2.1, 2.2 | 4 | 4 | 2 | 10\nLecture 3 | 1.1, 1.2, 1.3 2.1, 2.2 | 4 | 4 | 2 | 10\nLecture 4 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 5 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 6 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 7 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 5 | 5 | 2 | 12\nTổng số câu | Tổng số câu | 32 | 32 | 16 | 80\nTỷ lrọng | Tỷ lrọng | 40% | 40% | 20% | 100%",
      "word_count": 195,
      "char_count": 689,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 1. MA TRẬN ĐỀ THI"
      ],
      "primary_heading": "Phụ lục 1. MA TRẬN ĐỀ THI",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 1. MA TRẬN ĐỀ THI",
      "position": {
        "order": 17,
        "start_block": 82,
        "end_block": 88
      }
    },
    {
      "chunk_id": "vi-llnl1105#018",
      "text": "Rubric 1.  Đánh giá điểm chuyên cần\n- Trọng số trong điểm học phần: 10%\n- Đánh giá qua 8 buổi seminar.\nSố buổi vắng (điểm danh) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá)\nSố buổi vắng (điểm danh) | Rất tích cực | Tích cực | Có tham gia | Không tham gia\n0 | 10, 10+ | 9 | 8 | 7\n1 | 9, 10 | 8 | 7 | 6\n2 | 8, 9 | 7 | 6 | 5\n> 2 | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại\n* Ghi chú: 10+ : có thể xem xét để cộng điểm vào điểm đánh giá 40% khi điểm chuyên cần là 10.",
      "word_count": 158,
      "char_count": 618,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 18,
        "start_block": 92,
        "end_block": 97
      }
    },
    {
      "chunk_id": "vi-llnl1105#019",
      "text": "Tiêu chí đánh giá tham gia thảo luận\nRất tích cực | Tích cực | Có tham gia | Không tham gia\n- Xung phong trả lời câu hỏi từ hai lần trở lên; - Chủ động trình bày vấn đề và ý kiến cá nhân, thảo luận; - Đề xuất các vấn đề, chủ đề mới; - Hoạt động nổi bật khác. | - Xung phong trả lời câu hỏi; - Đặt câu hỏi thảo luận với lớp; - Trả lời đúng câu hỏi mà các sinh viên khác chưa trả lời được; - Trả lời tốt về bài tập nhóm. | - Trả lời câu hỏi GV yêu cầu trả lời; - Có phát biểu ý kiến; - Có trả lời về bài tập nhóm. | - Không trả lời câu hỏi; - Không tham gia tương tác.\nCLO của đánh giá chuyên cần",
      "word_count": 146,
      "char_count": 594,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 19,
        "start_block": 99,
        "end_block": 102
      }
    },
    {
      "chunk_id": "vi-llnl1105#020",
      "text": "Cách thức đánh giá | CLO | CLO | CLO\nCách thức đánh giá | 4.1 | 4.2 | 4.3\nĐiểm danh | - | - | -\nTrả lời câu hỏi trên lớp | - | - | -\nĐăng ký nhóm đúng thời hạn | - | - | -\nTrả lời về chủ đề của nhóm, thảo luận chủ đề nhóm khác | - | - | -\nThảo luận về vấn đề liên hệ thực tiễn của nhóm khác | - | - | x\nRubric 2: Đánh giá bài tập nhóm\n- Trọng số: 20% (thành phần thứ nhất của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập nhóm, không bắt buộc thuyết trình",
      "word_count": 123,
      "char_count": 459,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 20,
        "start_block": 102,
        "end_block": 107
      }
    },
    {
      "chunk_id": "vi-llnl1105#021",
      "text": "Tiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 2.1 2.2 4.1 4.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lý, phù hợp với chủ đề | - Mục tiêu rõ ràng | - Mục tiêu không rõ | - Mục tiêu không thực tế hoặc không có mục tiêu\nCơ sở lý thuyết | 2.1 2.2 3.1 3.2 | 30% | - Lý thuyết khoa học, chặt chẽ dựa trên cơ sở triết học Mác -Lênin | - Lý thuyết phù hợp với triết học Mác -Lênin | - Lý thuyết không đầy đủ với triết học Mác -Lênin | - Lý thuyết không phù hợp hoặc không có lý thuyết\nLuận giải thực tiễn | 2.1 2.2 3.1 3.2 | 40% | - Thực tiễn bám sát và luận giải được chủ đề; - Luận giải thực tiễn chính sách | - Thực tiễn bám sát và phù hợp với chủ đề; | - Thực tiễn phù hợp với chủ đề; | - Thực tiễn không bám sát và luận giải được chủ đề; - Không luận giải thực tiễn chính sách\nHình trình bày | 4.3 | 10% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; | - Không có định dạng văn bản; - Ngôn ngữ không phù hợp.",
      "word_count": 324,
      "char_count": 1317,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 21,
        "start_block": 107,
        "end_block": 107
      }
    },
    {
      "chunk_id": "vi-llnl1105#022",
      "text": "Rubric 3: Đánh giá bài tập lớn\n- Trọng số: 20% (thành phần thứ hai của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập cá nhân\nTiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 2.1 2.2 4.1 4.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lý, phù hợp với chủ đề | - Mục tiêu rõ ràng | - Mục tiêu không rõ | - Mục tiêu không thực tế hoặc không có mục tiêu\nCơ sở lý thuyết | 2.1 2.2 3.1 3.2 | 30% | - Lý thuyết khoa học, chặt chẽ dựa trên cơ sở triết học Mác -Lênin | - Lý thuyết phù hợp với triết học Mác -Lênin | - Lý thuyết không đầy đủ với triết học Mác -Lênin | - Lý thuyết không phù hợp hoặc không có lý thuyết\nLuận giải ý nghĩa lý luận của nội dung nghiên cứu | 2.1 2.2 3.1 3.2 | 40% | - Luận giải ý nghĩa lý luận rõ ràng, logic, bám sát giải được chủ đề nghiên cứu; - Có xác định được nội dung ý nghĩa gắn với nội dung thực tiễn cụ thể. | - Luận giải ý nghĩa lý luận rõ ràng, logic, bám sát giải được chủ đề nghiên cứu. | - Luận giải được một phần nội dung của ý nghĩa lý luận. | - Không luận giải ý nghĩa lý luận; - Hoặc không xác định được nội dung ý nghĩa lý luận gắn với nội dung thực tiễn cụ thể.\nHình trình bày | 4.3 | 10% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; | - Không có định dạng văn bản; - Ngôn ngữ không phù hợp.",
      "word_count": 398,
      "char_count": 1642,
      "heading_path": [
        "PHỤ LỤC",
        "Phụ lục 2. CÁC RUBRICS"
      ],
      "primary_heading": "Phụ lục 2. CÁC RUBRICS",
      "breadcrumbs": "PHỤ LỤC > Phụ lục 2. CÁC RUBRICS",
      "position": {
        "order": 22,
        "start_block": 109,
        "end_block": 112
      }
    }
  ],
  "full_text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐẠI HỌC KINH TẾ QUỐC DÂN | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc\nĐỀ CƯƠNG CHI TIẾT HỌC PHẦN\n(Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024)\n1. THÔNG TIN CHUNG (General Information)\n- Tên học phần (tiếng Việt):\tTriết học Mác - Lênin\n- Tên học phần (tiếng Anh):\tPhilosophy of marxism and Leninism\n- Trình độ đào tạo:\t\tĐại học\n- Mã học phần:\t\t\tLLNL1105\n- Số tín chỉ\t\t\t03\n- Số giờ trên lớp:\t45\n- Số giờ tự học\t\t105\n(01 tín chỉ bằng 50 giờ định mức, 01 giờ định mức bằng 50 phút)\n- Các học phần tiên quyết:\nTriết học Mac- Lênin là học phần đầu tiên trong hệ thống các môn khoa học Mác-Lênin và tư tưởng Hồ Chí Minh mà sinh viên phải hoàn thành\n2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY\n(Management Faculty and Teachers)\n- Khoa/Viện quản lý học phần: Khoa Lý luận chính trị\n- Địa chỉ: Phòng 1014, Nhà A1, Trường ĐH Kinh tế Quốc dân\n- Giảng viên giảng dạy học phần:\nSTT | Họ và tên | Email NEU\n1 | TS. Phạm Văn Sinh | sinhpv@neu.edu.vn\n2 | ThS. Nguyễn Mai Lan | lannm@neu.edu.vn\n3 | TS. Nghiêm Thị Châu Giang | giangntc@neu.edu.vn\n4 | TS. Nguyễn Văn Hậu | nvhau@neu.edu.vn\n5 | TS. Nguyễn Văn Thuân | thuannv@neu.edu.vn\n6 | TS. Nguyễn Thị Lê Thư | thuntl@neu.edu.vn\n7 | ThS. Võ Thị Hồng Hạnh | hanhvh@neu.edu.vn\n3. MÔ TẢ HỌC PHẦN (Course Descriptions)\n- Học phần trang bị những nội dung cơ bản của thế giới quan và phương pháp luận triết học của chủ nghĩa Mác – Lênin  trong việc nghiên cứu và học tập các môn học khác trong chương trình đào tạo cũng như các tri thức khác của nhân loại; cho việc vận dụng các tri thức của sinh viên vào đời sống thực tiễn. Làm tiền đề trực tiếp để nghiên cứu các bộ phận cấu thành khác của chủ nghĩa Mác - Lênin, tiếp cận môn Tư tưởng Hồ Chí Minh và  Lịch sử Đảng Cộng sản Việt Nam. Xây dựng niềm tin, lý tưởng cách mạng cho sinh viên, định hướng tư tưởng - chính trị trong chuyên ngành được đào tạo.\n- Nội dung chính:\n- Thế giới quan và phương pháp luận của triết học Mác – Lênin\n- Nội dung cơ bản của chủ nghĩa duy vật biện chứng\n- Nội dung cơ bản của phép biện chứng duy vật\n- Nội dung cơ bản về lý luận nhận thức duy vật biện chứng\n- Quy luật chi phối sự vận động, phát triển của xã hội.\n4. TÀI LIỆU HỌC TẬP (Leaning Resources: Course Books, Reference Books, and Softwares)\n4.1 Giáo trình\n[1] Bộ Giáo dục và Đào tạo, Giáo trình Triết học Mác - Lênin. (Dành cho bậc đại học không chuyên lý luận chính trị), NXB Chính trị Quốc gia Sự thật, Hà nội 2021\n4.2 Tài liệu tham khảo\n[2] Bộ Giáo dục và Đào tạo, Giáo trình Triết học Mác - Lênin. (Dùng trong đào tạo học viên cao học và nghiên cứu sinh không thuộc chuyên ngành Triết học), Nxb Chính trị - Hành chính, Hà Nội, 2008.\n[3] Nhóm biên soạn Khoa Lý luận chính trị, Slide bài giảng Triết học Mác - Lênin (2023), gồm slide lecture và slide seminar.\n5. MỤC TIÊU HỌC PHẦN (Course Goals)\nBảng 1. Mục tiêu học phần\nMã/Code (CGx) | Mô tả mục tiêu học phần (CG) | CĐR/PLO của CTĐT*\n[1] | [2] | [3]\nCG1 | Có kiến thức về thế giới quan và phương pháp luận khoa học của triết học Mác-Lênin. Có kiến thức về những nội dung cơ bản của chủ nghĩa duy vật biện chứng, phép biện chứng duy vật, lý luận nhận thức duy vật biện chứng. | -\nCG2 | Có kiến thức về những quy luật chi phối sự vận động, phát triển của xã hội. Giúp sinh viên hình thành kỹ năng tư duy lôgic, khoa học; phát triển các kĩ năng phân tích, so sánh, tổng hợp, hệ thống hóa các vấn đề khoa học. | ...\nCG3 | Có khả năng làm việc cá nhân, làm việc nhóm trong phân tích, luận giải được các vấn đề kinh tế, chính trị, xã hội. Giúp sinh viên trở thành công dân toàn cầu, hành động có trách nhiệm xã hội. | ...\nCG4 | Có khả năng làm việc cá nhân, làm việc nhóm trong phân tích, luận giải được các vấn đề triết học. | -\n6. CHUẨN ĐẦU RA HỌC PHẦN (Course Learning Outcomes)\nBảng 2. Chuẩn đầu ra học phần (CLO)\nMục tiêu | CLOij | Mô tả CLO | Mức độ đạt được\n[1] | [2] | [3] | [4]\nCG1 | CLO 1.1 | Giúp cho người học hiểu được vấn đề cơ bản của Triết học và sự hình thành phát triển của các trường phái triết học; Sự ra đời và phát triển của triết học Mác – Lênin; Vai trò của triết học Mác - Lênin trong đời sống xã hội và trong sự nghiệp đổi mới ở Việt Nam hiện nay. | I\nCG1 | CLO 1.2 | Giúp cho người học hiểu được khái niệm vật chất, các phương thức và hình thức tồn tại của vật chất, tính thống nhất vật chất của thế giới. Hiểu được nguồn gốc, bản chất và kết cấu của ý thức. Giúp người học có kiến thức nhằm nhận thức và luận giải được mối quan hệ biện chứng giữa vật chất và ý thức. Từ đó cho người học rút ra nguyên tắc phương pháp luận trong nhận thức và hoạt động thực tiễn. Giúp cho sinh viên nhận thức đầy đủ nội dung của phép biện chứng duy vật; hiểu được lý luận nhận thức duy vật biện chứng. | II\nCG1 | CLO1.3 | Hiểu được học thuyết hình thái kinh tế - xã hội; hiểu rõ quan điểm của chủ nghĩa Mác – Lênin về giai cấp và dân tộc, về nhà nước và cách mạng xã hội. | II\nCG2 | CLO 2.1 | Hiểu được quan điểm của chủ nghĩa Mác – Lênin về ý thức xã hội và tồn tại xã hội, và quan điểm của triết học mác – Lênin về con người | II\nCG2 | CLO 2.2 | Giúp người học có thái độ tích cực, năng động, sáng tạo và tự chủ trong công việc, có chịu trách nhiệm về kết quả công việc của bản thân. | III\nCG3 | CLO 3.1 | Định hướng cho người học trở thành công dân toàn cầu, hành động có trách nhiệm xã hội. | III\nCG3 | CLO 3.2 | Trang bị cho người học phương pháp luận khoa học trong nhận thức và hoạt động thực tiễn. | III\nCG4 | CLO 4.1 | Chủ động trong học tập, nghiên cứu, làm việc nhóm | III\nCG4 | CLO 4.2 | Chủ động xác định vấn đề thảo luận, luận giải các ý nghĩa của các nội dung lý thuyết. | III\nCG4 | CLO 4.3 | Chủ động trong trình bày kết quả từ bài tập nhóm, và các vấn đề thực tiễn. | III\n7. ĐÁNH GIÁ HỌC PHẦN (Course Assessment)\n7.1. Cơ cấu điểm thành phần\nBảng 3. Đánh giá học phần\nHình thức đánh giá | Nội dung/Bài đánh giá | Thời điểm | CLOs | Công cụ và tiêu chí đánh giá | Tỷ lệ (%) | CĐR/PLO của CTĐT*\n[1] | [2] | [3] | [4] | [5] | [6] | [7]\nChuyên cần | Tham gia lớp seminar Tham gia thảo luận các buổi seminar | Tại tất cả các buổi seminar | CLO4.1 CLO4.2 CLO4.3 | - Điểm danh - Trả lời câu hỏi, thảo luận trên lớp Xem Phụ lục 2, rubrics 1 | 10% | -\nĐánh giá quá trình/giữa kỳ | - Bài tập nhóm Nhóm từ 3-4 sinh viên - Nhóm thực hiện theo chủ đề của giảng viên seminar. - Kết quả là một bài viết, không bắt buộc thuyết trình. | Các thời điểm do giảng viên seminar quyết định | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO4.1 CLO4.2 CLO4.3 | - Xem Phụ lục 2, rubrics 2 | 20% | …\nĐánh giá quá trình/giữa kỳ | - Bài tập lớn - Là bài tập cá nhân, chủ đề bài tập thực hiện theo yêu cầu của giảng viên giảng dạy lý thuyết giao. - Kết quả là một bài viết, không thuyết trình. | Nộp bản cuối: tuần 13 | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO4.1 CLO4.2 CLO4.3 | - Xem Phụ lục 2, rubrics 3 | 20% | -\nĐánh giá cuối kỳ | - Thi kết thúc cuối kì. - Nội dung đánh giá: Toàn bộ nội dung học. | Theo lịch của Trường | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 | - Trắc nghiệm khách quan trên máy - Số câu hỏi: 80 - Thời gian: 50 phút - Xem Phụ lục 1: ma trận đề thi | 50% | …\n7.2. Ma trận đề thi (phụ lục 1)\n7.3. Các rubrics (phụ lục 2)\n8. KẾ HOẠCH DẠY HỌC (Lesson Plan)\nBảng 4. Kế hoạch và Nội dung dạy học\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1. Triết học và vai trò của Triết học trong đời sống xã hội I. Triết học và vấn đề cơ bản của triết học II. Triết học mác – Lênin và vai trò của triết học Mác – Lênin đối với đời sống xã hội | [1] Chương 1 [2] Chương 1 [3] Chương 1 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo. - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 1 Sinh viên - Xem trước đề cương - Đọc các tài liệu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n2 | Seminar 1 - Thảo luận về các ví dụ, câu hỏi của seminar 1. - Thảo luận về nguồn gốc triết học, về đặc thù của triết học, đối tượng của triết học trong lịch sử, thế giới quan. - Thảo luận về nội dung vấn đề cơ bản của triết học. - Thảo luận về biện chứng và siêu hình. - Thảo luận về sự ra đời và phát triển của triết học Mác - Lênin. - Thảo luận về đối tượng và chức năng của triết học Mác - Lênin. - Thảo luận về Vai trò của triết học Mác - Lênin trong đời sống xã hội. | [1] Chương 1 [2] Chương 1 [3] Chương 1 | Giảng viên - Khái lược các nội dung về triết học. - Hướng dẫn luận giải về sự phát triển của đối tượng triết học, về chủ nghĩa duy vật biện chứng. - Hướng dẫn luận giải về nội dung vấn đề cơ bản của triết học. - Khái lược những điều kiện lịch sử của sự ra đời triết học Mác. - Hướng dẫn luận giải: Triết học Mác - Lênin là cơ sở thế giới quan và phương pháp luận khoa học và cách mạng để phân tích xu hướng phát triển của xã hội trong điều kiện cuộc cách mạng khoa học và công nghệ hiện đại phát triển mạnh mẽ. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 1 - Trả lời các câu hỏi về nội dung quan điểm của các trường phái triết học. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n3 | Lecture 2. Chương 2: Chủ nghĩa duy vật biện chứng I. Vật chất và ý thức | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 2 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n4 | Seminar 2 - Thảo luận về các ví dụ, câu hỏi, của seminar 2. - Thảo luận về vật chất và các hình thức tồn tại của vật chất. - Thảo luận về nguồn gốc, bản chất và kết cấu của ý thức. - Thảo luận về Mối quan hệ giữa vật chất và ý thức. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về quan niệm của chủ nghĩa duy tâm và chủ nghĩa duy vật trước Mác về phạm trù vật chất. - Hướng dẫn luận giải về quan niệm của triết học Mác - Lênin về vật chất. - Hướng dẫn luận giải về nguồn gốc, bản chất, kết cấu của ý thức, mối quan hệ giữa vật chất và ý thức Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 2 - Trả lời các câu hỏi về ý nghĩa rút ra từ nghiên cứu mối quan hệ giữa vật chất và ý thức. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n5 | Lecture 3. Chương 2: Chủ nghĩa duy vật biện chứng II. Phép biện chứng duy vật 1. Hai lọai hình biện chứng và PBC duy vật 2. Nội dung của phép biện chứng duy vật | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo. - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 3 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2\n6 | Seminar 3 - Thảo luận về các ví dụ, câu hỏi của seminar 3. - Thảo luận về hai nguyên lý của phép biện chứng duy vật. - Thảo luận về các cặp phạm trù cơ bản. - Thảo luận về các quy luật cơ bản. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về hai nguyên lý, các cặp phạm trù cơ bản, và về các quy luật cơ bản. - Hướng dẫn luận giải nội dung của các nguyên tắc: toàn diện, phát triển, và lịch sử cụ thể. - Hướng dẫn luận giải về vị trí, vai trò của các quy luật cơ bản. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 3 - Trả lời các câu hỏi về vai trò, vị trí của các quy luật đối với sự phát triển của sự vật hiện tượng. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2\n7 | Lecture 4. Chương 2: Chủ nghĩa duy vật biện chứng III. Lý luận nhận thức | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Giảng lý thuyết theo nội dung slide. - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 4 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n8 | Seminar 4 - Thảo luận về các ví dụ, câu hỏi của seminar 4. - Thảo luận về lý luận nhận thức của chủ nghĩa duy vật biện chứng. - Thảo luận về thực tiễn và vai trò của thực tiễn đối với nhận thức. - Thảo luận về chân lý. | [1] Chương 2 [2] Chương 1 [3] Chương 2 | Giảng viên - Khái lược các nội dung về lý luận nhận thức, thực tiễn và vai trò của thực tiễn đối với nhận thức, và vấn đề chân lý. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 4 - Trả lời các câu hỏi về các giai đoạn của quá trình nhận thức. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n9 | Lecture 5. Chương 3: Chủ nghĩa duy vật lịch sử I. Học thuyết hình thái kinh tế - xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi dành cho seminar 5 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n10 | Seminar 5 - Thảo luận về các ví dụ, câu hỏi của seminar 5. - Thảo luận về vai trò của sản xuất vật chất đối với sự phát triển của xã hội. - Thảo luận về nội dung quy luật về sự phù hợp của quan hệ sản xuất với tính chất và trình độ phát triển của lực lượng sản xuất. - Thảo luận về cơ sở hạ tầng và kiến trúc thượng tầng của xã hội. - Thảo luận về sự phát triển các hình thái kinh tế - xã hội. | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về phương thức sản xuất, lực lượng sản xuất và quan hệ sản xuất. - Hướng dẫn luận giải về vai trò quyết định của lực lượng sản xuất đối với quan hệ sản xuất. - Hướng dẫn luận giải về sự tác động trở lại của quan hệ sản xuất đối với lực lượng sản xuất. - Hướng dẫn luận giải về sự phát triển của các hình thái kinh tế - xã hội. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 5 - Trả lời các câu hỏi về ý nghĩa thực tiễn của quy luật về sự phù hợp của quan hệ sản xuất với tính chất và trình độ phát triển của lực lượng sản xuất. - Trả lời các câu hỏi về vai trò quyết định của cơ sở hạ tầng đối với kiến trúc thượng tầng. Và về tính quy luật của sự phát triển các hình thái kinh tế - xã hội | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n11 | Lecture 6. Chương 3: Chủ nghĩa duy vật lịch sử II. Giai cấp và dân tộc II. Nhà nước và cách mạng xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, dành cho seminar 6 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n12 | Seminar 6 - Thảo luận về các ví dụ, câu hỏi của seminar 6. - Thảo luận về vai trò của đấu tranh giai cấp đối với sự phát triển của xã hội. - Thảo luận về bản chất, chức năng, đặc trưng, các kiểu và hình thức nhà nước. | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về giai cấp và đấu tranh giai cấp, dân tộc, và mối quan hệ giai cấp – dân tộc – nhân loại - Hướng dẫn luận giải về nguồn gốc của giai cấp, tính tất yếu và thực chất của đấu tranh giai cấp. - Hướng dẫn luận giải về cách mạng xã hội. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 6 - Trả lời các câu hỏi về mục tiêu của cách mạng xã hội chủ nghĩa, về cách mạng xã hội. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n13 | Lecture 7. Chương 3: Chủ nghĩa duy vật lịch sử IV. Ý thức xã hội V. Triết học về con người | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Giảng lý thuyết theo nội dung slide - Hướng dẫn đọc giáo trình, tài liệu tham khảo - Yêu cầu sinh viên xem trước ví dụ, câu hỏi, dành cho seminar 7 Sinh viên - Đọc các tài liệu - Xem trước các ví dụ, trả lời câu hỏi được yêu cầu | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n14 | Seminar 7 - Thảo luận về các ví dụ, câu hỏi, bài tập của seminar 7. - Thảo luận về mối quan hệ giữa tồn tại xã hội và ý thức xã hội - Thảo luận về mối quan hệ giữa cá nhân và xã hội | [1] Chương 3 [2] Chương 1 [3] Chương 3 | Giảng viên - Khái lược các nội dung về ý thức xã hội và tồn tại xã hội. - Hướng dẫn luận giải về bản chất con người. Sinh viên - Đọc tài liệu trước - Theo dõi ví dụ, câu hỏi, và trả lời các câu hỏi - Phân nhóm làm bài tập nhóm | - Điểm danh - Trả lời câu hỏi trong slide seminar 7 - Trả lời câu hỏi về tính sản xuất nhỏ lẻ của người Việt Nam. - Trả lời các câu hỏi về con người trong sự nghiệp cách mạng Việt Nam. | CLO1.1 CLO1.2 CLO1.3 CLO2.1  CLO2.2 CLO3.1 CLO3.2\n15 | Seminar 8 - Hệ thống lại học phần - Thông báo, giải thích về kết quả đánh giá điểm thành phần - Hướng dẫn thi và trả lời câu hỏi | [3] Slide bài seminar 8 | Giảng viên - Hệ thống lại các kiến thức của học phần - Hệ thống các dạng câu hỏi bài thi cuối kỳ - Thông báo điểm chuyên cần 10% - Thông báo điểm bài tập lớn và trả lời các thắc mắc của sinh viên - Thông báo điểm bài tập nhóm và giải đáp thắc mắc - Thông báo điểm 40% - Chữa một số câu trong câu hỏi thi tham khảo Sinh viên - Có mặt đầy đủ để nhận thông tin về điểm thành phần - Xem lại toàn bộ nội dung học phần, các câu hỏi tham khảo | - Điểm danh - Sau buổi học này, không giải quyết các thắc mắc về điểm thành phần. | -\nLịch thi | Thi cuối kỳ | [1] Chương 1 đến 3 | Thi trắc nghiệm khách quan trên máy | Xem Phụ lục 1: ma trận đề thi | Xem Bảng 3\n9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)\nHệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.\n10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)\n10.1. Quy định về điều kiện thi kết thúc học phần\n- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.\n10.2 Quy định về tham dự lớp học\n- Sinh viên có trách nhiệm tham dự đầy đủ các buổi học.\n- Trong trường hợp nghỉ học do lý do bất khả kháng thì cần chủ động tìm hiểu kiến thức thông qua tài liệu được giảng viên cung cấp và các tài liệu khác được yêu cầu đọc.\n10.3. Quy định về hành vi trong lớp học\n- Sinh viên thực hiện theo quy định của Nhà trường.\n- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người giảng;\n- Sinh viên ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Sinh viên đọc trước tài liệu được yêu cầu và làm các bài tập về nhà;\n- Laptop, máy tính bảng, điện thoại di động chỉ được sử dụng cho mục đích ghi chép bài giảng, phục vụ học tập của môn học, tuyệt đối không dùng vào mục đích khác.\n11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)\nTháng  6  năm 2024\nTRƯỞNG KHOA | HIỆU TRƯỞNG\nTS Nguyễn Thị Hoàn | GS.TS Phạm Hồng Chương\nPHỤ LỤC\nPhụ lục 1. MA TRẬN ĐỀ THI\n- Trọng số trong điểm học phần: 50%\n- Hình thức: Thi trắc nghiệm khách quan trên máy tính\n- Thời gian: 50 phút\n- Số câu hỏi: 80 câu.\n- Thang điểm: 10 điểm\nBài | CLO | Nhớ | Hiểu | Vận dụng | Tổng\nLecture 1 | 1.1, 1.2, 1.3 2.1, 2.2 | 1 | 4 | 1 | 6\nLecture 2 | 1.1, 1.2, 1.3 2.1, 2.2 | 4 | 4 | 2 | 10\nLecture 3 | 1.1, 1.2, 1.3 2.1, 2.2 | 4 | 4 | 2 | 10\nLecture 4 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 5 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 6 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 6 | 5 | 3 | 14\nLecture 7 | 1.1, 1.2, 1.3 2.1, 2.2, 3.1, 3.2 | 5 | 5 | 2 | 12\nTổng số câu | Tổng số câu | 32 | 32 | 16 | 80\nTỷ lrọng | Tỷ lrọng | 40% | 40% | 20% | 100%\nPhụ lục 2. CÁC RUBRICS\nRubric 1.  Đánh giá điểm chuyên cần\n- Trọng số trong điểm học phần: 10%\n- Đánh giá qua 8 buổi seminar.\nSố buổi vắng (điểm danh) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá) | Tham gia thảo luận (GV seminar đánh giá)\nSố buổi vắng (điểm danh) | Rất tích cực | Tích cực | Có tham gia | Không tham gia\n0 | 10, 10+ | 9 | 8 | 7\n1 | 9, 10 | 8 | 7 | 6\n2 | 8, 9 | 7 | 6 | 5\n> 2 | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại | 0 điểm, học lại\n* Ghi chú: 10+ : có thể xem xét để cộng điểm vào điểm đánh giá 40% khi điểm chuyên cần là 10.\nTiêu chí đánh giá tham gia thảo luận\nRất tích cực | Tích cực | Có tham gia | Không tham gia\n- Xung phong trả lời câu hỏi từ hai lần trở lên; - Chủ động trình bày vấn đề và ý kiến cá nhân, thảo luận; - Đề xuất các vấn đề, chủ đề mới; - Hoạt động nổi bật khác. | - Xung phong trả lời câu hỏi; - Đặt câu hỏi thảo luận với lớp; - Trả lời đúng câu hỏi mà các sinh viên khác chưa trả lời được; - Trả lời tốt về bài tập nhóm. | - Trả lời câu hỏi GV yêu cầu trả lời; - Có phát biểu ý kiến; - Có trả lời về bài tập nhóm. | - Không trả lời câu hỏi; - Không tham gia tương tác.\nCLO của đánh giá chuyên cần\nCách thức đánh giá | CLO | CLO | CLO\nCách thức đánh giá | 4.1 | 4.2 | 4.3\nĐiểm danh | - | - | -\nTrả lời câu hỏi trên lớp | - | - | -\nĐăng ký nhóm đúng thời hạn | - | - | -\nTrả lời về chủ đề của nhóm, thảo luận chủ đề nhóm khác | - | - | -\nThảo luận về vấn đề liên hệ thực tiễn của nhóm khác | - | - | x\nRubric 2: Đánh giá bài tập nhóm\n- Trọng số: 20% (thành phần thứ nhất của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập nhóm, không bắt buộc thuyết trình\nTiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 2.1 2.2 4.1 4.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lý, phù hợp với chủ đề | - Mục tiêu rõ ràng | - Mục tiêu không rõ | - Mục tiêu không thực tế hoặc không có mục tiêu\nCơ sở lý thuyết | 2.1 2.2 3.1 3.2 | 30% | - Lý thuyết khoa học, chặt chẽ dựa trên cơ sở triết học Mác -Lênin | - Lý thuyết phù hợp với triết học Mác -Lênin | - Lý thuyết không đầy đủ với triết học Mác -Lênin | - Lý thuyết không phù hợp hoặc không có lý thuyết\nLuận giải thực tiễn | 2.1 2.2 3.1 3.2 | 40% | - Thực tiễn bám sát và luận giải được chủ đề; - Luận giải thực tiễn chính sách | - Thực tiễn bám sát và phù hợp với chủ đề; | - Thực tiễn phù hợp với chủ đề; | - Thực tiễn không bám sát và luận giải được chủ đề; - Không luận giải thực tiễn chính sách\nHình trình bày | 4.3 | 10% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; | - Không có định dạng văn bản; - Ngôn ngữ không phù hợp.\nRubric 3: Đánh giá bài tập lớn\n- Trọng số: 20% (thành phần thứ hai của điểm đánh giá 40%)\n- Đánh giá qua kết quả bài tập cá nhân\nTiêu chí | CLO | Tỷ trọng % | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10) | Mức điểm (thang điểm 10)\nTiêu chí | CLO | Tỷ trọng % | Giỏi 8,5 – 10 | Khá 7,0 – 8,4 | Trung bình 4,5 – 6,9 | Yếu 0 – 4,4\nChủ đề - mục tiêu | 2.1 2.2 4.1 4.2 | 20% | - Mục tiêu rõ ràng, logic, hợp lý, phù hợp với chủ đề | - Mục tiêu rõ ràng | - Mục tiêu không rõ | - Mục tiêu không thực tế hoặc không có mục tiêu\nCơ sở lý thuyết | 2.1 2.2 3.1 3.2 | 30% | - Lý thuyết khoa học, chặt chẽ dựa trên cơ sở triết học Mác -Lênin | - Lý thuyết phù hợp với triết học Mác -Lênin | - Lý thuyết không đầy đủ với triết học Mác -Lênin | - Lý thuyết không phù hợp hoặc không có lý thuyết\nLuận giải ý nghĩa lý luận của nội dung nghiên cứu | 2.1 2.2 3.1 3.2 | 40% | - Luận giải ý nghĩa lý luận rõ ràng, logic, bám sát giải được chủ đề nghiên cứu; - Có xác định được nội dung ý nghĩa gắn với nội dung thực tiễn cụ thể. | - Luận giải ý nghĩa lý luận rõ ràng, logic, bám sát giải được chủ đề nghiên cứu. | - Luận giải được một phần nội dung của ý nghĩa lý luận. | - Không luận giải ý nghĩa lý luận; - Hoặc không xác định được nội dung ý nghĩa lý luận gắn với nội dung thực tiễn cụ thể.\nHình trình bày | 4.3 | 10% | - Đúng định dạng yêu cầu; - Ngôn ngữ khoa học, logic, chặt chẽ, không lỗi chính tả; | - Đúng định dạng yêu cầu; - Ngôn ngữ phù hợp, có ít lỗi chính tả, ngữ pháp; | - Chưa đúng định dạng yêu cầu; - Ngôn ngữ chưa phù hợp, nhiều lỗi chính tả, ngữ pháp; | - Không có định dạng văn bản; - Ngôn ngữ không phù hợp."
}