{
  "doc_id": "vi-lltt1101",
  "language": "vi",
  "course_name": "Tư tưởng Hồ Chí Minh",
  "course_variant": "",
  "course_code": "LLTT1101",
  "source_filename": "Tư tưởng Hồ Chí Minh_LLTT1101.docx",
  "source_relpath": "data\\raw\\vi\\Tư tưởng Hồ Chí Minh_LLTT1101.docx",
  "source_hash": "09bfb00fee0956eee44a83b991c233cf",
  "source_modified": "2025-10-19T17:31:17.246506+00:00",
  "processed_at": "2025-11-05T15:52:53.804645+00:00",
  "outline": [
    {
      "sequence": 1,
      "level": 1,
      "title": "1. THÔNG TIN TỔNG QUÁT (GENERAL INFORMATION)"
    },
    {
      "sequence": 2,
      "level": 1,
      "title": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
    },
    {
      "sequence": 3,
      "level": 1,
      "title": "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)"
    },
    {
      "sequence": 4,
      "level": 1,
      "title": "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)"
    },
    {
      "sequence": 5,
      "level": 1,
      "title": "5. MỤC TIÊU HỌC PHẦN (COURSE GOALS)"
    },
    {
      "sequence": 6,
      "level": 1,
      "title": "6. CHUẨN ĐẦU RA HỌC PHẦN (COURSE LEARNING OUTCOMES)"
    },
    {
      "sequence": 7,
      "level": 1,
      "title": "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)"
    },
    {
      "sequence": 8,
      "level": 1,
      "title": "8. KẾ HOẠCH GIẢNG DẠY (LESSON PLAN)"
    },
    {
      "sequence": 9,
      "level": 1,
      "title": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)"
    },
    {
      "sequence": 10,
      "level": 1,
      "title": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)"
    },
    {
      "sequence": 11,
      "level": 2,
      "title": "10.1. Quy định về điều kiện thi kết thúc học phần"
    },
    {
      "sequence": 12,
      "level": 2,
      "title": "10.2. Quy định về tham dự lớp học"
    },
    {
      "sequence": 13,
      "level": 2,
      "title": "10.3. Quy định về hành vi lớp học"
    },
    {
      "sequence": 14,
      "level": 1,
      "title": "11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)"
    },
    {
      "sequence": 15,
      "level": 1,
      "title": "Phụ lục"
    },
    {
      "sequence": 16,
      "level": 2,
      "title": "Phụ lục 1. MA TRẬN ĐỀ THI"
    },
    {
      "sequence": 17,
      "level": 2,
      "title": "Phụ lục 2. Các rubric"
    }
  ],
  "stats": {
    "paragraphs": 52,
    "headings": 17,
    "tables": 13,
    "chunks": 22,
    "words": 5829
  },
  "chunks": [
    {
      "chunk_id": "vi-lltt1101#001",
      "text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐẠI HỌC KINH TẾ QUỐC DÂN | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc\nĐỀ CƯƠNG CHI TIẾT HỌC PHẦN (Detailed Course Syllabus) | ĐỀ CƯƠNG CHI TIẾT HỌC PHẦN (Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024) | (Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024)",
      "word_count": 80,
      "char_count": 377,
      "heading_path": [],
      "primary_heading": null,
      "breadcrumbs": "",
      "position": {
        "order": 1,
        "start_block": 0,
        "end_block": 2
      }
    },
    {
      "chunk_id": "vi-lltt1101#002",
      "text": "- Tên học phần (tiếng Việt): | Tư tưởng Hồ Chí Minh\n- Tên học phần (tiếng Anh) | Ho Chi Minh Ideology\n- Mã số học phần | LLTT1101\n- Thuộc khối kiến thức | Kiến thức giáo dục đại cương\n- Số tín chỉ | 02\n+ Số giờ trên lớp | 30\n+ Số giờ tự học | 60\n- Các học phần tiên quyết | Triết học Mác - Lênin, Kinh tế chính trị Mác-Lênin, Chủ nghĩa xã hội khoa học",
      "word_count": 85,
      "char_count": 351,
      "heading_path": [
        "1. THÔNG TIN TỔNG QUÁT (GENERAL INFORMATION)"
      ],
      "primary_heading": "1. THÔNG TIN TỔNG QUÁT (GENERAL INFORMATION)",
      "breadcrumbs": "1. THÔNG TIN TỔNG QUÁT (GENERAL INFORMATION)",
      "position": {
        "order": 2,
        "start_block": 3,
        "end_block": 4
      }
    },
    {
      "chunk_id": "vi-lltt1101#003",
      "text": "Khoa/viện quản lý học phần: Khoa Lý luận chính trị\nĐịa chỉ: Phòng 1015 Nhà A1, Trường ĐH Kinh tế Quốc dân\nGiảng viên giảng dạy:\nTT | Họ và tên | Số điện thoại | Email\n1 | TS.GVC. Nguyễn Hồng Sơn | 0912212302 | sonnh@neu.edu.vn\n2 | TS.GVC. Nguyễn Thị Bích Thủy | 0977827782 | thuyntb@neu.edu.vn\n3 | TS.GVC. Nguyễn Chí Thiện | 0913059808 | thiennc@neu.edu.vn\n4 | TS.GVC. Lê Thị Hoa | 0912139918 | hoalt@neu.edu.vn\n5 | TS.GVC. Nguyễn Quang Trung | 0911133533 | trungnqml@neu.edu.vn\n6 | TS.GVC. Nguyễn Thùy Linh | 0916251915 | linhnt@neu.edu.vn",
      "word_count": 98,
      "char_count": 540,
      "heading_path": [
        "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY"
      ],
      "primary_heading": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "breadcrumbs": "2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY",
      "position": {
        "order": 3,
        "start_block": 5,
        "end_block": 9
      }
    },
    {
      "chunk_id": "vi-lltt1101#004",
      "text": "- Học phần gồm 6 chương, trang bị cho sinh viên những kiến thức cơ bản về nguồn gốc, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh; Những nội dung cơ bản về tư tưởng Hồ Chí Minh; Sự vận dụng tư tưởng Hồ Chí Minh của Đảng cộng sản Việt Nam trong sự nghiệp cách mạng.\n- Hình thành cho sinh viên khả năng tư duy độc lập, phân tích, đánh giá, vận dụng sáng tạo tư tưởng Hồ Chí Minh vào giải quyết các vấn đề trong thực tiễn đời sống, học tập và công tác.\n- Giúp sinh viên củng cố lập trường cách mạng, kiên định mục tiêu lý tưởng độc lập dân tộc gắn liền với chu nghĩa xã hội; Góp phần giáo dục đạo đức, tư cách, phẩm chất cách mạng, đóng góp thiết thực và hiệu quả cho sự nghiệp cách mạng.",
      "word_count": 153,
      "char_count": 696,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)",
      "position": {
        "order": 4,
        "start_block": 10,
        "end_block": 12
      }
    },
    {
      "chunk_id": "vi-lltt1101#005",
      "text": "Nội dung chính\n- Khái niệm, đối tượng, phương pháp nghiên cứu và ý nghĩa học tập môn tư tưởng Hồ Chí Minh.\n- Cơ sở, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh.\n- Tư tưởng Hồ Chí Minh về dân tộc và chủ nghĩa xã hội.\n- Tư tưởng Hồ Chí Minh về Đảng cộng sản và Nhà nước của nhân dân, do nhân dân, vì nhân dân.\n- Tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế.\n- Tư tưởng Hồ Chí Minh về văn hoá, đạo đức và con người.",
      "word_count": 105,
      "char_count": 444,
      "heading_path": [
        "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)"
      ],
      "primary_heading": "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)",
      "breadcrumbs": "3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)",
      "position": {
        "order": 5,
        "start_block": 13,
        "end_block": 20
      }
    },
    {
      "chunk_id": "vi-lltt1101#006",
      "text": "Giáo trình\n[1] Bộ Giáo dục và Đào tạo (2021), Giáo trình Tư tưởng Hồ Chí Minh, NXB Chính trị Quốc gia Sự thật, Hà Nội\nTài liệu tham khảo\n[2] Slide Bài giảng tư tưởng Hồ Chí Minh chuẩn do nhóm giảng viên tư tưởng Hồ Chí Minh – Khoa Lý luận Chính trị, Đại học KTQD biên soạn.\n[3]. Phạm Ngọc Anh – Bùi Đình Phong (2003), Tư tưởng Hồ Chí Minh về xây dựng Nhà nước pháp quyền kiểu mới ở Việt Nam, Nxb Lao động, Hà Nội.\n[4]. Hồ Chí Minh (2011), Toàn tập, tập 1 -15, Nxb Chính trị Quốc gia, Hà Nội.\n[5]. Học viện chính trị quốc gia Hồ Chí Minh – Viện Hồ Chí Minh và các lãnh tụ của Đảng (2004), Tư tưởng Hồ Chí Minh về đại đoàn kết với vấn đề phát huy sức mạnh đại đoàn kết dân tộc trong thời kỳ mới, Nxb Chính trị Quốc gia, Hà Nội.",
      "word_count": 162,
      "char_count": 725,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)"
      ],
      "primary_heading": "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)",
      "position": {
        "order": 6,
        "start_block": 21,
        "end_block": 27
      }
    },
    {
      "chunk_id": "vi-lltt1101#007",
      "text": "[6]. Nguyễn Bá Linh (2009), Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội, Nxb Chính trị Quốc gia, Hà Nội.\n[7]. Đặng Xuân Kỳ (chủ biên) (2005), Tư tưởng Hồ Chí Minh về xây dựng con người và phát triển văn hóa, Nxb Chính trị Quốc gia, Hà Nội.",
      "word_count": 56,
      "char_count": 258,
      "heading_path": [
        "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)"
      ],
      "primary_heading": "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)",
      "breadcrumbs": "4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)",
      "position": {
        "order": 7,
        "start_block": 28,
        "end_block": 30
      }
    },
    {
      "chunk_id": "vi-lltt1101#008",
      "text": "Bảng 5.1. Mục tiêu học phần\nMã/Code (CGx) | Mô tả mục tiêu học phần (CG) | CĐR (PLO) của CTĐT*\n[1] | [2] | [3]\nCG1 | - Sinh viên hiểu được đối tượng, phương pháp nghiên cứu, ý nghĩa học tập của môn học Tư tưởng Hồ Chí Minh. - Sinh viên hiểu được cơ sở lý luận và thực tiễn đối với sự hình thành tư tưởng Hồ Chí Minh; nhận thức được các giai đoạn phát triển chủ yếu của tư tưởng Hồ Chí Minh gắn với thực tiễn cách mạng Việt Nam. - Nhận thức được tính khoa học, cách mạng và tính sáng tạo của Hồ Chí Minh trong việc vận dụng những nguyên lý Macxit vào thực tiễn cách mạng; đồng thời thấy rõ vai trò, ý nghĩa to lớn của tư tưởng Hồ Chí Minh đối với cách mạng Việt Nam và cách mạng thế giới. | PLO1.1.2 PLO1.2.2 PLO1.2.3\nCG2 | - Có kỹ năng vận dụng, liên hệ những nội dung cơ bản trong tư tưởng Hồ Chí Minh vào thực tiễn đổi mới ở Việt Nam hiện nay. - Sinh viên hình thành năng lực tư duy khoa học; có kỹ năng nhận thức và giải quyết đúng đắn cả về mặt lý luận và thực tiễn các vấn đề đặt ra trong cuộc sống. - Xây dựng và củng cố niềm tin vào chế độ xã hội chủ nghĩa, tiếp thêm sức mạnh về ý chí và hành động phấn đấu cho lý tưởng cách mạng. | PLO2.1.1\nG3 | Từng bước xây dựng, rèn luyện phương pháp và phong cách tư duy, phong cách làm việc khoa học, tự chủ, đổi mới và sáng tạo. | PLO3.1.1",
      "word_count": 290,
      "char_count": 1303,
      "heading_path": [
        "5. MỤC TIÊU HỌC PHẦN (COURSE GOALS)"
      ],
      "primary_heading": "5. MỤC TIÊU HỌC PHẦN (COURSE GOALS)",
      "breadcrumbs": "5. MỤC TIÊU HỌC PHẦN (COURSE GOALS)",
      "position": {
        "order": 8,
        "start_block": 31,
        "end_block": 32
      }
    },
    {
      "chunk_id": "vi-lltt1101#009",
      "text": "Bảng 6.1. Chuẩn đầu ra học phần (CLO)\nMục tiêu HP | CLOs | Mô tả CLOs* | Mức độ đạt được\n[1] | [2] | [3] | [4]\nG1 | CLO1.1 | Giúp cho người học hiểu được cơ sở, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh; thấy rõ cuộc đời sự nghiệp cách mạng cao cả, vĩ đại của Hồ Chí Minh gắn với thực tiễn cách mạng Việt Nam qua các thời kỳ lịch sử. | 2\nG1 | CLO1.2 | Giúp cho người học hiểu rõ những nội dung cơ bản trong tư tưởng Hồ Chí Minh; nhận thức được bản chất khoa học cách mạng, tính hệ thống, toàn diện trong tư tưởng Hồ Chí Minh về cách mạng Việt Nam. | 2\nG1 | CLO1.3 | Giúp cho người học hiểu rõ vai trò của Hồ Chí Minh trong việc vận dụng và phát triển sáng tạo chủ nghĩa Mác - Lênin, kế thừa những giá trị truyền thống tốt đẹp của dân tộc và tinh hoa văn hóa, văn minh của nhân loại, xây dựng đường lối, chiến lược phù hợp, sáng tạo, đưa cách mạng Việt Nam đi tới thắng lợi, góp phần quan trọng vào tiến trình cách mạng thế giới. | 3\nG2 | CLO2.1 | Có kỹ năng vận dụng tư tưởng Hồ Chí Minh về độc lập dân tộc gắn liền với chủ nghĩa xã hội; về đoàn kết dân tộc, đoàn kết quốc tế, văn hóa, đạo đức, con người trong phân tích sự nghiệp đổi mới đất nước hiện nay. | 3\nG2 | CLO2.2 | Có kỹ năng phân tích, liên hệ tư tưởng Hồ Chí Minh về Đảng, Nhà nước với thực tiễn xây dựng Đảng và Nhà nước pháp quyền xã hội chủ nghĩa của dân, do dân, vì dân ở Việt Nam hiện nay. | 3\nG3 | CLO3.1 | Giúp cho người học nâng cao năng lực tư duy lý luận; nâng cao bản lĩnh chính trị, ý thức và trách nhiệm công dân, thường xuyên tu dưỡng và rèn luyện theo tư tưởng, đạo đức và phong cách Hồ Chí Minh. | 3\nG3 | CLO3.2 | Góp phần giúp người học hình thành phương pháp và kỹ năng làm việc khoa học, kỹ năng phát hiện và giải quyết vấn đề; kỹ năng thuyết trình, phản biện, phát huy tính tự chủ, sáng tạo của mỗi cá nhân và tính liên kết cộng đồng trong học tập, nghiên cứu khoa học. | 3\n- | CLO3.3 | Có tinh thần trách nhiệm cao, có kỹ năng ứng xử chuyên nghiệp đáp ứng yêu cầu đổi mới, công nghiệp hóa, hiện đại hóa và hội nhập quốc tế hiện nay. | 3",
      "word_count": 467,
      "char_count": 2054,
      "heading_path": [
        "6. CHUẨN ĐẦU RA HỌC PHẦN (COURSE LEARNING OUTCOMES)"
      ],
      "primary_heading": "6. CHUẨN ĐẦU RA HỌC PHẦN (COURSE LEARNING OUTCOMES)",
      "breadcrumbs": "6. CHUẨN ĐẦU RA HỌC PHẦN (COURSE LEARNING OUTCOMES)",
      "position": {
        "order": 9,
        "start_block": 35,
        "end_block": 36
      }
    },
    {
      "chunk_id": "vi-lltt1101#010",
      "text": "Bảng 7.1. Đánh giá học phần\nHình thức đánh giá | Nội dung/ \nBài đánh giá | Thời điểm | CLOs | Tiêu chí đánh giá* | Tỷ lệ (%)\n[1] | [2] | [3] | [4] | [5] | [6]\nChuyên cần | Tham gia lớp seminar Tham gia thảo luận các buổi seminar | Các buổi seminar | 3.1 3.2 | - Điểm danh - Trả lời câu hỏi, thảo luận trên lớp - Mức độ hoàn thành đúng hạn các bài tập các nhân/ nhóm Phụ lục 2, rubrics 1 | 10%\nĐánh giá giữa kỳ lần 1 | Bài tập nhóm Nhóm 5-6 sinh viên Chủ đề: Giáo viên lớp seminar cung cấp Nhóm xây dựng đề cương, nghiên cứu, viết báo cáo theo quy định Bài tập lớn được giáo viên lớp seminar quy định. Kết quả là một bài viết khoảng từ 8 đến 12 trang (không bắt buộc thuyết trình) | Nộp bản cuối | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | Mức độ hoàn thành bài tập nhóm (đúng thời gian, chất lượng gắn với mức độ đạt được kiến thức, kỹ năng theo yêu cầu của chuẩn đầu ra học phần Phụ lục 2, rubrics 2 | 20%\nĐánh giá giữa kỳ lần 2: Bài tập cá nhân | Sinh viên làm Bài tập cá nhân do giáo viên giao chủ đề. Quy cách, thể lệ do giảng viên quy định. Số lượng trang từ 6-8 trang. | Thời gian làm bài tập do giảng viên seminar quyết định | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | Bài tập đáp ứng yêu cầu đánh giá kiến thức cơ bản và kiến thức vận dụng | 20%\nĐánh giá cuối kỳ | Đánh giá toàn bộ kiến thức môn học. | Theo lịch thi của Trường | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | - Trắc nghiệm khách quan trên máy. Thời gian làm bài 50 phút/80 câu. - Xem phụ lục 1: Ma trận đề thi. | 50%",
      "word_count": 343,
      "char_count": 1535,
      "heading_path": [
        "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)"
      ],
      "primary_heading": "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)",
      "breadcrumbs": "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)",
      "position": {
        "order": 10,
        "start_block": 39,
        "end_block": 40
      }
    },
    {
      "chunk_id": "vi-lltt1101#011",
      "text": "- Ma trận đề thi (phụ lục 1)\n- Các rubrics (phụ lục 2)",
      "word_count": 14,
      "char_count": 54,
      "heading_path": [
        "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)"
      ],
      "primary_heading": "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)",
      "breadcrumbs": "7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)",
      "position": {
        "order": 11,
        "start_block": 42,
        "end_block": 47
      }
    },
    {
      "chunk_id": "vi-lltt1101#012",
      "text": "Bảng 8.1. Kế hoạch và nội dung giảng dạy\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1: Khái niệm, đối tượng, phương pháp nghiên cứu và ý nghĩa học tập môn tư tưởng Hồ Chí Minh 1. Khái niệm tư tưởng Hồ Chí Minh 2. Đối tượng nghiên cứu 3. Phương pháp nghiên cứu 4. Ý nghĩa học tập môn học tư tưởng Hồ Chí Minh | [1] Chương 1 [2] Chương 1 [4] | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo, slide bài giảng, quy định thi, kiểm tra, đánh giá, hướng dẫn kế hoạch học tập; xây dựng các nhóm học tập. - Giảng lý thuyết bài 1. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Yêu cầu sinh viên xem lại kiến thức các học phần tiên quyết. - Phân nhóm thảo luận và đưa ra các nội dung, yêu cầu thảo luận dành cho seminar 1. Sinh viên - Xem trước đề cương - Đọc các tài liệu - Xem lại các kiến thức của học phần tiên quyết. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n2 | Seminar 1 - Tóm tắt kiến thức chương 1. - Thảo luận về phương pháp tiếp cận cũng như các nội dung chủ yếu của Chương 1. | [1] Chương 1 [2] Chương 1 [4] | Giảng viên - Tóm tắt kiến thức chương 1. - Chủ trì thảo luận nhóm. - Tổng kết, đánh giá và gợi mở những kiến thức cần tiếp tục nghiên cứu. Sinh viên: - Đọc tài liệu trước. - Tham gia thảo luận xung quanh các kiến thức cơ bản của Chương 1. | - Điểm danh - Trả lời câu hỏi trong  nội dung của seminar 1 - Mức độ hoàn thành các bài tập trên lớp - Phụ lục 2, rubrics 1 | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n3 | Lecture 2 Chương 2: Cơ sở, quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh 1. Cơ sở hình thành tư tưởng Hồ Chí Minh 2. Quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh | [1] Chương 2 [2] Chương 2 [4] | Giảng viên - Giảng lý thuyết theo nội dung bài giảng/Slide chương 2 - Hướng dẫn sinh viên đọc giáo trình, tài liệu tham khảo. - Yêu cầu sinh viên đọc trước tài liệu chuẩn bị các câu hỏi thảo luận cho buổi seminar 2 Sinh viên Đọc trước các nội dung bài giảng chương 2 trong tài liệu [1] và [2] và chuẩn bị câu hỏi và các nội dung thảo luận cho buổi seminar 2. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n4 | Seminar 2 - Tóm tắt kiến thức chương 2, mục 1,2. - Các nhóm trình bày các chủ đề được phân công. | [1] Chương 2 [2] Chương 2 [4] | Giảng viên - Tóm tắt kiến thức chương 2 mục 1, 2. - Hướng dẫn thảo luận về các nội dung chủ yếu trong mục 1, 2 chương 2. + Các nội dung chính cần thảo luận. + Các vấn đề, tình huống đặt ra cần phân tích, làm rõ. + Tổng kết, gợi mở các vấn đề cần tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước - Tham gia thảo luận. - Trả lời các câu hỏi và đưa ra các câu hỏi, các vấn đề, tình huống cần được tiếp tục là rõ. | - Điểm danh. - Trình bày về chủ đề nhóm. - Thảo luận, trả lời câu hỏi và đưa ra các câu hỏi, vấn đề cần được tiếp tục làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n5 | Lecture 3 Chương 2: Cơ sở, quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh 3. Giá trị tư tưởng Hồ Chí Minh Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 1. Tư tưởng Hồ Chí Minh về độc lập dân tộc | [1] Chương 2, Chương 3 [2] Chương 2, Chương 3 [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 2, 3. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 3. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống dành cho buổi seminar 3. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n6 | Seminar 3 - Tóm tắt kiến thức chương 2, mục 3; chương 3, mục 1. - Các nhóm trình bày các chủ đề được phân công. | [1] Chương 2, Chương 3 [2] Chương 2, Chương 3 [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 2, mục 3 và chương 3, mục 1. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n7 | Lecture 4 Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 2. Tư tưởng Hồ Chí Minh về chủ nghĩa xã hội 3. Tư tưởng Hồ Chí Minh về mối quan hệ giữa độc lập dân tộc và chủ nghĩa xã hội | [1] Chương 3 [2] Chương 3 [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 3, mục 2,3. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 3. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 4. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n8 | Seminar 4 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. - Giao bài tập cá nhân giữa kỳ | [1] Chương 3 [2] Chương 3 [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 3, mục 2,3. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. - Hướng dẫn làm bài tập cá nhân giữa kỳ; yêu cầu về hình thức và nội dung, thời hạn nộp bài. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n9 | Lecture 5 Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 4. Vận dụng tư tưởng Hồ Chí Minh về độc lập dân tộc gắn liền với chủ nghĩa xã hội trong sự nghiệp cách mạng Việt Nam trong giai đoạn hiện nay Chương 4: Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam và Nhà nước của nhân dân, do nhân dân, vì nhân dân 1. Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam | [1] Chương 3,4 [2] Chương 3,4 [3], [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 3, mục 4; chương 4, mục 1. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 5. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 5. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n10 | Seminar 5 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 3,4 [2] Chương 3,4 [3], [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản đã học. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n- | Lecture 6 Chương 4: Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam và Nhà nước của nhân dân, do nhân dân, vì nhân dân 1. Tư tưởng Hồ Chí Minh về Nhà nước của nhân dân, do nhân dân, vì nhân dân 2. Vận dụng tư tưởng Hồ Chí Minh vào công tác xây dựng Đảng và xây dựng Nhà nước | [1] Chương 4 [2] Chương 4 [3], [4] | - | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n11 | Seminar 6 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 4 [2] Chương 4 [3], [4] | Giảng viên - Nhắc lại các kiến thức cơ bản đã học. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n12 | Lecture 7 Chương 5: tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế 1. Tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc 2. Tư tưởng Hồ Chí Minh về đoàn kết quốc tế 3. Vận dụng tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế trong giai đoạn hiện nay | [1] Chương 5 [2] Chương 5 [4], [5] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 5. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 6. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 6. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n13 | Seminar 7 - Tóm tắt kiến thức chương 5. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 5 [2] Chương 5 [4], [5] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 5. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. - Thu Bài tập cá nhân giữa kỳ. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. - Nộp Bài tập cá nhân giữa kỳ. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n14 | Lecture 8 Chương 6: Tư tưởng Hồ Chí Minh về văn hoá, đạo đức, con người 1 Tư tưởng Hồ Chí Minh về văn hoá 2. Tư tưởng Hồ Chí Minh về đạo đức 3. Tư tưởng Hồ Chí Minh về con người 4. Xây dựng văn hoá, đạo đức, con người Việt Nam hiện nay theo tư tưởng Hồ Chí Minh | [1] Chương 5 [2] Chương 5 [4], [7] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 6. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 7. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 7. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n15 | Seminar 7 - Tóm tắt kiến thức chương 5. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 5 [2] Chương 5 [4], [7] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 5. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu chương 6. - Khái quát các kiến thức chủ yếu, các vấn đề có tính hệ thống và tính tương quang giữa các khối kiến thức môn học, cần nghiên cứu, ôn tập. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\nLịch thi | Thi cuối kỳ | … (Toàn bộ / Các bài nào, chương nào…) | Thi trắc nghiệm khách quan trên máy | Xem Phụ lục 1: ma trận đề thi | -",
      "word_count": 2523,
      "char_count": 11058,
      "heading_path": [
        "8. KẾ HOẠCH GIẢNG DẠY (LESSON PLAN)"
      ],
      "primary_heading": "8. KẾ HOẠCH GIẢNG DẠY (LESSON PLAN)",
      "breadcrumbs": "8. KẾ HOẠCH GIẢNG DẠY (LESSON PLAN)",
      "position": {
        "order": 12,
        "start_block": 48,
        "end_block": 49
      }
    },
    {
      "chunk_id": "vi-lltt1101#013",
      "text": "Hệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.",
      "word_count": 40,
      "char_count": 182,
      "heading_path": [
        "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)"
      ],
      "primary_heading": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)",
      "breadcrumbs": "9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)",
      "position": {
        "order": 13,
        "start_block": 54,
        "end_block": 55
      }
    },
    {
      "chunk_id": "vi-lltt1101#014",
      "text": "- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.",
      "word_count": 28,
      "char_count": 126,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.1. Quy định về điều kiện thi kết thúc học phần"
      ],
      "primary_heading": "10.1. Quy định về điều kiện thi kết thúc học phần",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.1. Quy định về điều kiện thi kết thúc học phần",
      "position": {
        "order": 14,
        "start_block": 57,
        "end_block": 59
      }
    },
    {
      "chunk_id": "vi-lltt1101#015",
      "text": "- Sinh viên/học viên có trách nhiệm tham dự đầy đủ các buổi học. Trong trường hợp nghỉ học do lý do bất khả kháng thì phải có giấy tờ chứng minh đầy đủ và hợp lý.\n- Sinh viên có trách nhiệm chủ động nghiên cứu tài liệu, chủ động chuẩn bị bài học trước khi đến lớp theo hướng dẫn và yêu cầu của giảng viên\n- Sinh viên vắng quá 20% tổng số buổi học của học phần sẽ bị coi như không hoàn thành khóa học và phải đăng ký học lại.\n- Sinh viên nộp bài tập cá nhân muộn so với thời gian quy định của giảng viên sẽ nhận điểm 0 của bài tập đó.\n- Về trao đổi giữa giảng viên và sinh viên: Khuyến khích sinh viên tham gia thảo luận, phản hồi trực tiếp với giảng viên về nội dung học phần, phương pháp dạy và học, tài liệu giảng dạy và đọc. Giảng viên khuyến khích sinh viên phản hồi về hình thức, phương pháp và nội dung kiểm tra, đánh giá kết quả học tập của sinh viên. Sinh viên có thể giao trao đổi với giảng viên trên lớp, trong giờ hành chính hoặc qua email. Những thông tin phản hồi của sinh viên có giá trị góp phần nâng cao chất lượng dạy và học của học phần.",
      "word_count": 232,
      "char_count": 1055,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.2. Quy định về tham dự lớp học"
      ],
      "primary_heading": "10.2. Quy định về tham dự lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.2. Quy định về tham dự lớp học",
      "position": {
        "order": 15,
        "start_block": 60,
        "end_block": 64
      }
    },
    {
      "chunk_id": "vi-lltt1101#016",
      "text": "- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người dạy. Mọi hành vi làm ảnh hưởng đến quá trình dạy và học đều bị nghiêm cấm.\n- Ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Đọc trước tài liệu được yêu cầu;\n- Làm các bài tập về nhà;\n- Tuyệt đối không làm ồn, gây ảnh hưởng đến người khác trong quá trình học.\n- Tuyệt đối không được ăn uống, nhai kẹo cao su, sử dụng các thiết bị như điện thoại, máy nghe nhạc trong giờ học.\n- Máy tính xách tay, máy tính bảng chỉ được thực hiện vào mục đích ghi chép bài giảng, tính toán phục vụ bài giảng, bài tập, tuyệt đối không dùng vào việc khác.",
      "word_count": 133,
      "char_count": 603,
      "heading_path": [
        "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)",
        "10.3. Quy định về hành vi lớp học"
      ],
      "primary_heading": "10.3. Quy định về hành vi lớp học",
      "breadcrumbs": "10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation) > 10.3. Quy định về hành vi lớp học",
      "position": {
        "order": 16,
        "start_block": 66,
        "end_block": 73
      }
    },
    {
      "chunk_id": "vi-lltt1101#017",
      "text": "Tháng  6  năm 2024\nTRƯỞNG KHOA | HIỆU TRƯỞNG\nTS Nguyễn Thị Hoàn | GS.TS Phạm Hồng Chương",
      "word_count": 18,
      "char_count": 88,
      "heading_path": [
        "11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)"
      ],
      "primary_heading": "11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)",
      "breadcrumbs": "11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)",
      "position": {
        "order": 17,
        "start_block": 74,
        "end_block": 76
      }
    },
    {
      "chunk_id": "vi-lltt1101#018",
      "text": "- Trọng số trong điểm học phần: 50%\n- Hình thức: Thi trắc nghiệm khách quan trên máy tính\n- Thời gian: 50 phút\n- Số câu hỏi: 80 câu. Mỗi câu 0,125  điểm\nBài | CLO | Nhớ | Hiểu | Vận dụng | Tổng\nLecture 1 | 1.1, 2.1 | 4 | - | - | 4\nLecture 2 | 1.2, 1.3 | 6 | 8 | 2 | 16\nLecture 3 | 1.4, 2.4 | 10 | 8 | 4 | 22\nLecture 4 | 1.1, 2.1 | 3 | 2 | 1 | 6\nLecture 5 | 1.5, 2.5 | 5 | 5 | 2 | 12\nLecture 6 | 1.2, 3.3 | 5 | 5 | 2 | 12\nCâu hỏi tổng hợp | 3.1, 3.2, 3.4 | - | 6 | 2 | 8\nTổng số câu | Tổng số câu | 33 | 34 | 13 | 80\nTỷ lrọng | Tỷ lrọng | 40% | 40% | 20% | 100%",
      "word_count": 168,
      "char_count": 560,
      "heading_path": [
        "Phụ lục",
        "Phụ lục 1. MA TRẬN ĐỀ THI"
      ],
      "primary_heading": "Phụ lục 1. MA TRẬN ĐỀ THI",
      "breadcrumbs": "Phụ lục > Phụ lục 1. MA TRẬN ĐỀ THI",
      "position": {
        "order": 18,
        "start_block": 78,
        "end_block": 83
      }
    },
    {
      "chunk_id": "vi-lltt1101#019",
      "text": "Rubric 1: Chuyên cần/Participant\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nSố buổi có mặt trên lớp | 50% | 15 buổi | 14 buổi | 13 buổi | 12 buổi\nThái độ học tập trên lớp | 30% | Nghiêm túc, chấp hành kỷ luật lớp học  giữ trật tự | Bị nhắc nhở 1 lần | Bị nhắc từ 2 lần | Bị nhắc nhở nhiều lần\nTích cực xây dựng bài | 20% | Trả lời đúng nhiều câu hỏi | Trả lời đúng một câu hỏi | Có tham gia thảo luận | Không tham gia thảo luận\nRubric 2: Bài tập nhóm",
      "word_count": 143,
      "char_count": 625,
      "heading_path": [
        "Phụ lục",
        "Phụ lục 2. Các rubric"
      ],
      "primary_heading": "Phụ lục 2. Các rubric",
      "breadcrumbs": "Phụ lục > Phụ lục 2. Các rubric",
      "position": {
        "order": 19,
        "start_block": 86,
        "end_block": 97
      }
    },
    {
      "chunk_id": "vi-lltt1101#020",
      "text": "Các đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nNội dung bài tập nhóm đúng yêu cầu của đề bài | 30% | Đầy đủ nội dung, có sáng tạo | Đầy đủ nội dung | Đầy đủ nội dung | Chưa đầy đủ\nKỹ  năng Thuyết trình | 30% | Có kịch bản hay, thuyết trình lưu loát | Có kịch bản, thuyết trình tốt | Thuyết trình đạt yêu cầu | Không đạt yêu cầu\nTrả lời các câu hỏi của các nhóm | 20% | Trả lời đúng trên 5 câu hỏi | Trả lời đúng từ 1 đến 4 câu hỏi | Có tham gia trả lời câu hỏi, nhưng không trả lời đúng | Không trả lời câu hỏi nào.\nTrả lời các câu hỏi của giáo viên | 20% | Trả lời đúng trên 5 câu hỏi | Trả lời đúng từ 1 đến 4 câu hỏi | Có tham gia trả lời câu hỏi, nhưng không trả lời đúng | Không trả lời câu hỏi nào.",
      "word_count": 207,
      "char_count": 875,
      "heading_path": [
        "Phụ lục",
        "Phụ lục 2. Các rubric"
      ],
      "primary_heading": "Phụ lục 2. Các rubric",
      "breadcrumbs": "Phụ lục > Phụ lục 2. Các rubric",
      "position": {
        "order": 20,
        "start_block": 97,
        "end_block": 97
      }
    },
    {
      "chunk_id": "vi-lltt1101#021",
      "text": "Rubric 3 : Bài tập cá nhân\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nNộp đúng thời hạn quy định | 10% | Nộp đúng thời gian quy đinh | Nộp không đúng hạn 1 ngày | Nộp không đúng hạn 3 ngày | Nộp không đúng hạn 5 ngày\nHệ thống được những vấn đề lý luận | 20% | Luận giải đầy đủ cơ sở lý luận | Luận giải được ¾ cơ sở lý luận | Luận giải được ½  cơ sở lý luận | Không liên hệ được\nKhảo sát thực trạng (hoặc liên hệ thực tế) | 30% | Số liệu cập nhật, khảo sát đấy đủ thực trạng, có phân tích kỹ | Số liệu tương đối cập nhật, phân tích khái quát | Số liệu cũ, khảo sát liệt kê, chưa phân tích sâu | Khảo sát sơ sài\nĐề xuất được một số giải pháp | 30% | Các giải pháp hay, có tính khả thi | Các giải pháp tương đối khả thi | Giải pháp sơ sài | Không đưa ra được giải pháp\nHình thức trình bày đúng quy cách, không có lỗi chính tả | 5% | Nộp đúng thời gian quy đinh | Nộp không đúng hạn 1 ngày | Nộp không đúng hạn 3 ngày | Nộp không đúng hạn 5 ngày",
      "word_count": 262,
      "char_count": 1117,
      "heading_path": [
        "Phụ lục",
        "Phụ lục 2. Các rubric"
      ],
      "primary_heading": "Phụ lục 2. Các rubric",
      "breadcrumbs": "Phụ lục > Phụ lục 2. Các rubric",
      "position": {
        "order": 21,
        "start_block": 99,
        "end_block": 100
      }
    },
    {
      "chunk_id": "vi-lltt1101#022",
      "text": "Rubric 4 : Bài thi cuối kỳ\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nTrình bày những kiến thức của nội dung được hỏi | 40% | Trình bày đầy đủ những kiến thức của nội dung được hỏi | Trình bày được ¾ những kiến thức của nội dung được hỏi | Trình bày được ½  những kiến thức của nội dung được hỏi | Trình bày được ít hơn 1/3 những kiến thức của nội dung được hỏi\nBiết kết hợp cùng với những kiến thức khác có liên quan để luận giải vấn đề dưới giác độ lý luận và thực tiễn | 30% | Luận giải đầy đủ cơ sở lý luận có gắn với thực tiễn | Luận giải được ¾ cơ sở lý luận có gắn với thực tiễn | Luận giải được ½  cơ sở lý luận có gắn với thực tiễn | Không luận giải được\nĐảm bảo tập trung nhất quán, không lạc đề | 30% | Có phân tích logic, không lạc đề | Không lạc đề | Không tập trung nhất quán | Lạc đề",
      "word_count": 222,
      "char_count": 973,
      "heading_path": [
        "Phụ lục",
        "Phụ lục 2. Các rubric"
      ],
      "primary_heading": "Phụ lục 2. Các rubric",
      "breadcrumbs": "Phụ lục > Phụ lục 2. Các rubric",
      "position": {
        "order": 22,
        "start_block": 101,
        "end_block": 103
      }
    }
  ],
  "full_text": "BỘ GIÁO DỤC VÀ ĐÀO TẠO TRƯỜNG ĐẠI HỌC KINH TẾ QUỐC DÂN | CỘNG HÒA XÃ HỘI CHỦ NGHĨA VIỆT NAM Độc lập – Tự do – Hạnh phúc\nĐỀ CƯƠNG CHI TIẾT HỌC PHẦN (Detailed Course Syllabus) | ĐỀ CƯƠNG CHI TIẾT HỌC PHẦN (Detailed Course Syllabus)\n(Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024) | (Ban hành kèm theo Quyết định số 628 QĐ/ĐHKTQD ngày 18 tháng 6 năm 2024)\n1. THÔNG TIN TỔNG QUÁT (GENERAL INFORMATION)\n- Tên học phần (tiếng Việt): | Tư tưởng Hồ Chí Minh\n- Tên học phần (tiếng Anh) | Ho Chi Minh Ideology\n- Mã số học phần | LLTT1101\n- Thuộc khối kiến thức | Kiến thức giáo dục đại cương\n- Số tín chỉ | 02\n+ Số giờ trên lớp | 30\n+ Số giờ tự học | 60\n- Các học phần tiên quyết | Triết học Mác - Lênin, Kinh tế chính trị Mác-Lênin, Chủ nghĩa xã hội khoa học\n2. KHOA/VIỆN QUẢN LÝ VÀ GIẢNG VIÊN GIẢNG DẠY\nKhoa/viện quản lý học phần: Khoa Lý luận chính trị\nĐịa chỉ: Phòng 1015 Nhà A1, Trường ĐH Kinh tế Quốc dân\nGiảng viên giảng dạy:\nTT | Họ và tên | Số điện thoại | Email\n1 | TS.GVC. Nguyễn Hồng Sơn | 0912212302 | sonnh@neu.edu.vn\n2 | TS.GVC. Nguyễn Thị Bích Thủy | 0977827782 | thuyntb@neu.edu.vn\n3 | TS.GVC. Nguyễn Chí Thiện | 0913059808 | thiennc@neu.edu.vn\n4 | TS.GVC. Lê Thị Hoa | 0912139918 | hoalt@neu.edu.vn\n5 | TS.GVC. Nguyễn Quang Trung | 0911133533 | trungnqml@neu.edu.vn\n6 | TS.GVC. Nguyễn Thùy Linh | 0916251915 | linhnt@neu.edu.vn\n3. MÔ TẢ HỌC PHẦN (COURSE DESCRIPTIONS)\n- Học phần gồm 6 chương, trang bị cho sinh viên những kiến thức cơ bản về nguồn gốc, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh; Những nội dung cơ bản về tư tưởng Hồ Chí Minh; Sự vận dụng tư tưởng Hồ Chí Minh của Đảng cộng sản Việt Nam trong sự nghiệp cách mạng.\n- Hình thành cho sinh viên khả năng tư duy độc lập, phân tích, đánh giá, vận dụng sáng tạo tư tưởng Hồ Chí Minh vào giải quyết các vấn đề trong thực tiễn đời sống, học tập và công tác.\n- Giúp sinh viên củng cố lập trường cách mạng, kiên định mục tiêu lý tưởng độc lập dân tộc gắn liền với chu nghĩa xã hội; Góp phần giáo dục đạo đức, tư cách, phẩm chất cách mạng, đóng góp thiết thực và hiệu quả cho sự nghiệp cách mạng.\nNội dung chính\n- Khái niệm, đối tượng, phương pháp nghiên cứu và ý nghĩa học tập môn tư tưởng Hồ Chí Minh.\n- Cơ sở, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh.\n- Tư tưởng Hồ Chí Minh về dân tộc và chủ nghĩa xã hội.\n- Tư tưởng Hồ Chí Minh về Đảng cộng sản và Nhà nước của nhân dân, do nhân dân, vì nhân dân.\n- Tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế.\n- Tư tưởng Hồ Chí Minh về văn hoá, đạo đức và con người.\n4. TÀI LIỆU HỌC TẬP (LEARNING RESOURCES: COURSE BOOKS, REFERENCE BOOKS, AND SOFTWARES)\nGiáo trình\n[1] Bộ Giáo dục và Đào tạo (2021), Giáo trình Tư tưởng Hồ Chí Minh, NXB Chính trị Quốc gia Sự thật, Hà Nội\nTài liệu tham khảo\n[2] Slide Bài giảng tư tưởng Hồ Chí Minh chuẩn do nhóm giảng viên tư tưởng Hồ Chí Minh – Khoa Lý luận Chính trị, Đại học KTQD biên soạn.\n[3]. Phạm Ngọc Anh – Bùi Đình Phong (2003), Tư tưởng Hồ Chí Minh về xây dựng Nhà nước pháp quyền kiểu mới ở Việt Nam, Nxb Lao động, Hà Nội.\n[4]. Hồ Chí Minh (2011), Toàn tập, tập 1 -15, Nxb Chính trị Quốc gia, Hà Nội.\n[5]. Học viện chính trị quốc gia Hồ Chí Minh – Viện Hồ Chí Minh và các lãnh tụ của Đảng (2004), Tư tưởng Hồ Chí Minh về đại đoàn kết với vấn đề phát huy sức mạnh đại đoàn kết dân tộc trong thời kỳ mới, Nxb Chính trị Quốc gia, Hà Nội.\n[6]. Nguyễn Bá Linh (2009), Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội, Nxb Chính trị Quốc gia, Hà Nội.\n[7]. Đặng Xuân Kỳ (chủ biên) (2005), Tư tưởng Hồ Chí Minh về xây dựng con người và phát triển văn hóa, Nxb Chính trị Quốc gia, Hà Nội.\n5. MỤC TIÊU HỌC PHẦN (COURSE GOALS)\nBảng 5.1. Mục tiêu học phần\nMã/Code (CGx) | Mô tả mục tiêu học phần (CG) | CĐR (PLO) của CTĐT*\n[1] | [2] | [3]\nCG1 | - Sinh viên hiểu được đối tượng, phương pháp nghiên cứu, ý nghĩa học tập của môn học Tư tưởng Hồ Chí Minh. - Sinh viên hiểu được cơ sở lý luận và thực tiễn đối với sự hình thành tư tưởng Hồ Chí Minh; nhận thức được các giai đoạn phát triển chủ yếu của tư tưởng Hồ Chí Minh gắn với thực tiễn cách mạng Việt Nam. - Nhận thức được tính khoa học, cách mạng và tính sáng tạo của Hồ Chí Minh trong việc vận dụng những nguyên lý Macxit vào thực tiễn cách mạng; đồng thời thấy rõ vai trò, ý nghĩa to lớn của tư tưởng Hồ Chí Minh đối với cách mạng Việt Nam và cách mạng thế giới. | PLO1.1.2 PLO1.2.2 PLO1.2.3\nCG2 | - Có kỹ năng vận dụng, liên hệ những nội dung cơ bản trong tư tưởng Hồ Chí Minh vào thực tiễn đổi mới ở Việt Nam hiện nay. - Sinh viên hình thành năng lực tư duy khoa học; có kỹ năng nhận thức và giải quyết đúng đắn cả về mặt lý luận và thực tiễn các vấn đề đặt ra trong cuộc sống. - Xây dựng và củng cố niềm tin vào chế độ xã hội chủ nghĩa, tiếp thêm sức mạnh về ý chí và hành động phấn đấu cho lý tưởng cách mạng. | PLO2.1.1\nG3 | Từng bước xây dựng, rèn luyện phương pháp và phong cách tư duy, phong cách làm việc khoa học, tự chủ, đổi mới và sáng tạo. | PLO3.1.1\n6. CHUẨN ĐẦU RA HỌC PHẦN (COURSE LEARNING OUTCOMES)\nBảng 6.1. Chuẩn đầu ra học phần (CLO)\nMục tiêu HP | CLOs | Mô tả CLOs* | Mức độ đạt được\n[1] | [2] | [3] | [4]\nG1 | CLO1.1 | Giúp cho người học hiểu được cơ sở, quá trình hình thành và phát triển tư tưởng Hồ Chí Minh; thấy rõ cuộc đời sự nghiệp cách mạng cao cả, vĩ đại của Hồ Chí Minh gắn với thực tiễn cách mạng Việt Nam qua các thời kỳ lịch sử. | 2\nG1 | CLO1.2 | Giúp cho người học hiểu rõ những nội dung cơ bản trong tư tưởng Hồ Chí Minh; nhận thức được bản chất khoa học cách mạng, tính hệ thống, toàn diện trong tư tưởng Hồ Chí Minh về cách mạng Việt Nam. | 2\nG1 | CLO1.3 | Giúp cho người học hiểu rõ vai trò của Hồ Chí Minh trong việc vận dụng và phát triển sáng tạo chủ nghĩa Mác - Lênin, kế thừa những giá trị truyền thống tốt đẹp của dân tộc và tinh hoa văn hóa, văn minh của nhân loại, xây dựng đường lối, chiến lược phù hợp, sáng tạo, đưa cách mạng Việt Nam đi tới thắng lợi, góp phần quan trọng vào tiến trình cách mạng thế giới. | 3\nG2 | CLO2.1 | Có kỹ năng vận dụng tư tưởng Hồ Chí Minh về độc lập dân tộc gắn liền với chủ nghĩa xã hội; về đoàn kết dân tộc, đoàn kết quốc tế, văn hóa, đạo đức, con người trong phân tích sự nghiệp đổi mới đất nước hiện nay. | 3\nG2 | CLO2.2 | Có kỹ năng phân tích, liên hệ tư tưởng Hồ Chí Minh về Đảng, Nhà nước với thực tiễn xây dựng Đảng và Nhà nước pháp quyền xã hội chủ nghĩa của dân, do dân, vì dân ở Việt Nam hiện nay. | 3\nG3 | CLO3.1 | Giúp cho người học nâng cao năng lực tư duy lý luận; nâng cao bản lĩnh chính trị, ý thức và trách nhiệm công dân, thường xuyên tu dưỡng và rèn luyện theo tư tưởng, đạo đức và phong cách Hồ Chí Minh. | 3\nG3 | CLO3.2 | Góp phần giúp người học hình thành phương pháp và kỹ năng làm việc khoa học, kỹ năng phát hiện và giải quyết vấn đề; kỹ năng thuyết trình, phản biện, phát huy tính tự chủ, sáng tạo của mỗi cá nhân và tính liên kết cộng đồng trong học tập, nghiên cứu khoa học. | 3\n- | CLO3.3 | Có tinh thần trách nhiệm cao, có kỹ năng ứng xử chuyên nghiệp đáp ứng yêu cầu đổi mới, công nghiệp hóa, hiện đại hóa và hội nhập quốc tế hiện nay. | 3\n7. ĐÁNH GIÁ HỌC PHẦN (COURSE ASSESSMENT)\nBảng 7.1. Đánh giá học phần\nHình thức đánh giá | Nội dung/ \nBài đánh giá | Thời điểm | CLOs | Tiêu chí đánh giá* | Tỷ lệ (%)\n[1] | [2] | [3] | [4] | [5] | [6]\nChuyên cần | Tham gia lớp seminar Tham gia thảo luận các buổi seminar | Các buổi seminar | 3.1 3.2 | - Điểm danh - Trả lời câu hỏi, thảo luận trên lớp - Mức độ hoàn thành đúng hạn các bài tập các nhân/ nhóm Phụ lục 2, rubrics 1 | 10%\nĐánh giá giữa kỳ lần 1 | Bài tập nhóm Nhóm 5-6 sinh viên Chủ đề: Giáo viên lớp seminar cung cấp Nhóm xây dựng đề cương, nghiên cứu, viết báo cáo theo quy định Bài tập lớn được giáo viên lớp seminar quy định. Kết quả là một bài viết khoảng từ 8 đến 12 trang (không bắt buộc thuyết trình) | Nộp bản cuối | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | Mức độ hoàn thành bài tập nhóm (đúng thời gian, chất lượng gắn với mức độ đạt được kiến thức, kỹ năng theo yêu cầu của chuẩn đầu ra học phần Phụ lục 2, rubrics 2 | 20%\nĐánh giá giữa kỳ lần 2: Bài tập cá nhân | Sinh viên làm Bài tập cá nhân do giáo viên giao chủ đề. Quy cách, thể lệ do giảng viên quy định. Số lượng trang từ 6-8 trang. | Thời gian làm bài tập do giảng viên seminar quyết định | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | Bài tập đáp ứng yêu cầu đánh giá kiến thức cơ bản và kiến thức vận dụng | 20%\nĐánh giá cuối kỳ | Đánh giá toàn bộ kiến thức môn học. | Theo lịch thi của Trường | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2 CLO3.3 | - Trắc nghiệm khách quan trên máy. Thời gian làm bài 50 phút/80 câu. - Xem phụ lục 1: Ma trận đề thi. | 50%\n- Ma trận đề thi (phụ lục 1)\n- Các rubrics (phụ lục 2)\n8. KẾ HOẠCH GIẢNG DẠY (LESSON PLAN)\nBảng 8.1. Kế hoạch và nội dung giảng dạy\nTuần | Nội dung | Tài liệu đọc | Hoạt động dạy và học | Đánh giá | CLOs\n[1] | [2] | [3] | [4] | [5] | [6]\n1 | Lecture 1. Chương 1: Khái niệm, đối tượng, phương pháp nghiên cứu và ý nghĩa học tập môn tư tưởng Hồ Chí Minh 1. Khái niệm tư tưởng Hồ Chí Minh 2. Đối tượng nghiên cứu 3. Phương pháp nghiên cứu 4. Ý nghĩa học tập môn học tư tưởng Hồ Chí Minh | [1] Chương 1 [2] Chương 1 [4] | Giảng viên - Giới thiệu đề cương, giáo trình, tài liệu tham khảo, slide bài giảng, quy định thi, kiểm tra, đánh giá, hướng dẫn kế hoạch học tập; xây dựng các nhóm học tập. - Giảng lý thuyết bài 1. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Yêu cầu sinh viên xem lại kiến thức các học phần tiên quyết. - Phân nhóm thảo luận và đưa ra các nội dung, yêu cầu thảo luận dành cho seminar 1. Sinh viên - Xem trước đề cương - Đọc các tài liệu - Xem lại các kiến thức của học phần tiên quyết. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n2 | Seminar 1 - Tóm tắt kiến thức chương 1. - Thảo luận về phương pháp tiếp cận cũng như các nội dung chủ yếu của Chương 1. | [1] Chương 1 [2] Chương 1 [4] | Giảng viên - Tóm tắt kiến thức chương 1. - Chủ trì thảo luận nhóm. - Tổng kết, đánh giá và gợi mở những kiến thức cần tiếp tục nghiên cứu. Sinh viên: - Đọc tài liệu trước. - Tham gia thảo luận xung quanh các kiến thức cơ bản của Chương 1. | - Điểm danh - Trả lời câu hỏi trong  nội dung của seminar 1 - Mức độ hoàn thành các bài tập trên lớp - Phụ lục 2, rubrics 1 | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n3 | Lecture 2 Chương 2: Cơ sở, quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh 1. Cơ sở hình thành tư tưởng Hồ Chí Minh 2. Quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh | [1] Chương 2 [2] Chương 2 [4] | Giảng viên - Giảng lý thuyết theo nội dung bài giảng/Slide chương 2 - Hướng dẫn sinh viên đọc giáo trình, tài liệu tham khảo. - Yêu cầu sinh viên đọc trước tài liệu chuẩn bị các câu hỏi thảo luận cho buổi seminar 2 Sinh viên Đọc trước các nội dung bài giảng chương 2 trong tài liệu [1] và [2] và chuẩn bị câu hỏi và các nội dung thảo luận cho buổi seminar 2. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n4 | Seminar 2 - Tóm tắt kiến thức chương 2, mục 1,2. - Các nhóm trình bày các chủ đề được phân công. | [1] Chương 2 [2] Chương 2 [4] | Giảng viên - Tóm tắt kiến thức chương 2 mục 1, 2. - Hướng dẫn thảo luận về các nội dung chủ yếu trong mục 1, 2 chương 2. + Các nội dung chính cần thảo luận. + Các vấn đề, tình huống đặt ra cần phân tích, làm rõ. + Tổng kết, gợi mở các vấn đề cần tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước - Tham gia thảo luận. - Trả lời các câu hỏi và đưa ra các câu hỏi, các vấn đề, tình huống cần được tiếp tục là rõ. | - Điểm danh. - Trình bày về chủ đề nhóm. - Thảo luận, trả lời câu hỏi và đưa ra các câu hỏi, vấn đề cần được tiếp tục làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n5 | Lecture 3 Chương 2: Cơ sở, quá trình hình thành và phát triển của tư tưởng Hồ Chí Minh 3. Giá trị tư tưởng Hồ Chí Minh Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 1. Tư tưởng Hồ Chí Minh về độc lập dân tộc | [1] Chương 2, Chương 3 [2] Chương 2, Chương 3 [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 2, 3. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 3. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống dành cho buổi seminar 3. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n6 | Seminar 3 - Tóm tắt kiến thức chương 2, mục 3; chương 3, mục 1. - Các nhóm trình bày các chủ đề được phân công. | [1] Chương 2, Chương 3 [2] Chương 2, Chương 3 [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 2, mục 3 và chương 3, mục 1. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n7 | Lecture 4 Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 2. Tư tưởng Hồ Chí Minh về chủ nghĩa xã hội 3. Tư tưởng Hồ Chí Minh về mối quan hệ giữa độc lập dân tộc và chủ nghĩa xã hội | [1] Chương 3 [2] Chương 3 [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 3, mục 2,3. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 3. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 4. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n8 | Seminar 4 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. - Giao bài tập cá nhân giữa kỳ | [1] Chương 3 [2] Chương 3 [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 3, mục 2,3. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. - Hướng dẫn làm bài tập cá nhân giữa kỳ; yêu cầu về hình thức và nội dung, thời hạn nộp bài. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n9 | Lecture 5 Chương 3: Tư tưởng Hồ Chí Minh về độc lập dân tộc và chủ nghĩa xã hội 4. Vận dụng tư tưởng Hồ Chí Minh về độc lập dân tộc gắn liền với chủ nghĩa xã hội trong sự nghiệp cách mạng Việt Nam trong giai đoạn hiện nay Chương 4: Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam và Nhà nước của nhân dân, do nhân dân, vì nhân dân 1. Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam | [1] Chương 3,4 [2] Chương 3,4 [3], [4], [6] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 3, mục 4; chương 4, mục 1. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 5. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 5. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n10 | Seminar 5 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 3,4 [2] Chương 3,4 [3], [4], [6] | Giảng viên - Nhắc lại các kiến thức cơ bản đã học. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n- | Lecture 6 Chương 4: Tư tưởng Hồ Chí Minh về Đảng cộng sản Việt Nam và Nhà nước của nhân dân, do nhân dân, vì nhân dân 1. Tư tưởng Hồ Chí Minh về Nhà nước của nhân dân, do nhân dân, vì nhân dân 2. Vận dụng tư tưởng Hồ Chí Minh vào công tác xây dựng Đảng và xây dựng Nhà nước | [1] Chương 4 [2] Chương 4 [3], [4] | - | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n11 | Seminar 6 - Tóm tắt kiến thức chương 3, mục 2,3. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 4 [2] Chương 4 [3], [4] | Giảng viên - Nhắc lại các kiến thức cơ bản đã học. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n12 | Lecture 7 Chương 5: tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế 1. Tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc 2. Tư tưởng Hồ Chí Minh về đoàn kết quốc tế 3. Vận dụng tư tưởng Hồ Chí Minh về đại đoàn kết dân tộc và đoàn kết quốc tế trong giai đoạn hiện nay | [1] Chương 5 [2] Chương 5 [4], [5] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 5. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 6. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 6. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n13 | Seminar 7 - Tóm tắt kiến thức chương 5. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 5 [2] Chương 5 [4], [5] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 5. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu. - Thu Bài tập cá nhân giữa kỳ. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. - Nộp Bài tập cá nhân giữa kỳ. | - Điểm danh - Trình bày các chủ đề nhóm được phân công. - Thảo luận các chủ đề. - Trả lời câu hỏi, tình huống được đưa ra. - Đặt câu hỏi, tình huống phát sinh cần được làm rõ. | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n14 | Lecture 8 Chương 6: Tư tưởng Hồ Chí Minh về văn hoá, đạo đức, con người 1 Tư tưởng Hồ Chí Minh về văn hoá 2. Tư tưởng Hồ Chí Minh về đạo đức 3. Tư tưởng Hồ Chí Minh về con người 4. Xây dựng văn hoá, đạo đức, con người Việt Nam hiện nay theo tư tưởng Hồ Chí Minh | [1] Chương 5 [2] Chương 5 [4], [7] | - Giảng lý thuyết theo nội dung Bài giảng / slide chương 6. - Hướng dẫn đọc giáo trình, tài liệu tham khảo. - Đưa ra các chủ đề và phân công các nhóm chuẩn bị cho buổi seminar 7. - Yêu cầu sinh viên chuẩn bị kiến thức, xem trước các ví dụ, câu hỏi, tình huống thảo luận dành cho buổi seminar 7. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\n15 | Seminar 7 - Tóm tắt kiến thức chương 5. - Các nhóm trình bày các chủ đề đã được phân công. | [1] Chương 5 [2] Chương 5 [4], [7] | Giảng viên - Nhắc lại các kiến thức cơ bản chương 5. - Nêu các câu hỏi, các tình huống cần trao đổi, thảo luận. - Tổng kết, đánh giá, gợi mở các vấn đề cần được tiếp tục nghiên cứu chương 6. - Khái quát các kiến thức chủ yếu, các vấn đề có tính hệ thống và tính tương quang giữa các khối kiến thức môn học, cần nghiên cứu, ôn tập. Sinh viên - Đọc tài liệu trước. - Các nhóm tham gia thảo luận. - Trả lời và đưa ra các câu hỏi, tình huống thảo luận. | - | CLO1.1 CLO1.2 CLO1.3 CLO2.1 CLO2.2 CLO3.1 CLO3.2\nLịch thi | Thi cuối kỳ | … (Toàn bộ / Các bài nào, chương nào…) | Thi trắc nghiệm khách quan trên máy | Xem Phụ lục 1: ma trận đề thi | -\n9. ĐÁNH GIÁ CHUẨN ĐẦU RA HỌC PHẦN (Course Leaning Outcomes Assessment)\nHệ thống quản lý đào tạo tự động đánh giá mức độ đạt được CLO theo thuật toán chung của Trường. Chuẩn đầu ra của học phần được sinh viên và trường đánh giá sau thi kết thúc học phần.\n10. QUY ĐỊNH CỦA HỌC PHẦN (Course Requirements and Expectation)\n10.1. Quy định về điều kiện thi kết thúc học phần\n- Điểm chuyên cần đạt từ 5 trở lên (theo quy định chung của Trường)\n- Cách đánh giá điểm chuyên cần: xem Phụ lục 2, rubrics 1.\n10.2. Quy định về tham dự lớp học\n- Sinh viên/học viên có trách nhiệm tham dự đầy đủ các buổi học. Trong trường hợp nghỉ học do lý do bất khả kháng thì phải có giấy tờ chứng minh đầy đủ và hợp lý.\n- Sinh viên có trách nhiệm chủ động nghiên cứu tài liệu, chủ động chuẩn bị bài học trước khi đến lớp theo hướng dẫn và yêu cầu của giảng viên\n- Sinh viên vắng quá 20% tổng số buổi học của học phần sẽ bị coi như không hoàn thành khóa học và phải đăng ký học lại.\n- Sinh viên nộp bài tập cá nhân muộn so với thời gian quy định của giảng viên sẽ nhận điểm 0 của bài tập đó.\n- Về trao đổi giữa giảng viên và sinh viên: Khuyến khích sinh viên tham gia thảo luận, phản hồi trực tiếp với giảng viên về nội dung học phần, phương pháp dạy và học, tài liệu giảng dạy và đọc. Giảng viên khuyến khích sinh viên phản hồi về hình thức, phương pháp và nội dung kiểm tra, đánh giá kết quả học tập của sinh viên. Sinh viên có thể giao trao đổi với giảng viên trên lớp, trong giờ hành chính hoặc qua email. Những thông tin phản hồi của sinh viên có giá trị góp phần nâng cao chất lượng dạy và học của học phần.\n10.3. Quy định về hành vi lớp học\n- Học phần được thực hiện trên nguyên tắc tôn trọng người học và người dạy. Mọi hành vi làm ảnh hưởng đến quá trình dạy và học đều bị nghiêm cấm.\n- Ghi chép đầy đủ, tham gia trả lời câu hỏi;\n- Đọc trước tài liệu được yêu cầu;\n- Làm các bài tập về nhà;\n- Tuyệt đối không làm ồn, gây ảnh hưởng đến người khác trong quá trình học.\n- Tuyệt đối không được ăn uống, nhai kẹo cao su, sử dụng các thiết bị như điện thoại, máy nghe nhạc trong giờ học.\n- Máy tính xách tay, máy tính bảng chỉ được thực hiện vào mục đích ghi chép bài giảng, tính toán phục vụ bài giảng, bài tập, tuyệt đối không dùng vào việc khác.\n11. THỜI ĐIỂM ĐIỀU CHỈNH ĐỀ CƯƠNG (Syllabus Adjustment Time)\nTháng  6  năm 2024\nTRƯỞNG KHOA | HIỆU TRƯỞNG\nTS Nguyễn Thị Hoàn | GS.TS Phạm Hồng Chương\nPhụ lục\nPhụ lục 1. MA TRẬN ĐỀ THI\n- Trọng số trong điểm học phần: 50%\n- Hình thức: Thi trắc nghiệm khách quan trên máy tính\n- Thời gian: 50 phút\n- Số câu hỏi: 80 câu. Mỗi câu 0,125  điểm\nBài | CLO | Nhớ | Hiểu | Vận dụng | Tổng\nLecture 1 | 1.1, 2.1 | 4 | - | - | 4\nLecture 2 | 1.2, 1.3 | 6 | 8 | 2 | 16\nLecture 3 | 1.4, 2.4 | 10 | 8 | 4 | 22\nLecture 4 | 1.1, 2.1 | 3 | 2 | 1 | 6\nLecture 5 | 1.5, 2.5 | 5 | 5 | 2 | 12\nLecture 6 | 1.2, 3.3 | 5 | 5 | 2 | 12\nCâu hỏi tổng hợp | 3.1, 3.2, 3.4 | - | 6 | 2 | 8\nTổng số câu | Tổng số câu | 33 | 34 | 13 | 80\nTỷ lrọng | Tỷ lrọng | 40% | 40% | 20% | 100%\nPhụ lục 2. Các rubric\nRubric 1: Chuyên cần/Participant\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nSố buổi có mặt trên lớp | 50% | 15 buổi | 14 buổi | 13 buổi | 12 buổi\nThái độ học tập trên lớp | 30% | Nghiêm túc, chấp hành kỷ luật lớp học  giữ trật tự | Bị nhắc nhở 1 lần | Bị nhắc từ 2 lần | Bị nhắc nhở nhiều lần\nTích cực xây dựng bài | 20% | Trả lời đúng nhiều câu hỏi | Trả lời đúng một câu hỏi | Có tham gia thảo luận | Không tham gia thảo luận\nRubric 2: Bài tập nhóm\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nNội dung bài tập nhóm đúng yêu cầu của đề bài | 30% | Đầy đủ nội dung, có sáng tạo | Đầy đủ nội dung | Đầy đủ nội dung | Chưa đầy đủ\nKỹ  năng Thuyết trình | 30% | Có kịch bản hay, thuyết trình lưu loát | Có kịch bản, thuyết trình tốt | Thuyết trình đạt yêu cầu | Không đạt yêu cầu\nTrả lời các câu hỏi của các nhóm | 20% | Trả lời đúng trên 5 câu hỏi | Trả lời đúng từ 1 đến 4 câu hỏi | Có tham gia trả lời câu hỏi, nhưng không trả lời đúng | Không trả lời câu hỏi nào.\nTrả lời các câu hỏi của giáo viên | 20% | Trả lời đúng trên 5 câu hỏi | Trả lời đúng từ 1 đến 4 câu hỏi | Có tham gia trả lời câu hỏi, nhưng không trả lời đúng | Không trả lời câu hỏi nào.\nRubric 3 : Bài tập cá nhân\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nNộp đúng thời hạn quy định | 10% | Nộp đúng thời gian quy đinh | Nộp không đúng hạn 1 ngày | Nộp không đúng hạn 3 ngày | Nộp không đúng hạn 5 ngày\nHệ thống được những vấn đề lý luận | 20% | Luận giải đầy đủ cơ sở lý luận | Luận giải được ¾ cơ sở lý luận | Luận giải được ½  cơ sở lý luận | Không liên hệ được\nKhảo sát thực trạng (hoặc liên hệ thực tế) | 30% | Số liệu cập nhật, khảo sát đấy đủ thực trạng, có phân tích kỹ | Số liệu tương đối cập nhật, phân tích khái quát | Số liệu cũ, khảo sát liệt kê, chưa phân tích sâu | Khảo sát sơ sài\nĐề xuất được một số giải pháp | 30% | Các giải pháp hay, có tính khả thi | Các giải pháp tương đối khả thi | Giải pháp sơ sài | Không đưa ra được giải pháp\nHình thức trình bày đúng quy cách, không có lỗi chính tả | 5% | Nộp đúng thời gian quy đinh | Nộp không đúng hạn 1 ngày | Nộp không đúng hạn 3 ngày | Nộp không đúng hạn 5 ngày\nRubric 4 : Bài thi cuối kỳ\nCác đánh giá/Areas of assessment | Tỷ trọng/ Weighting (%) | Hoàn thành xuất sắc/ Excellence 8.5 – 10 point | Hoàn thành tốt/Good 6.5 – 8.4 point | Hoàn thành/Fair 4.0 – 6.4 point | Không hoàn thành/Poor 0 – 3.9 point\nTrình bày những kiến thức của nội dung được hỏi | 40% | Trình bày đầy đủ những kiến thức của nội dung được hỏi | Trình bày được ¾ những kiến thức của nội dung được hỏi | Trình bày được ½  những kiến thức của nội dung được hỏi | Trình bày được ít hơn 1/3 những kiến thức của nội dung được hỏi\nBiết kết hợp cùng với những kiến thức khác có liên quan để luận giải vấn đề dưới giác độ lý luận và thực tiễn | 30% | Luận giải đầy đủ cơ sở lý luận có gắn với thực tiễn | Luận giải được ¾ cơ sở lý luận có gắn với thực tiễn | Luận giải được ½  cơ sở lý luận có gắn với thực tiễn | Không luận giải được\nĐảm bảo tập trung nhất quán, không lạc đề | 30% | Có phân tích logic, không lạc đề | Không lạc đề | Không tập trung nhất quán | Lạc đề"
}