{
  "doc_id": "en-ep17-tocb1107",
  "language": "en",
  "course_name": "Discrete mathematic",
  "course_variant": "",
  "course_code": "EP17.TOCB1107",
  "source_filename": "Discrete mathematic_EP17.TOCB1107.docx",
  "source_relpath": "data\\raw\\en\\Discrete mathematic_EP17.TOCB1107.docx",
  "source_hash": "23b30ff96bc6dbd7eee184dcb0408f83",
  "source_modified": "2025-10-11T10:42:50.591753+00:00",
  "processed_at": "2025-10-12T13:02:23.877764+00:00",
  "outline": [
    {
      "sequence": 1,
      "level": 1,
      "title": "1. COURSE INFORMATION"
    },
    {
      "sequence": 2,
      "level": 1,
      "title": "2. COURSE DESCRIPTION"
    },
    {
      "sequence": 3,
      "level": 1,
      "title": "3. LEARNING RESOURCE"
    },
    {
      "sequence": 4,
      "level": 2,
      "title": "3.1. Main textbook"
    },
    {
      "sequence": 5,
      "level": 2,
      "title": "3.2. Other"
    },
    {
      "sequence": 6,
      "level": 1,
      "title": "4. COURSE GOALS"
    },
    {
      "sequence": 7,
      "level": 1,
      "title": "5. COURSE LEARNING OUTCOMES (CLOs)"
    },
    {
      "sequence": 8,
      "level": 1,
      "title": "6. COURSE ASSESSMENT"
    },
    {
      "sequence": 9,
      "level": 1,
      "title": "7. COURSE OUTLINE"
    },
    {
      "sequence": 10,
      "level": 1,
      "title": "8. LESSON PLAN"
    },
    {
      "sequence": 11,
      "level": 1,
      "title": "9. COURSE REQUIREMENT & EXPECTATION"
    },
    {
      "sequence": 12,
      "level": 2,
      "title": "9.1. Requirements for taking final /terminal exams"
    },
    {
      "sequence": 13,
      "level": 2,
      "title": "9.2. Requirements for attending classes"
    },
    {
      "sequence": 14,
      "level": 2,
      "title": "9.3. Requirements for in-class behaviour"
    }
  ],
  "stats": {
    "paragraphs": 48,
    "headings": 14,
    "tables": 11,
    "chunks": 19,
    "words": 3359
  },
  "chunks": [
    {
      "chunk_id": "en-ep17-tocb1107#001",
      "text": "MINISTRY OF EDUCATION AND TRAINING NATIONAL ECONOMICS UNIVERSITY | SOCIALIST REPUBLIC OF VIETNAM Independence – Freedom – Happiness\nCOURSE SYLLABUS (Issued with Decision number 976/QĐ-ĐHKTQD by NEU’s President dated August 30, 2023) | COURSE SYLLABUS (Issued with Decision number 976/QĐ-ĐHKTQD by NEU’s President dated August 30, 2023)\nBachelor of Software Engineering | Bachelor of Software Engineering",
      "word_count": 56,
      "char_count": 403,
      "heading_path": [],
      "primary_heading": null,
      "breadcrumbs": "",
      "position": {
        "order": 1,
        "start_block": 0,
        "end_block": 2
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#002",
      "text": "- Title: Discrete mathematic\n- Code:  EP17.TOCB1107\n- Credit hours for teaching and learning activities:\n- Lecture: 45 hrs\n- Exercises on class: 5 hrs\n- Presentation and Discussion: 3 hrs\n- Exercise and discussion: 7 hrs\n- Self-study: 90 hrs\n- Parallel course(s): None\n- Prerequisite course(s): None\n- Department conducting the course: Information Technology\n- Kind of the course:",
      "word_count": 61,
      "char_count": 380,
      "heading_path": [
        "1. COURSE INFORMATION"
      ],
      "primary_heading": "1. COURSE INFORMATION",
      "breadcrumbs": "1. COURSE INFORMATION",
      "position": {
        "order": 2,
        "start_block": 3,
        "end_block": 15
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#003",
      "text": "Foundation ✅ | Foundation ✅ | Fundamental □ | Fundamental □\nCompulsory ✅ | Elective | Compulsory □ | Elective □\n- Course language:  In English",
      "word_count": 26,
      "char_count": 142,
      "heading_path": [
        "1. COURSE INFORMATION"
      ],
      "primary_heading": "1. COURSE INFORMATION",
      "breadcrumbs": "1. COURSE INFORMATION",
      "position": {
        "order": 3,
        "start_block": 15,
        "end_block": 17
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#004",
      "text": "A Basic module of the bachelor's degree program modules is related to information technology, computer science, data science and fintech.... Discrete mathematics is a branch of Mathematics that studies discrete rather than continuous structures. The course also aims to train thinking capacity and calculation skills and improve the ability to apply mathematical knowledge to analyze and research problems in information technology. The course equips learners with the necessary knowledge, skills, and competencies to study and research related subjects in the training program and continue to higher education. At the end of the course, learners can do a graph network data analysis project.\nCourse outline:\n- Logic and Set\n- Proofs\n- Functions, Strings and Relation\n- Algorithms\n- Introduction to Number Theory\n- Counting problems and Dirichlet’s Principle\n- Graph Theory\n- Tree\nSeminar talks: The goal is to introduce state-of-the-art applications of discrete mathematics in the modern technology. Besides, invited student-speakers can be included to share about their scientific projects related to the course’s materials.\nOutcomes assessment:\n- (10%) Participant\n- (40%) Quiz + Midterm: quiz 1 (10%), quiz 2 (10%), project presentation (5%) and midterm (15%).",
      "word_count": 188,
      "char_count": 1264,
      "heading_path": [
        "2. COURSE DESCRIPTION"
      ],
      "primary_heading": "2. COURSE DESCRIPTION",
      "breadcrumbs": "2. COURSE DESCRIPTION",
      "position": {
        "order": 4,
        "start_block": 18,
        "end_block": 31
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#005",
      "text": "- (50%) Final Exam",
      "word_count": 4,
      "char_count": 18,
      "heading_path": [
        "2. COURSE DESCRIPTION"
      ],
      "primary_heading": "2. COURSE DESCRIPTION",
      "breadcrumbs": "2. COURSE DESCRIPTION",
      "position": {
        "order": 5,
        "start_block": 32,
        "end_block": 33
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#006",
      "text": "[1] Richard Johnsonbaugh (2018), Discrete Mathematics, Eighth Edition, Pearson.",
      "word_count": 9,
      "char_count": 79,
      "heading_path": [
        "3. LEARNING RESOURCE",
        "3.1. Main textbook"
      ],
      "primary_heading": "3.1. Main textbook",
      "breadcrumbs": "3. LEARNING RESOURCE > 3.1. Main textbook",
      "position": {
        "order": 6,
        "start_block": 35,
        "end_block": 36
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#007",
      "text": "[2] Kenneth H. Rosen (2019), Discrete Mathematics and Its Applications, Eighth Edition, McGraw-Hill Education.",
      "word_count": 14,
      "char_count": 110,
      "heading_path": [
        "3. LEARNING RESOURCE",
        "3.2. Other"
      ],
      "primary_heading": "3.2. Other",
      "breadcrumbs": "3. LEARNING RESOURCE > 3.2. Other",
      "position": {
        "order": 7,
        "start_block": 37,
        "end_block": 38
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#008",
      "text": "Goals | Objectives Goals Description | PLOs | Proficiency scale\nG1 | The course provides learners basic knowledge about sets, logic, mathematical systems, functions, series, relations, algorithms, number theory, counting problems, Dirichlet's principle, and graph theory. | PLO3 | 4\nG2 | The course equips learners with skills in the analysis, classification, and computation of objects: sets, propositions, functions, algorithms, strings, and graphs. | PLO3 | 3\nG3 | The course page allows learners to apply some algorithms on integers and graphs to solve practical problems such as encoding, finding the shortest path, coloring graphs, minimum tree frames, etc. | PLO6 | 3\nG4 | Self-study, work independently, work in groups, take personal responsibility, and be partly responsible for the group, accumulate experience to continue higher learning. | PLO7 | 3\nG5 | Understanding the law, civic responsibility; understanding professional behavior, and community interests. Understanding professional principles and ethics, time management, adapting to a changing work environment, adapting to globalization, and technology revolution 4.0 | PLO.10, 11 | 2,3",
      "word_count": 169,
      "char_count": 1156,
      "heading_path": [
        "4. COURSE GOALS"
      ],
      "primary_heading": "4. COURSE GOALS",
      "breadcrumbs": "4. COURSE GOALS",
      "position": {
        "order": 8,
        "start_block": 39,
        "end_block": 41
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#009",
      "text": "Table 5. Course learning outcomes (CLOs)\nGoals | CLOs | CLOs Description | Teaching level (I, T, U)\nG1 | CLO1.1 | Understand the concepts and computational bases of sets and propositions. Understand how sets are represented in computers and know the logic of google's search algorithm etc. Understand conflicting principles except for finding word-numbered parts of a set. | I\nG1 | CLO1.2 | Understand the fundamental objects of mathematical systems and methods of proof in mathematics. | I, T\nG1 | CLO1.3 | Understand the basic concepts and properties of functions and binary relationships. Understand how to build several functions with high computational applications, such as a linear pseudo-random function (linear congruence method), a hash function (hash function), and a visa card number check function (calculation of credit card check number). | I, T, U\nG1 | CLO1.4 | Understand the basic concepts and properties of algorithms, the operation of a basic algorithm such as a search, sorting, etc. Understand the object and function of a recursive algorithm. | I, T, U\nG1 | CLO1.5 | Understand basic concepts, properties, and algorithms in integers. Understand operations in the same radix system and how to convert between different radix systems. Know cryptography and understand how to build the RSA cryptosystem. | I, T, U\nG1 | CLO1.6 | Understand how to apply two basic counting principles, permutations, and combinations in counting problems. Understand combinatorics and position generation algorithms to solve some real-world problems. Know how to use Dirichlet's principle to show the existence of a combinatorial configuration. | I, T, U\nG1 | CLO1.7 | Understand the basic concepts and properties of graph theory. Understand the application of graphs in information technology, computer science, and data science. Translating graph theory into solving practical problems | I, T, U\nG2 | CLO2.1 | Proficient in sets, propositions, functions, operations with integers, and radix conversion. Proficient in using the principles of counting, permutations, and combinations to solve counting problems. Have skills in calculating quantities in graphs such as degree, Incidence matrix, adjacency matrix, weight matrix, path, the weighted sum of a tree, tree depth, etc. | I, T, U\nG2 | CLO2.2 | Have the skills to read, understand, present, analyze, evaluate an algorithm, and implement it. | T\nG3 | CLO3.1 | Apply knowledge and some algorithms about integers to build cryptographic systems such as anagrams or RSA. | I, T, U\nG3 | CLO3.2 | Apply combinatorial and permutation algorithms to solve the bag problem, the traveler problem, etc. | U\nG3 | CLO3.3 | Apply knowledge of graphs to solve practical problems, such as: Use the problem of finding the shortest path to find the path between two points on the map such as shortest distance or the least time or minimum cost, and using coloring problems in scheduling problems, wave frequency division, using the minimal spanning tree to design water pipelines, highway systems, etc. | U\nG4 | CLO4.1 | Develop self-study, work independently, and work in groups. | I\nG4 | CLO4.2 | Take personal responsibility, be partly responsible for the group, and accumulate experience to continue higher learning. | U\nG5 | CLO 5.1 | Understanding the law, civic responsibility; understanding professional behavior, and community interests. | I\nG5 | CLO 5.2 | Understanding professional principles and ethics, time management, adapting to a changing work environment, adapting to globalization, and technology revolution 4.0 | I",
      "word_count": 570,
      "char_count": 3571,
      "heading_path": [
        "5. COURSE LEARNING OUTCOMES (CLOs)"
      ],
      "primary_heading": "5. COURSE LEARNING OUTCOMES (CLOs)",
      "breadcrumbs": "5. COURSE LEARNING OUTCOMES (CLOs)",
      "position": {
        "order": 9,
        "start_block": 42,
        "end_block": 43
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#010",
      "text": "* Assessment methods:\n- Grading: 10\n- Average score of course is the total points of rubrics multiplied by the respective weight of each rubric\n* Assessment summary:\nTable 6. Assessment summary\nAssessments | Rubrics | CLOs | Weighting (%) | Week\nFormative assessment | Formative assessment | Formative assessment | Formative assessment | Formative assessment\nParticipant | Rubric 1 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3 | 10% | 1-15\nMidterm assessment | Midterm assessment | Midterm assessment | Midterm assessment | Midterm assessment\nProject | Rubric 2 | CLO 1.7 | 20% | 3-15\nMidterm exam | Rubric 3 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3; 4.1 – 4.2; 5.1-5.2 | 20% | 13-15\nSummative assessment | Summative assessment | Summative assessment | Summative assessment | Summative assessment\nFinal exam | Rubric 3 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3; 4.1 – 4.2; 5.1-5.2 | 50% | Follow final exam schedule\nRubric 1: Participant",
      "word_count": 168,
      "char_count": 923,
      "heading_path": [
        "6. COURSE ASSESSMENT"
      ],
      "primary_heading": "6. COURSE ASSESSMENT",
      "breadcrumbs": "6. COURSE ASSESSMENT",
      "position": {
        "order": 10,
        "start_block": 46,
        "end_block": 55
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#011",
      "text": "Areas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nAttendance | 50% | Attend all the sessions | Absent 2 sessions | Absent 3 sessions | Absent 4 sessions\nBeing active in the class | 50% | Answer at least 2 questions from the lecturer and give at least 2 comments and/or feedback for the lessons, discussion, or presentation | Answer at least 1 question from the lecturer and give at least 1 comment and/or feedback for the lessons, discussion, or presentation | Answer at least 1 question from the lecturer or give at least 1 comment and/or feedback for the lessons, discussion, or presentation | No Answer for questions from the lecturer and give no comments and/or feedback for the lessons, discussion, or presentation\nRubric 2: Project",
      "word_count": 149,
      "char_count": 818,
      "heading_path": [
        "6. COURSE ASSESSMENT"
      ],
      "primary_heading": "6. COURSE ASSESSMENT",
      "breadcrumbs": "6. COURSE ASSESSMENT",
      "position": {
        "order": 11,
        "start_block": 55,
        "end_block": 59
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#012",
      "text": "Areas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nData Collection and Preprocessing | 20% | Comprehensive collection of relevant data, thorough data preprocessing, handling missing values and outliers, ensuring data quality. | Sufficient data collection, adequate preprocessing techniques applied, reasonable handling of missing values and outliers. | Limited data collection, basic preprocessing steps taken, some issues with missing values and outliers. | Incomplete or insufficient data collection, inadequate preprocessing techniques, significant issues with missing values and outliers.\nExploratory Data Analysis: | 20% | Extensive and insightful analysis of data patterns, identifying trends, seasonality, correlations, and anomalies, utilizing appropriate visualizations. | Satisfactory analysis of data patterns, identifying some trends, seasonality, correlations, and anomalies, utilizing visualizations effectively. | Basic analysis of data patterns, limited identification of trends, seasonality, correlations, and anomalies, utilizing basic visualizations. | Inadequate analysis of data patterns, unable to identify significant trends, seasonality, correlations, and anomalies, ineffective use of visualizations.\nModeling and Prediction | 10% | Implementation of advanced time series or graph analysis models, accurate and precise predictions, thorough evaluation of model performance, consideration of appropriate metrics. | Implementation of suitable time series or graph analysis models, reasonably accurate predictions, evaluation of model performance using relevant metrics. | Basic implementation of time series or graph analysis models, limited accuracy in predictions, limited evaluation of model performance. | Inadequate implementation of time series or graph analysis models, inaccurate predictions, no or minimal evaluation of model performance.\nInterpretation and Insights | 20% | Comprehensive interpretation of results, meaningful insights and conclusions drawn from the analysis, identification of actionable recommendations. | Reasonable interpretation of results, some insights and conclusions drawn from the analysis, identification of potential recommendations. | Reasonable interpretation of results, some insights and conclusions drawn from the analysis, identification of potential recommendations. | Inadequate interpretation of results, lack of meaningful insights and conclusions, no or minimal recommendations.\nPresentation and Documentationrecommendations. | 30% | Clear and well-organized presentation of the project, effective communication of key findings, thorough documentation of methodologies and results. | Presentable project documentation, satisfactory communication of key findings, reasonable documentation of methodologies and results. | Basic project presentation, limited communication of findings, minimal documentation of methodologies and results. | Inadequate project presentation, unclear communication of findings, lack of documentation of methodologies and results.",
      "word_count": 398,
      "char_count": 3108,
      "heading_path": [
        "6. COURSE ASSESSMENT"
      ],
      "primary_heading": "6. COURSE ASSESSMENT",
      "breadcrumbs": "6. COURSE ASSESSMENT",
      "position": {
        "order": 12,
        "start_block": 59,
        "end_block": 59
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#013",
      "text": "Rubric 3: Midterm and Final exam\nAreas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nKnowledge and Understanding: | 40% | Demonstrates in-depth and comprehensive understanding of the concepts and theories in discrete mathematics, with the ability to apply them flexibly and accurately. | Shows good knowledge of the concepts and theories in discrete mathematics, with the ability to apply them correctly and effectively. | Possesses a basic understanding of the concepts and theories in discrete mathematics, with limited or inaccurate application. | Displays minimal understanding of the concepts and theories in discrete mathematics and cannot apply them effectively.\nProblem Solving and Exercises | 30% | Solves problems and exercises in discrete mathematics accurately, flexibly, and creatively. | Solves problems and exercises in discrete mathematics correctly and effectively. | Handles basic problems and exercises with some minor errors. | Unable to solve problems and exercises significantly in discrete mathematics\nExplanation and Presentation | 30% | Provides detailed, clear, and logical explanations of the problem-solving steps and results, with well-organized and easily understandable presentation. | Provides correct and clear explanations of the problem-solving steps and results, with organized and understandable presentation | Offers basic explanations with some shortcomings, and the presentation lacks organization or clarity. | Provides minimal or unclear explanations, with disorganized or inaccurate presentation.",
      "word_count": 236,
      "char_count": 1618,
      "heading_path": [
        "6. COURSE ASSESSMENT"
      ],
      "primary_heading": "6. COURSE ASSESSMENT",
      "breadcrumbs": "6. COURSE ASSESSMENT",
      "position": {
        "order": 13,
        "start_block": 61,
        "end_block": 63
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#014",
      "text": "Table 7. Course outline\nWeek | Content | Required readings text | CLOs | Teaching-learning activities | Assessment\n1 | - Syllabus - Introduction - Course Expected Outcomes Chapter 1. Logic and Set 1.1 Logic and propositions 1.2 Sets and operation on sets | - Syllabus [1] Chapter 1 [2] Chapter 1 | CLO1.1 CLO2.1 | Lecture, Q and A | Rubric 1\n2 | Chapter 2. Proofs 2.1 Mathematical system 2.2 Methods of proof 2.3 Inductive learning | [1] Chapter 2 [2] Chapter 1 | CLO1.2 | Lecture, Q and A Homework check | Rubric 1\n3 | Chapter 3. Functions, Strings, and Relations 3.1 Functions 3.2 Sequence and String | [1] Chapter 2,3 [2] Chapter 1,2 | CLO1.2 CLO1.3 CLO2.1 | Lecture, Q and A Homework check | Rubric 1\n4 | Chapter 3. Functions, Strings, and Relations 3.3 Relationships 3.4 Similarities | [1] Chapter 3,4 [2] Chapter 2,3 | - | Lecture, Q and A Homework check | Rubric 1\n5 | Chapter 4. Algorithms 4.1 Algorithm 4.2 Complexity of the algorithm 4.3 Recursive Algorithms Quiz 1+Seminar Talk | - | - | Lecture, Q and A Homework check | Rubric 1\n6 | Chapter 5. Introduction to number theory 5.1 Integer representation 5.2 Euclidean Algorithm 5.3 Cryptosystem RSA 5.4 Advanced cryptosystem | [1] Chapter 5 [2] Chapter 4 | CLO1.5 CLO2.1 CLO3.1 | Lecture, Q and A Homework check | Rubric 1\n7-8 | Chapter 6. Counting problems and Dirichlet's principle 6.1 Basic counting principles 6.2 Permutations and combinations 6.3 Algorithm for generating permutation and combinatorics. 6.4 Dirichlet's Principle Quiz 2+ Seminar Talk | [1] Chương 3 [2] Chương 4,6 [3] Chapter 6 [4] Chapter 6 | CLO1.6 CLO2.1 CLO2.2 CLO3.2 | Lecture, Q and A Homework check | Rubric 1\n9-11 | Chapter 7. Graph Theory 7.1 Graphs and graph models 7.2 Some special graphs 7.3 Graph representation 7.4 Connected graph 7.5 Euler path and Hamiltonian path 7.6 Shortest path 7.7 Planar graph and graph coloring | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO3.3 | Lecture, Q and A Homework check | Rubric 1\n12-13 | Chapter 8. Tree 8.1 Introduction 8.2 Applications of Trees 8.3 Tree Traversal 8.4 Spanning Trees 8.5. Minimum Spanning Trees | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO2.2 CLO3.3 | Lecture, Q and A Homework check | Rubric 1\n14 | Midterm Seminar Talk | - | CLO1.1-1.5 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | Rubric 3\n15 | Project presentation | - | CLO1.7 | Presentation and Q&A | Rubric 2\n- | Final exam | - | CLO1.1 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | Rubric 3",
      "word_count": 457,
      "char_count": 2525,
      "heading_path": [
        "7. COURSE OUTLINE"
      ],
      "primary_heading": "7. COURSE OUTLINE",
      "breadcrumbs": "7. COURSE OUTLINE",
      "position": {
        "order": 14,
        "start_block": 66,
        "end_block": 67
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#015",
      "text": "Table 8.1. Lesson plan for the course\nWeek | Content | Required readings text | CLOs | Teaching-learning activities | Assessment tools and criteria\n1 | - Syllabus - Introductions - Course Expectations Chapter 1. Logic and Set 1.1 Logic and propositions 1.2 Sets | - Syllabus [1] Chapter 1 [2] Chapter 1 | CLO1.1 CLO2.1 | Lecture, Q and A | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.1\n2 | Chapter 2. Proofs 2.1 Mathematical system 2.2 Methods of proof 2.3 Inductive learning | [1] Chapter 2 [2] Chapter 1 | CLO1.2 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n3 | Chapter 3. Functions, Strings, and Relations 3.1 Functions 3.2 Sequence and String | [1] Chapter 2,3 [2] Chapter 1,2 | CLO1.2 CLO1.3 CLO2.1 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n4 | Chapter 3. Functions, Strings, and Relations 3.3 Relationships 3.4 Similarities Quiz 1+Seminar Talk | [1] Chapter 3,4 [2] Chapter 2,3 | - | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n5 | Chapter 4. Algorithms 4.1 Algorithm 4.2 Complexity of the algorithm 4.3 Recursive Algorithms | - | - | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n6 | Chapter 5. Introduction to number theory 5.1 Integer representation 5.2 Euclidean Algorithm 5.3 Cryptosystem RSA | [1] Chapter 5 [2] Chapter 4 | CLO1.5 CLO2.1 CLO3.1 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n7-8 | Chapter 6. Counting problems and Dirichlet's principle 6.1 Basic counting principles 6.2 Permutations and combinations 6.3 Algorithm for generating permutation and combinatorics. 6.4 Dirichlet's Principle Quiz 2+Seminar Talk | [1] Chương 3 [2] Chương 4,6 [3] Chapter 6 [4] Chapter 6 | CLO1.6 CLO2.1 CLO2.2 CLO3.2 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n9-11 | Chapter 7. Graph Theory 7.1 Graphs and graph models 7.2 Some special graphs 7.3 Graph representation 7.4 Connected graph 7.5 Euler path and Hamiltonian path 7.6 Shortest path 7.7 Planar graph and graph coloring | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO3.3 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n12-13 | Chapter 8. Tree 8.1 Introduction 8.2 Applications of Trees 8.3 Tree Traversal 8.4 Spanning Trees 8.5. Minimum Spanning Trees | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO2.2 CLO3.3 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n14 | Midterm Seminar Talk | - | CLO1.1 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | -\n15 | Project presentation | - | CLO1.7 | Presentation and Q&A | -",
      "word_count": 618,
      "char_count": 3838,
      "heading_path": [
        "8. LESSON PLAN"
      ],
      "primary_heading": "8. LESSON PLAN",
      "breadcrumbs": "8. LESSON PLAN",
      "position": {
        "order": 15,
        "start_block": 71,
        "end_block": 72
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#016",
      "text": "- Students are allowed to take the final exam if their attendance score reaches 5 points or more (on the scale of 10).",
      "word_count": 23,
      "char_count": 118,
      "heading_path": [
        "9. COURSE REQUIREMENT & EXPECTATION",
        "9.1. Requirements for taking final /terminal exams"
      ],
      "primary_heading": "9.1. Requirements for taking final /terminal exams",
      "breadcrumbs": "9. COURSE REQUIREMENT & EXPECTATION > 9.1. Requirements for taking final /terminal exams",
      "position": {
        "order": 16,
        "start_block": 75,
        "end_block": 76
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#017",
      "text": "- Students are responsible for attending all classes. In case of absence from school due to force majeure reasons, sufficient and reasonable proofs must be provided. For each absence, 1 point will be deducted 1 point. Students who miss any classes more than 3 times, with or without reason, will be considered as failing to complete the course and have to re-register.\n- Students will be awarded points for constructive comments these points are added to attendance points and group assignments.\n- Groups who do not submit the group work will receive a score of 0 (zero). Late submissions will be deducted for each day of late submission.",
      "word_count": 108,
      "char_count": 638,
      "heading_path": [
        "9. COURSE REQUIREMENT & EXPECTATION",
        "9.2. Requirements for attending classes"
      ],
      "primary_heading": "9.2. Requirements for attending classes",
      "breadcrumbs": "9. COURSE REQUIREMENT & EXPECTATION > 9.2. Requirements for attending classes",
      "position": {
        "order": 17,
        "start_block": 77,
        "end_block": 80
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#018",
      "text": "- The course is conducted on the principle of respecting learners and lecturers. Any behaviour that affects the teaching and learning process is strictly prohibited.\n- Students must come to class on time. Students who are late more than 10 minutes after class starts will not be allowed to attend the class. Do not make noise and affect others during the learning process.\n- Laptops and tablets are only used for the purpose of taking notes for and calculating for lectures and exercises, absolutely forbidden to use for other purposes.",
      "word_count": 90,
      "char_count": 536,
      "heading_path": [
        "9. COURSE REQUIREMENT & EXPECTATION",
        "9.3. Requirements for in-class behaviour"
      ],
      "primary_heading": "9.3. Requirements for in-class behaviour",
      "breadcrumbs": "9. COURSE REQUIREMENT & EXPECTATION > 9.3. Requirements for in-class behaviour",
      "position": {
        "order": 18,
        "start_block": 81,
        "end_block": 85
      }
    },
    {
      "chunk_id": "en-ep17-tocb1107#019",
      "text": "Faculty Dean | NEU’s President\nDr Pham Xuan Lam | Prof. Dr Pham Hong Chuong",
      "word_count": 15,
      "char_count": 75,
      "heading_path": [
        "9. COURSE REQUIREMENT & EXPECTATION",
        "9.3. Requirements for in-class behaviour"
      ],
      "primary_heading": "9.3. Requirements for in-class behaviour",
      "breadcrumbs": "9. COURSE REQUIREMENT & EXPECTATION > 9.3. Requirements for in-class behaviour",
      "position": {
        "order": 19,
        "start_block": 85,
        "end_block": 86
      }
    }
  ],
  "full_text": "MINISTRY OF EDUCATION AND TRAINING NATIONAL ECONOMICS UNIVERSITY | SOCIALIST REPUBLIC OF VIETNAM Independence – Freedom – Happiness\nCOURSE SYLLABUS (Issued with Decision number 976/QĐ-ĐHKTQD by NEU’s President dated August 30, 2023) | COURSE SYLLABUS (Issued with Decision number 976/QĐ-ĐHKTQD by NEU’s President dated August 30, 2023)\nBachelor of Software Engineering | Bachelor of Software Engineering\n1. COURSE INFORMATION\n- Title: Discrete mathematic\n- Code:  EP17.TOCB1107\n- Credit hours for teaching and learning activities:\n- Lecture: 45 hrs\n- Exercises on class: 5 hrs\n- Presentation and Discussion: 3 hrs\n- Exercise and discussion: 7 hrs\n- Self-study: 90 hrs\n- Parallel course(s): None\n- Prerequisite course(s): None\n- Department conducting the course: Information Technology\n- Kind of the course:\nFoundation ✅ | Foundation ✅ | Fundamental □ | Fundamental □\nCompulsory ✅ | Elective | Compulsory □ | Elective □\n- Course language:  In English\n2. COURSE DESCRIPTION\nA Basic module of the bachelor's degree program modules is related to information technology, computer science, data science and fintech.... Discrete mathematics is a branch of Mathematics that studies discrete rather than continuous structures. The course also aims to train thinking capacity and calculation skills and improve the ability to apply mathematical knowledge to analyze and research problems in information technology. The course equips learners with the necessary knowledge, skills, and competencies to study and research related subjects in the training program and continue to higher education. At the end of the course, learners can do a graph network data analysis project.\nCourse outline:\n- Logic and Set\n- Proofs\n- Functions, Strings and Relation\n- Algorithms\n- Introduction to Number Theory\n- Counting problems and Dirichlet’s Principle\n- Graph Theory\n- Tree\nSeminar talks: The goal is to introduce state-of-the-art applications of discrete mathematics in the modern technology. Besides, invited student-speakers can be included to share about their scientific projects related to the course’s materials.\nOutcomes assessment:\n- (10%) Participant\n- (40%) Quiz + Midterm: quiz 1 (10%), quiz 2 (10%), project presentation (5%) and midterm (15%).\n- (50%) Final Exam\n3. LEARNING RESOURCE\n3.1. Main textbook\n[1] Richard Johnsonbaugh (2018), Discrete Mathematics, Eighth Edition, Pearson.\n3.2. Other\n[2] Kenneth H. Rosen (2019), Discrete Mathematics and Its Applications, Eighth Edition, McGraw-Hill Education.\n4. COURSE GOALS\nGoals | Objectives Goals Description | PLOs | Proficiency scale\nG1 | The course provides learners basic knowledge about sets, logic, mathematical systems, functions, series, relations, algorithms, number theory, counting problems, Dirichlet's principle, and graph theory. | PLO3 | 4\nG2 | The course equips learners with skills in the analysis, classification, and computation of objects: sets, propositions, functions, algorithms, strings, and graphs. | PLO3 | 3\nG3 | The course page allows learners to apply some algorithms on integers and graphs to solve practical problems such as encoding, finding the shortest path, coloring graphs, minimum tree frames, etc. | PLO6 | 3\nG4 | Self-study, work independently, work in groups, take personal responsibility, and be partly responsible for the group, accumulate experience to continue higher learning. | PLO7 | 3\nG5 | Understanding the law, civic responsibility; understanding professional behavior, and community interests. Understanding professional principles and ethics, time management, adapting to a changing work environment, adapting to globalization, and technology revolution 4.0 | PLO.10, 11 | 2,3\n5. COURSE LEARNING OUTCOMES (CLOs)\nTable 5. Course learning outcomes (CLOs)\nGoals | CLOs | CLOs Description | Teaching level (I, T, U)\nG1 | CLO1.1 | Understand the concepts and computational bases of sets and propositions. Understand how sets are represented in computers and know the logic of google's search algorithm etc. Understand conflicting principles except for finding word-numbered parts of a set. | I\nG1 | CLO1.2 | Understand the fundamental objects of mathematical systems and methods of proof in mathematics. | I, T\nG1 | CLO1.3 | Understand the basic concepts and properties of functions and binary relationships. Understand how to build several functions with high computational applications, such as a linear pseudo-random function (linear congruence method), a hash function (hash function), and a visa card number check function (calculation of credit card check number). | I, T, U\nG1 | CLO1.4 | Understand the basic concepts and properties of algorithms, the operation of a basic algorithm such as a search, sorting, etc. Understand the object and function of a recursive algorithm. | I, T, U\nG1 | CLO1.5 | Understand basic concepts, properties, and algorithms in integers. Understand operations in the same radix system and how to convert between different radix systems. Know cryptography and understand how to build the RSA cryptosystem. | I, T, U\nG1 | CLO1.6 | Understand how to apply two basic counting principles, permutations, and combinations in counting problems. Understand combinatorics and position generation algorithms to solve some real-world problems. Know how to use Dirichlet's principle to show the existence of a combinatorial configuration. | I, T, U\nG1 | CLO1.7 | Understand the basic concepts and properties of graph theory. Understand the application of graphs in information technology, computer science, and data science. Translating graph theory into solving practical problems | I, T, U\nG2 | CLO2.1 | Proficient in sets, propositions, functions, operations with integers, and radix conversion. Proficient in using the principles of counting, permutations, and combinations to solve counting problems. Have skills in calculating quantities in graphs such as degree, Incidence matrix, adjacency matrix, weight matrix, path, the weighted sum of a tree, tree depth, etc. | I, T, U\nG2 | CLO2.2 | Have the skills to read, understand, present, analyze, evaluate an algorithm, and implement it. | T\nG3 | CLO3.1 | Apply knowledge and some algorithms about integers to build cryptographic systems such as anagrams or RSA. | I, T, U\nG3 | CLO3.2 | Apply combinatorial and permutation algorithms to solve the bag problem, the traveler problem, etc. | U\nG3 | CLO3.3 | Apply knowledge of graphs to solve practical problems, such as: Use the problem of finding the shortest path to find the path between two points on the map such as shortest distance or the least time or minimum cost, and using coloring problems in scheduling problems, wave frequency division, using the minimal spanning tree to design water pipelines, highway systems, etc. | U\nG4 | CLO4.1 | Develop self-study, work independently, and work in groups. | I\nG4 | CLO4.2 | Take personal responsibility, be partly responsible for the group, and accumulate experience to continue higher learning. | U\nG5 | CLO 5.1 | Understanding the law, civic responsibility; understanding professional behavior, and community interests. | I\nG5 | CLO 5.2 | Understanding professional principles and ethics, time management, adapting to a changing work environment, adapting to globalization, and technology revolution 4.0 | I\n6. COURSE ASSESSMENT\n* Assessment methods:\n- Grading: 10\n- Average score of course is the total points of rubrics multiplied by the respective weight of each rubric\n* Assessment summary:\nTable 6. Assessment summary\nAssessments | Rubrics | CLOs | Weighting (%) | Week\nFormative assessment | Formative assessment | Formative assessment | Formative assessment | Formative assessment\nParticipant | Rubric 1 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3 | 10% | 1-15\nMidterm assessment | Midterm assessment | Midterm assessment | Midterm assessment | Midterm assessment\nProject | Rubric 2 | CLO 1.7 | 20% | 3-15\nMidterm exam | Rubric 3 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3; 4.1 – 4.2; 5.1-5.2 | 20% | 13-15\nSummative assessment | Summative assessment | Summative assessment | Summative assessment | Summative assessment\nFinal exam | Rubric 3 | CLO 1.1 – 1.7; 2.1 – 2.2; 3.1 – 3.3; 4.1 – 4.2; 5.1-5.2 | 50% | Follow final exam schedule\nRubric 1: Participant\nAreas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nAttendance | 50% | Attend all the sessions | Absent 2 sessions | Absent 3 sessions | Absent 4 sessions\nBeing active in the class | 50% | Answer at least 2 questions from the lecturer and give at least 2 comments and/or feedback for the lessons, discussion, or presentation | Answer at least 1 question from the lecturer and give at least 1 comment and/or feedback for the lessons, discussion, or presentation | Answer at least 1 question from the lecturer or give at least 1 comment and/or feedback for the lessons, discussion, or presentation | No Answer for questions from the lecturer and give no comments and/or feedback for the lessons, discussion, or presentation\nRubric 2: Project\nAreas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nData Collection and Preprocessing | 20% | Comprehensive collection of relevant data, thorough data preprocessing, handling missing values and outliers, ensuring data quality. | Sufficient data collection, adequate preprocessing techniques applied, reasonable handling of missing values and outliers. | Limited data collection, basic preprocessing steps taken, some issues with missing values and outliers. | Incomplete or insufficient data collection, inadequate preprocessing techniques, significant issues with missing values and outliers.\nExploratory Data Analysis: | 20% | Extensive and insightful analysis of data patterns, identifying trends, seasonality, correlations, and anomalies, utilizing appropriate visualizations. | Satisfactory analysis of data patterns, identifying some trends, seasonality, correlations, and anomalies, utilizing visualizations effectively. | Basic analysis of data patterns, limited identification of trends, seasonality, correlations, and anomalies, utilizing basic visualizations. | Inadequate analysis of data patterns, unable to identify significant trends, seasonality, correlations, and anomalies, ineffective use of visualizations.\nModeling and Prediction | 10% | Implementation of advanced time series or graph analysis models, accurate and precise predictions, thorough evaluation of model performance, consideration of appropriate metrics. | Implementation of suitable time series or graph analysis models, reasonably accurate predictions, evaluation of model performance using relevant metrics. | Basic implementation of time series or graph analysis models, limited accuracy in predictions, limited evaluation of model performance. | Inadequate implementation of time series or graph analysis models, inaccurate predictions, no or minimal evaluation of model performance.\nInterpretation and Insights | 20% | Comprehensive interpretation of results, meaningful insights and conclusions drawn from the analysis, identification of actionable recommendations. | Reasonable interpretation of results, some insights and conclusions drawn from the analysis, identification of potential recommendations. | Reasonable interpretation of results, some insights and conclusions drawn from the analysis, identification of potential recommendations. | Inadequate interpretation of results, lack of meaningful insights and conclusions, no or minimal recommendations.\nPresentation and Documentationrecommendations. | 30% | Clear and well-organized presentation of the project, effective communication of key findings, thorough documentation of methodologies and results. | Presentable project documentation, satisfactory communication of key findings, reasonable documentation of methodologies and results. | Basic project presentation, limited communication of findings, minimal documentation of methodologies and results. | Inadequate project presentation, unclear communication of findings, lack of documentation of methodologies and results.\nRubric 3: Midterm and Final exam\nAreas of assessment | Weighting (%) | Excellence 8.5 – 10 point | Good 6.5 – 8.4 point | Fair 4.0 – 6.4 point | Poor 0 – 3.9 point\nKnowledge and Understanding: | 40% | Demonstrates in-depth and comprehensive understanding of the concepts and theories in discrete mathematics, with the ability to apply them flexibly and accurately. | Shows good knowledge of the concepts and theories in discrete mathematics, with the ability to apply them correctly and effectively. | Possesses a basic understanding of the concepts and theories in discrete mathematics, with limited or inaccurate application. | Displays minimal understanding of the concepts and theories in discrete mathematics and cannot apply them effectively.\nProblem Solving and Exercises | 30% | Solves problems and exercises in discrete mathematics accurately, flexibly, and creatively. | Solves problems and exercises in discrete mathematics correctly and effectively. | Handles basic problems and exercises with some minor errors. | Unable to solve problems and exercises significantly in discrete mathematics\nExplanation and Presentation | 30% | Provides detailed, clear, and logical explanations of the problem-solving steps and results, with well-organized and easily understandable presentation. | Provides correct and clear explanations of the problem-solving steps and results, with organized and understandable presentation | Offers basic explanations with some shortcomings, and the presentation lacks organization or clarity. | Provides minimal or unclear explanations, with disorganized or inaccurate presentation.\n7. COURSE OUTLINE\nTable 7. Course outline\nWeek | Content | Required readings text | CLOs | Teaching-learning activities | Assessment\n1 | - Syllabus - Introduction - Course Expected Outcomes Chapter 1. Logic and Set 1.1 Logic and propositions 1.2 Sets and operation on sets | - Syllabus [1] Chapter 1 [2] Chapter 1 | CLO1.1 CLO2.1 | Lecture, Q and A | Rubric 1\n2 | Chapter 2. Proofs 2.1 Mathematical system 2.2 Methods of proof 2.3 Inductive learning | [1] Chapter 2 [2] Chapter 1 | CLO1.2 | Lecture, Q and A Homework check | Rubric 1\n3 | Chapter 3. Functions, Strings, and Relations 3.1 Functions 3.2 Sequence and String | [1] Chapter 2,3 [2] Chapter 1,2 | CLO1.2 CLO1.3 CLO2.1 | Lecture, Q and A Homework check | Rubric 1\n4 | Chapter 3. Functions, Strings, and Relations 3.3 Relationships 3.4 Similarities | [1] Chapter 3,4 [2] Chapter 2,3 | - | Lecture, Q and A Homework check | Rubric 1\n5 | Chapter 4. Algorithms 4.1 Algorithm 4.2 Complexity of the algorithm 4.3 Recursive Algorithms Quiz 1+Seminar Talk | - | - | Lecture, Q and A Homework check | Rubric 1\n6 | Chapter 5. Introduction to number theory 5.1 Integer representation 5.2 Euclidean Algorithm 5.3 Cryptosystem RSA 5.4 Advanced cryptosystem | [1] Chapter 5 [2] Chapter 4 | CLO1.5 CLO2.1 CLO3.1 | Lecture, Q and A Homework check | Rubric 1\n7-8 | Chapter 6. Counting problems and Dirichlet's principle 6.1 Basic counting principles 6.2 Permutations and combinations 6.3 Algorithm for generating permutation and combinatorics. 6.4 Dirichlet's Principle Quiz 2+ Seminar Talk | [1] Chương 3 [2] Chương 4,6 [3] Chapter 6 [4] Chapter 6 | CLO1.6 CLO2.1 CLO2.2 CLO3.2 | Lecture, Q and A Homework check | Rubric 1\n9-11 | Chapter 7. Graph Theory 7.1 Graphs and graph models 7.2 Some special graphs 7.3 Graph representation 7.4 Connected graph 7.5 Euler path and Hamiltonian path 7.6 Shortest path 7.7 Planar graph and graph coloring | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO3.3 | Lecture, Q and A Homework check | Rubric 1\n12-13 | Chapter 8. Tree 8.1 Introduction 8.2 Applications of Trees 8.3 Tree Traversal 8.4 Spanning Trees 8.5. Minimum Spanning Trees | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO2.2 CLO3.3 | Lecture, Q and A Homework check | Rubric 1\n14 | Midterm Seminar Talk | - | CLO1.1-1.5 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | Rubric 3\n15 | Project presentation | - | CLO1.7 | Presentation and Q&A | Rubric 2\n- | Final exam | - | CLO1.1 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | Rubric 3\n8. LESSON PLAN\nTable 8.1. Lesson plan for the course\nWeek | Content | Required readings text | CLOs | Teaching-learning activities | Assessment tools and criteria\n1 | - Syllabus - Introductions - Course Expectations Chapter 1. Logic and Set 1.1 Logic and propositions 1.2 Sets | - Syllabus [1] Chapter 1 [2] Chapter 1 | CLO1.1 CLO2.1 | Lecture, Q and A | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.1\n2 | Chapter 2. Proofs 2.1 Mathematical system 2.2 Methods of proof 2.3 Inductive learning | [1] Chapter 2 [2] Chapter 1 | CLO1.2 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n3 | Chapter 3. Functions, Strings, and Relations 3.1 Functions 3.2 Sequence and String | [1] Chapter 2,3 [2] Chapter 1,2 | CLO1.2 CLO1.3 CLO2.1 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n4 | Chapter 3. Functions, Strings, and Relations 3.3 Relationships 3.4 Similarities Quiz 1+Seminar Talk | [1] Chapter 3,4 [2] Chapter 2,3 | - | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n5 | Chapter 4. Algorithms 4.1 Algorithm 4.2 Complexity of the algorithm 4.3 Recursive Algorithms | - | - | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n6 | Chapter 5. Introduction to number theory 5.1 Integer representation 5.2 Euclidean Algorithm 5.3 Cryptosystem RSA | [1] Chapter 5 [2] Chapter 4 | CLO1.5 CLO2.1 CLO3.1 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n7-8 | Chapter 6. Counting problems and Dirichlet's principle 6.1 Basic counting principles 6.2 Permutations and combinations 6.3 Algorithm for generating permutation and combinatorics. 6.4 Dirichlet's Principle Quiz 2+Seminar Talk | [1] Chương 3 [2] Chương 4,6 [3] Chapter 6 [4] Chapter 6 | CLO1.6 CLO2.1 CLO2.2 CLO3.2 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n9-11 | Chapter 7. Graph Theory 7.1 Graphs and graph models 7.2 Some special graphs 7.3 Graph representation 7.4 Connected graph 7.5 Euler path and Hamiltonian path 7.6 Shortest path 7.7 Planar graph and graph coloring | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO3.3 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n12-13 | Chapter 8. Tree 8.1 Introduction 8.2 Applications of Trees 8.3 Tree Traversal 8.4 Spanning Trees 8.5. Minimum Spanning Trees | [2] Chapter 10 [1] Chapter 8 | CLO1.7 CLO2.1 CLO2.2 CLO3.3 | Lecture, Q and A Homework check | Learning process assessment percentage: 10%, including Required Attendance at taught classes, Level of engagement in class, and Quality of answers to lecturer’s questions.\n14 | Midterm Seminar Talk | - | CLO1.1 CLO1.2 CLO1.3 CLO1.4 CLO1.5 CLO2.1 CLO2.2 CLO3.1 CLO4.1 CLO4.2 | Writing test | -\n15 | Project presentation | - | CLO1.7 | Presentation and Q&A | -\n9. COURSE REQUIREMENT & EXPECTATION\n9.1. Requirements for taking final /terminal exams\n- Students are allowed to take the final exam if their attendance score reaches 5 points or more (on the scale of 10).\n9.2. Requirements for attending classes\n- Students are responsible for attending all classes. In case of absence from school due to force majeure reasons, sufficient and reasonable proofs must be provided. For each absence, 1 point will be deducted 1 point. Students who miss any classes more than 3 times, with or without reason, will be considered as failing to complete the course and have to re-register.\n- Students will be awarded points for constructive comments these points are added to attendance points and group assignments.\n- Groups who do not submit the group work will receive a score of 0 (zero). Late submissions will be deducted for each day of late submission.\n9.3. Requirements for in-class behaviour\n- The course is conducted on the principle of respecting learners and lecturers. Any behaviour that affects the teaching and learning process is strictly prohibited.\n- Students must come to class on time. Students who are late more than 10 minutes after class starts will not be allowed to attend the class. Do not make noise and affect others during the learning process.\n- Laptops and tablets are only used for the purpose of taking notes for and calculating for lectures and exercises, absolutely forbidden to use for other purposes.\nFaculty Dean | NEU’s President\nDr Pham Xuan Lam | Prof. Dr Pham Hong Chuong"
}